"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Mone is a cisgender ally among us. She's quite a cute little girl.\"),\"\\n\",Vue.h(_components.p,null,\"She loves idol groups and singing TV programmes in Japan and South Korea, and often reposts their tweets.\"),\"\\n\",Vue.h(_components.p,null,\"She also plays Minecraft. In that game, she built a small villa with a cozy room belonging to herself.\"),\"\\n\",Vue.h(_components.p,null,\"According to Mone, she never got happiness and love. Her parents got divorced in the first half of 2023. After that, she lived with her mother. The lack of love from family made her depressed. During the past 7 months, her father always refused to visit her, and her paternal grandmother didn't care about her any more. She was treated for depression in hospital. It was a period she missed, because she received lots of love from other patients:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"You should live for yourself, you are not a burden of your mother.\"),\"\\n\",Vue.h(_components.p,null,\"I think you are so lovely. Do not feel inferior or blame yourself anymore.\"),\"\\n\",Vue.h(_components.p,null,\"I feel you are so lovely, very beautiful, sensible and tough. It's quite difficult to deal with these things.\"),\"\\n\",Vue.h(_components.p,null,\"You are a sweet child. Please tell me when you are in trouble. Live happily! (Smile)\"),\"\\n\",Vue.h(_components.p,null,\"Sweet sister, from now on, we will together seek happy lives. After this, we will together recover and be discharged! Don't worry, I will be with you.\"),\"\\n\",Vue.h(_components.p,null,\"You are lovely and honest.\"),\"\\n\",Vue.h(_components.p,null,\"You are lovely and sensitive. You are not responsible for others' misfortune. You can be more selfish and love yourself more.\"),\"\\n\",Vue.h(_components.p,null,\"May you be happy every day! (Cat Emoji)\"),\"\\n\",Vue.h(_components.p,null,\"Live better, love yourself more.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/messages1.webp\",\"${path}/photos/messages2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"She was very fond of her little brother. Days before her birthday, her father finally visited her with her little brother briefly, and she had a jolly time with little brother. But after their leaving, huge gap between afterglow and reality made her sadly again, and her depression and self-reproach got even worse.\"),\"\\n\",Vue.h(_components.p,null,\"Although she was in major depressive disorder, she still shared her daily life happily with us, and comforted herself by watching beautiful sunset and sweet flowers.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\",\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Before Mone chose to depart, she left a cute picture to express that she was fond of all of us.\"),\"\\n\",Vue.h(_components.p,null,\"Goodnight, Mone. May you get more care and warm hugs, and be a light-hearted girl.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"