{"id":"ArtsEpiphany","profileUrl":"${path}/photos/profile.jpg","info":[["昵称","Arts"],["逝世","2023-03-13"]],"websites":[["twitter","https://twitter.com/ArtsEpiphany1"],["github","https://github.com/ArtsEpiphany"]],"name":"ArtsEpiphany","comments":[{"id":-1,"content":"根据 Arts 的遗愿，我们将她的页面设置为全页空白。正如 Arts 自己所说的：「允许建页面就是允许大家记住 Arts 呢，留白只是因为每个人都只能看到 Arts 的一小部分，也许 Arts 没有一个朋友对 Arts 有“基本完全”的了解吧…… 或者说只有 Arts 才清楚自己是什么样子的。所以谁来写，都只是一个侧面而已。」因此请大家用评论的方式，留下那些，Arts 身上让你感动的侧面吧。","submitter":"One Among Us","date":"Mar 21, 2023"},{"id":-2,"content":"我看到一段文字，记在下面。\n『3 月 15 日，大家传言清华一名学生离世了。\n『第二天我在朋友圈看到别人转的死者公开信，得知死者是跨性别者 Arts，是自杀离世的。\n『也是在 3 月 16 日，晚饭后，我在食堂附近看见了很大的动静。几个手里捧着花的同学，在紫荆园附近被一群身材高大魁梧、都穿一身黑的年轻男性围住了。看起来黑衣人在不断地冲撞同学的身体，堵住他们的去路，并试图抢走花。我一开始只是好奇，但反复听到一个女同学高声哭喊：“你们是谁！你们要做什么！”甚至还听到“救命啊！” ，我觉得我不能让她一个人处在这么危险的环境里，所以想留一会儿看看会不会有危险。四周的黑衣人怕有二三十个，有的头上还戴着耳机。他们持续地围堵，对哭喊无动于衷，也不听被围住的同学说话。我当时不清楚发生了什么，但已经很愤怒了。如果现场没有一些被哭喊吸引而驻足观望的同学，黑衣人们又会做什么呢？\n『（事后一想，平时也没在学校里见过这样的身影，他们肯定都是便衣。）\n『不久，女同学好像更崩溃了，她非常绝望地在喊“我的朋友死了！我只是要哀悼 ta！”我才明白这些同学是要用花悼念 arts，因为 15 日传言中的出事地点正是旁边的宿舍楼，他们也正在围堵中向那个方向挣扎。他们也就挣扎了几米远，到了紫荆园前的路口中，黑衣人们似乎就不打算让他们继续挪动了。我往前想离他们近一点，但被黑衣人拦着。我看见其中有同学提出想去操场上，也被封住去路。有的黑衣人还在对现场进行拍摄，一点都不顾忌他们的包围圈妨碍了路口的通行。\n『这样又僵持了一阵。黑衣人中有人说出“等校领导来”这样的字眼。然后，确实有个像是老师的人过来了，他就像没注意到黑衣人们，直接和捧花的同学们交涉起来。有同学大声向他质问黑衣人是谁，似乎没有得到答案，不过黑衣人此时也不再紧逼同学们的身体。然后同学们和这个人一起去了出事的宿舍楼下，我看见他们安静地把花放在墙脚，不一会就分散离去。此时仍有很多黑衣人守在原地，也有一些分头尾随了离开的同学们。\n『其实学校里每年都有几个同学去世，这些消息会在校方一如既往的封锁中曲折地传播，然后被遗忘。我也曾为去世的同学摆花哀悼，然后花在几小时内就被清除了。但我很难理解为什么这次同学们的哀悼会遇到这样激烈的破坏，我从未见过这样的场面，更没想象过它会发生在我每天生活的校园里。 』\n如果仅仅因为我们是跨性别，而跨性别是西方 LGBT 思想的载体，危害社会稳定ーー于是哪怕是我们的离去也要让人无从知晓，哪怕是最悲伤的事也要让人无从纪念，那我真的太伤心了。\n总要有一个地方纪念离去的大家，总要有一个地方让我们永远存在。我想 One Among Us 就是这样来的吧。大家都要好好活着呀。好好活着，好好地记录世间。无论有多少阻碍、多少破坏，我们都要保证 ta 们至少能在这有一个完整的归宿。","submitter":"One Among Us","date":"Mar 21, 2023"},{"id":10019,"content":"我總是在提交 PR 時犯下各種愚蠢的錯誤。然而她總是耐心和樂觀地與我指點、甚至做一些應該是我個人來修改的內容。\n共誰同訴斷腸痛，此恨總難平。","submitter":"匿名","date":"Mar 21, 2023"},{"id":10020,"content":"晚安  都要好好的我们","submitter":"风晚","date":"Mar 21, 2023"},{"id":10021,"content":"arts 很喜欢唱歌，很喜欢那些老歌","submitter":"Anonymous","date":"Mar 21, 2023"},{"id":10022,"content":"我还记得我进 ICU 那天，arts 连着给我打五个电话，差点就要到我在的城市来找我了，知道我没事了才放心下来\narts 是一个任何时候都会想着对别人好的很好很好的孩子，我还记得以前 arts 曾经还对我说想要成为“我这样的”善良美好的人，虽然唯一 arts 犯过的错大概就是以为我是个好人了\n但是 arts 一直都是善良美好的好孩子，永远都是，也不需要去成为“谁那样的”，从一开始 arts 就是","submitter":"Anonymous","date":"Mar 21, 2023"},{"id":10023,"content":"愿你再次睁开眼时，已经到达善良的世界\n\n你的故事，将由我们续写下去；\n你的理想，就由我们来继续\n\n最后，对不起，我没能逆天改命救下你","submitter":"Arlia Étoile","date":"Mar 21, 2023"},{"id":10024,"content":"arts，不要忘了来长沙喝茶颜，我随时都可以陪你。我去北京给你带的茶包你没拿，到时候记得来湖南给你多买几包。\n记得好好休息，别老是在凌晨三四点发文件，好好睡觉才能保持大脑的清醒并提升工作效率。\n等回复……","submitter":"匿名的人","date":"Mar 21, 2023"},{"id":10025,"content":"姐姐晚安，以后学到计算理论的时候就会想起你...","submitter":"silvicky","date":"Mar 21, 2023"},{"id":10026,"content":"晚安了。。。愿来世可以做一个幸福的女孩子","submitter":"璃","date":"Mar 21, 2023"},{"id":10027,"content":"还记得我去年第一次去北京的时候，跟 arts 在天安门的地铁站见面，一起去了王府井的苹果店看手机...那是我第一次和 arts 贴贴，也是第一次和 mtf 线下见面，差不多一年过去了，还是在北京，这一次我终于能进到清华园里，和 arts 一起在校内逛，可是就在分别后的第五或是第六天，arts 就走了，谁能想到那天那个抱抱居然会是最后一次抱抱...晚安了，arts，希望你在那边能好好的，好想再抱抱 arts 唉...","submitter":"ht丶","date":"Mar 21, 2023"},{"id":10028,"content":"我…不愿意相信…\n你一定只是躲藏起来并冷眼看着圈内的一切吧😭","submitter":"Noira","date":"Mar 21, 2023"},{"id":10029,"content":"虽然只有 [一面之缘](https://github.com/project-trans/RLE-wiki/pull/84)，但还是好心痛……为什么在这样的精神状态下还要勉强自己去维护项目啊，甚至 [当天](https://github.com/project-trans/MtF-wiki/commit/d36567dd82645a65d58a89daada66f31345b804a) 都还在这么做……","submitter":"北雁云依","date":"Mar 21, 2023"},{"id":10030,"content":"仍然记得和姐姐在金鱼胡同的那次相遇\n谈天说地...聊 limelight...聊姐姐以前的经历\n也记得姐姐总是很想要抱抱...和姐姐一起聊了很多未来学业有关的事情...约定好明年暑假再来北京找 arts 玩...\n不过呢...一眨眼斯人已逝...徒留我一人...\n写的有些乱呀...不过 arts...我真的好想你...","submitter":"Anonymous","date":"Mar 21, 2023"},{"id":10031,"content":"至今仍能记得去年夏天在 apm 见的那一面，和你一起讨论自己未来的学术方向，讨论 limelight 的不公和跨性别论坛的建设...\n也记得你会听我诉说人生的不如意...然后主动抱抱我，安慰我...\n我当时就在想...这样善良又善解人意的女孩子，真的是值得我去守护的人...她经历了那么多现实的不公...却还能为自己和其它受害者撑起一片天地...我有时候真的觉得是造化弄人，温柔善良的人难以被世界温柔以待...\n现在你走了...我很后悔没能保护好你的纯真和善良...对不起...","submitter":"浅月澪","date":"Mar 21, 2023"},{"id":10033,"content":"前半句已经没有意义。在这里，只需要后半句。“不废江河万古流”。晚安，莫忘。","submitter":"MatF","date":"Mar 21, 2023"},{"id":10036,"content":"我的第一次 rle 尝试就是和 Arts 姐姐面姬的时候呢…Arts 姐姐经常想要贴贴抱抱，还问我能不能摸一摸头…我精神状态很糟的时候也常找 Arts 姐姐，Arts 姐姐也总能理解…最后一次见面的时候 Arts 姐姐抱着我说“让 Arts 给你力量吧”…","submitter":"R. M.","date":"Mar 21, 2023"},{"id":10037,"content":"## ArtsEpiphany\n\n尽管妳，相比我们来说，都要大，但妳还是把自己当作一个小妹妹，总是在叫我们「姐姐」  \n是个有趣的姐妹呢...  \n\n还记得，妳找到咱的时候， \n那是咱吞药后被送到医院抢救回来后  \n那个晚上，我把所以的负面情绪都扔到了天外  \n妳在刚认识咱的时候，便表现出了极大的信任  \n那时，永仪还是妳的主人  \n妳把所有的情绪，所有的想法，都抛给了我——妳甚至对此有些抱歉  \n却不知道，那正是咱所需要的——而不是单纯的关心  \n  \n除了 limelight, 妳所痛恨的，还有「桔子团体」  \n还有这世界上一切的作恶  \n而我呢... 作为「姐姐」, 却没能有任何一点帮助...  \n\n> 姐姐们总是这样子的...  \n> 前一天嘴上还说这不要担心然后就消失了......  \n\n妳不愿面对的，是大家毫无征兆的離開  \n然而，妳的离开，虽不能说「毫无征兆」, 也令人 难以置信  \n\n从沈阳，到北京。清华园是妳最后的归宿  \n二十二载的光阴，我们无从知晓妳所承受的痛苦  \n一百四十日的重生，也难以给妳带来任何快乐  \n对世界的希望，如此般，破裂  \n而妳，如烟花，在黑暗之天空中绽放，照亮前行之路  \n炸出一条通路，为我们  \n\n阳春三月，飘起了雪花  \n而那樱花，却依然如故  \n\n相信吧，这个世界，终如你所愿  \n\nArts, 晚安  \n妳在那边，过的安好...\n\n\n如果哪天还是被欺负了…  \n尽管和咱说哦…  \n咱一定会过去保护妳的哦","submitter":"Elihuso Quigley","date":"Mar 21, 2023"},{"id":10038,"content":"咱跟 Arts 姐姐的接触不多.....在跨岛上有过几次接触，咱一直不太敢说话，姐姐倒是很温柔的跟咱说没关系，欢迎咱什么的...\n新年的时候也互相祝福了 [新年快乐].......\n姐姐超级充沛的学识也给咱留下了深刻印象....可...一切就是那么的突然...\n\n晚安....如果有来世，姐姐一定要幸福哦....\n","submitter":"夏鸢","date":"Mar 22, 2023"},{"id":10039,"content":"晚安，你载着风到达的新世界里，一定会如愿的吧～","submitter":"尚绝诺","date":"Mar 22, 2023"},{"id":10040,"content":"我亲爱的朋友。\n我不爱刻奇哭坟运动，感谢你的付出，虽然教训如此惨痛。\n公无渡河，公竟渡河，渡河而死，其奈公何。\n历史不属于你的敌人，而属于真心爱你的人们。","submitter":"翕然","date":"Mar 22, 2023"},{"id":10041,"content":"因为渴望拯救我们，你创造了新的世界，对吗？","submitter":"Rin","date":"Mar 22, 2023"},{"id":10042,"content":"想来还见过你一面来着","submitter":"匿名","date":"Mar 22, 2023"},{"id":11001,"content":"我想你了 arts……\n想要一起抱抱……","submitter":"Anonymous","date":"Mar 22, 2023"},{"id":11002,"content":"一定要做幸福的女孩子","submitter":"小可","date":"Mar 22, 2023"},{"id":11003,"content":"喵……去年十二月份还在撒娇贴贴呢……可惜后来就没怎么联系，她真的很可爱……叫咱不要笨笨呢……结果自己笨笨了……","submitter":"砂糖喵","date":"Mar 22, 2023"},{"id":11004,"content":"郁青霞之奇意，入修夜之不旸。痛惜。Arts 晚安。","submitter":"子沐","date":"Mar 22, 2023"},{"id":11005,"content":"我从你的宿舍门外路过过，只见过你的侧脸。你不认识我，你不知道我的存在，但我知道你。去年秋天让人伤心，但只要想到你变得更喜欢自己了，我就觉得这个世界还好、还值得。我能做的，就是默默的，只是看着你，你只要在一天，我就觉得世界是如常的，人类是如常的，这样我也能开心，也能走下去。我们还在你身边啊，即使你不知道，但我们还在爱着你啊。如果我勇敢地去敲你的门，事情会不会不一样？我觉得我比你更软弱，我错了，我明明可以抱住你的。你的那个位置空了，我什么也抓不住，对不起\n\n我想你了","submitter":"予","date":"Mar 22, 2023"},{"id":11007,"content":"“那么同样的，史莱姆姐姐活着就是 Arts 活着呢！”\n史莱姆姐姐想你了……","submitter":"Arts Rimuro Suraimu","date":"Mar 24, 2023"},{"id":11008,"content":"宝贝这辈子不能当我的伴娘了，下辈子来当我的女儿吧宝宝","submitter":"xe2000","date":"Mar 24, 2023"},{"id":11013,"content":"好想和你一起工作的時候呀。","submitter":"Lorraine","date":"Mar 25, 2023"},{"id":11015,"content":"为什么一言不发就走了呢，为什么不对我再说几句话呢","submitter":"青","date":"Mar 26, 2023"},{"id":11016,"content":"致 Arts\n我知道告别的话不能提前说，所以你没有我也没有。\n我用很多种方法称呼过你，但是直到今天，我从不知道你有这样一个名字，既然决定写在这里，那我就也用你在这里的 ID 吧。\n惊闻噩耗的时候，我在坐公交车，思维空白，难以呼吸，半天理不出一点思绪。或许是巧合吧，在某个群里我看见了一张截图，读完后心里期盼着那不要是你，但是看见了你的公开信，又看见了那个熟悉的聊天头像，我没法再心存侥幸下去了。今天是 3.24，应该是你离开的第九天，我是一个迟钝不称职的朋友。我现在甚至在想，那个群是我新加的，每天消息有几千条我不常翻，偏偏我就看见了那条消息，是不是你都看不下去了，把这张图推到我眼前的呀。","submitter":"jy","date":"Mar 26, 2023"},{"id":11017,"content":"ARTS，算算我们认识八年了，但是现在我才发现，虽然你对我说了很多心里话，可是我对你的了解远不如我想的那么多。刚认识你的时候，你是别人家的小孩，聪明伶俐，沉默文静，那时候你很内向，甚至称得上高冷。后来我才知道，那是因为你的内心恐惧着外界那些恶意，那些残酷的人，你只是在竭尽所能地保护自己。很幸运，我应该被你算作是无害的人，以至于后来你深陷泥潭之中，斩断了和其他人的联系，只和我保持着信件一样的往来。说来奇怪，作为现实中认识的朋友，我们两个熟起来也是在网上，在我和你不在一起了之后，可能我也是一个善于在网上社交的人吧，我们会打字贴贴抱抱，我后来才知道你这么喜欢贴贴抱抱，忘记告诉你了，其实我也真的很喜欢抱抱。我们可以在一起抱一整天，肢体接触和吃甜食一样美好，多巴胺 upupup，可惜没机会了。亲爱的 Arts，那个时候我好像已经不知道该怎么关心你，不知道该怎么贴近你，无谓地和你分享着一些琐碎，或者试图激起你的兴趣，但你总是淡淡地开心，淡淡地难过，淡淡地想抱抱，很少和我主动说话。难道你也害怕打扰我吗？我应该早点意识到，作为一个害羞的人呢，你已经很主动了，你对我说过心里话，我该知道你的想法是怎样的，我该知道应当怎么给予你朋友的爱的，但是我错过了。可是即便是那个时候，我们还像线段的两端一直有着联系，现在你的那一端只剩虚无了。","submitter":"jy","date":"Mar 26, 2023"},{"id":11018,"content":"我想起来无聊的课间里，我们曾经一起下五子棋，有个朋友说，要谨慎和你玩这种智力游戏，原因是对方每下一步，你都会研究棋局研究很久，并在脑海中想到未来几步之内对方可能会在哪里落子，有了必胜的把握后你才会接着对局，不然就直接放弃了。事实证明，果然你每次都赢。原来那个时候你就展露出了你的远见和决心，谋定而后动。可能如今也是这样吧，你已经看破了太多事情，看见了你觉得痛苦的未来，所以你才决定离开这个伤心之地。人生如棋，你决定放弃这场棋局，是因为像你一样善良的人下不赢这样的现实。我知道你是聪明的，是非凡的，是冷酷洞察一切的，可你也是温暖的，脆弱的，需要细心呵护的。但是我不是一个强大的人，我知道你曾经绝望地对抗过夺走你生命的东西，但是我软弱了，我像蝼蚁一样旁观了你生命里的这场洪水，我做不了任何事情，我没能保护你。","submitter":"jy","date":"Mar 26, 2023"},{"id":11019,"content":"很早之前，我们聊过以后，那个时候你或许也在期盼着以后吧。你还说希望和我一起穿裙子出去玩，我和你说过我的恋爱。记得你说你曾问过，什么是爱？对方说，有一天你会懂的。你现在懂了吗宝，我现在懂了，在那之前，是我们对爱的定义太狭隘，你早就在用你的方式爱着所有人，所有值得你爱的人，但是你的宽容与热情生长在错误的土壤里，与这个世界背道而驰。\n其实我们还约定过不少事情呢，但是作为一个严谨的人，你早早就告诉我了，不要太迟，可能会来不及。这么看来是我失约，我失信于你，但是你那么善良，等等我就好了，你想做的事情我都很熟练，你教了我那么多次数学，为什么不能让我投桃报李一次呢。\n写到这里我也很好奇，你是怎么看待我的呢，在你离开之前这段时间，你常常失联，我远在重洋之外，我们的联系已经并不那么紧密，而今天我以你的朋友自居，打扰了很多人，大家不知道，我们已经太多年没见了，我对你的记忆也快模糊了，印象里你总是沉默，但是也常常微笑，你的见解总是很独到，你话很少但掷地有声。其实我一直对你是敬佩的，是仰视的，所以我们之间的距离一直有点远。亲爱的 Arts，早知如此我该学会对你厚脸皮一点，我知道你这个腼腆的小孩不擅长拒绝人，今天我想对你无赖一次，希望你还把我当做是你亲密的朋友，允许我之后去看看你，给你带几朵花去。\nArts，你选择离开的这个时节，普遍意义上被称作春天，家乡还很寒冷，可是我已经可以穿裙子了，同样一株花，我这里的已经调谢，恐怕在你那里还没有绽放。我想，你为什么选择春天呢？是希望变成春天里生机勃勃的万物，可爱的春草春雨春风吗？但是我又想，这个世界太污秽了，只会给一尘不染的你带来痛苦，所以我不期待再会，假如你讨厌这里，别再回来了。\n20230323 在学校","submitter":"jy","date":"Mar 26, 2023"},{"id":11020,"content":"......\n虽然没有和 Arts 太多交流过，但是还是感觉痛心。","submitter":"铃萤-RinLin","date":"Mar 26, 2023"},{"id":11026,"content":"很抱歉以这种方式认识你……晚安……在参宿四要幸福啊！","submitter":"CH₃COOC₂H₅","date":"Mar 31, 2023"},{"id":11044,"content":"曾有幽冥星火萤，贻晖馈暖庇生灵。\n凄凄蝼蚁居高厦，渺渺蜉蝣得广庭。\n制毕宏图少君看，哼成壮曲与谁听？\n珠妍已做东流水，遍润人间万古青。\n\n循着妳的足迹，前进！","submitter":"造林","date":"May 2, 2023"},{"id":11063,"content":"唯有再见方为人生","submitter":"Anonymous","date":"May 17, 2023"},{"id":11076,"content":"> 我们将带着你的理想活下去。晚安~！","submitter":"善解人意的末影猫/猫猫","date":"Jun 2, 2023"},{"id":11088,"content":"希望 Arts 那边是 Arts 希望的美好世界吧……\n晚安……","submitter":"Nickel_Angel","date":"Jun 4, 2023"},{"id":11101,"content":"Arts，姐姐在的，一直都在","submitter":"九十九麟","date":"Jun 21, 2023"},{"id":12046,"content":"Arts，一路走好啊","submitter":"抚子","date":"Aug 3, 2023"},{"id":12060,"content":"好后悔那时候没有改道去北京一趟","submitter":"silvicky","date":"Aug 15, 2023"},{"id":-3,"content":"给 arts，今天是 8 月 22 日，你已经离开了几个月。可我脑海里不时会回想我们最初也是最后的一面。\n那次见面距你离开只有几天。那时候我说心情不好需要在操场散步，几百人的群里只有三个人回复了我，你是其中之一。那时候你可爱的表情包格外吸引我，但我太害羞了，加了你又不好意思真的约你，直到第三天才鼓起勇气找你，你也没有拒绝我。那天的晚上对我来说格外难忘，那也是我在学校最后还清醒的记忆了。\n得知你的消息后，我非常崩溃……明明以为交到了一个很好的朋友……我太自闭了，大学没人和我聊天，即便聊了也觉得隔着很大一块屏幕，只有那次你和我的谈心是真的让我觉得这个世界上有我想在意的人、从而不那么孤独了。\n那天晚上，我们在食堂门口捡到了一朵非常美丽的粉丝小花。我把她送给你，是想引起你的好感。因为你很漂亮，也很善良，对于没有朋友的我来说，非常想把握这段新的友谊。\n然后你带我去了你的秘密基地。你说那里很清静，你会去那里自习。\n然后我们坐在靠窗的位置上，你和我聊了很多很多事。我不知道如何回复你，因为我很笨，你很聪明，我能说的你一定也听别人说过很多次了。\n之后，你把花花还给了我，你说：“我穿着粉色的衣服，所以已经有粉色了。这朵粉色的花应该送给没有粉色的你。”\n你真的很聪明，这句话很让我很感动。。我想我是说不出这种让人感动的话的。\n然后我们还去了一座小桥，上面有一只大肥白猫。你摸了摸它，还让我来摸。我怕猫抓我，不敢摸，还让你小心点儿。你摸了一手猫毛，给我看，我们都笑了。\n真是难忘的夜晚。你走后，我也去了好几次我们那天走过的路。路还在，可是没有你了。\n现在已经过去好几个月，我想起你还是很难过。现在我也毕业了，一事无成地当着家里蹲。\n你说想祝福善良的人。可我也太自私了，无法享用你的祝福。\n我那时候幻想和你一起吃蛋糕，你走后的几天就是我的生日。甚至你走那天，我还在问你问题。你说：“要不要和我多谈谈”。我那时候很想说，那我们再一起去校园散步吧。可我害怕被拒绝。没想到就是永别了。\n之后，我想，我也不配拥有什么朋友。因为我总是在意自己，我明明知道你也很孤独，却总在意自己的形象，不敢主动一点。有很多爱你的人，我本是微不足道的一份子，而且我们只认识了几天，也没有为你做什么事，在你走后，我却自私地自诩是你的朋友，还崩溃地找同学谈心，让他们也很担心我，给别人添了很多麻烦。\n直至今日我也很怀念你。\n你是我在学校最后得到的“光”。","submitter":"小町","date":"Aug 22, 2023"},{"id":15139,"content":"花与叶的守护者啊，\n我们尊敬您。","submitter":"克拉拉","date":"Jan 13, 2024"},{"id":16011,"content":"如同太阳一样璀璨恒常的你，本该远离尘土般琐碎的我们，然而你在痛苦之中依旧坚定不移，上下求索，散发着也渴求着温暖的人生，也点亮了我们，快一年了，我永远的朋友，在这里我可以说永远。","submitter":"xe","date":"Mar 8, 2024"},{"id":16021,"content":"一年了 R.I.P.","submitter":"ht丶","date":"Mar 13, 2024"},{"id":-4,"content":"Arts 你走了一年，你的头像边是 long time ago 并且我明白它即将和所有的照片一样褪色和消散，你的那张迟到的工牌静静躺在床头，有时候会对着永远不再有回响的输入框说说话，打完删掉打完又删掉。归根结底，自己所恐惧的不是死亡，自己的也好你们的也好，我想我真的害怕的东西还是别离吧，忏悔彼此在告别前说的话太少，拥抱得不够多，然后我们转过身去，继续做那些让我们后悔的事情，继续以最残忍破碎的样貌示于最想要去珍惜的人。每年的一天用来记住你其余用来遗忘你，这样的日子又能继续多久，我数着日子如同站在自己的墓穴里用一块块砖亲手封上通往这个世界的口，总有一天，总有一天苟且的遗忘被难以名状的死亡充满，三百六十五天里不再有得以喘息的缝隙，然后我们在黑暗中相顾无言，是吗，亲爱的砖。我明白你的死亡并不是凭空出现的，它的背后是你太多的不甘，而你这么做究竟能带来多少改变或许我们今生都无从知晓了。千叶走后的第三个七月末，我曾经很抱歉地对她说，你走了三年而这个世界似乎一点也没有变好，人们依旧在相互仇恨杀戮，那天我不敢告诉她，实际上世界变更糟了，我对它和对自己的失望都愈发强烈。对不起 Arts, 今天我所能告诉你的也不外乎同样的话，你走了一年，这个世界并没有变好，只是死水之下隐约涛动告诉我或许它并非毫无变化，我们这些剩下来的人除了押注这点渺茫希望外也别无选择。\n\n忘了最初和你说过什么，翻了翻是你对一份材料有疑虑，你问我气道造口上呼吸机的时候你能说话吗。太早了我记不得，早到一切疤痕变得像水面般平复，只能摸摸脖子上那个不知道还在不在的切口去翻 MSD. 后来你日复一日和我说你的发现你的猜想，说你核实过程中的疑惑说很多我不认识的人，黑白头像吐绿色泡泡，终于到最后你对所有人把所有想说的都一气说了。我有点不想告诉你的是你那么认真地点燃生命而撞向的底火连接着一枚哑弹，消失在了不知什么地方，又残忍又沉默，更严重的是我至今依然不知道这对你而言究竟有多重要。真的，根本没什么天平能坚固到把你们放在一头把一个你想要的洁白世界放在另一头而不垮塌，我难以想象其中任何一个的沉重。Arts, 知道你离开那天我并没有很难过，有时候会对人说起自己被死者陪伴的时间远甚活人，我最初的意思是先前混圈极少独处颇多，而直到很久以后才明白过来那是你们在我尚不知晓你们的存在而独自在夜路跌跌撞撞的日子里从未离开，是的，之前和之后。我只是没想到你会去那边继续陪伴自己，这说法很自私吧，我不知道，long time ago, long, long time ago, 以一场涉及工作的攀谈开始，以一句「姐姐也是疼了不肯说」结束。现在我站在「也」的另一侧盯着你宛如镜中彼岸的像发呆，我已经把自己修好了，如同以往的千万次，Arts, 我知道那时你做了类似的尝试却没有成功，可我还是想跑着跳着去告诉你我把她修好了，那个曾经和你聊工作的阴郁孩子，__I can fix her, I can fix her__, 多虚伪，一句话有三个谎言然后照样骗不回来你们中任何一只（笑），两个 __她__ 两个 __fix__ 正好涂两个微笑的假面，然后我们都不必再为这个世界令人失望的那一面所灼伤了，尽管呢，它不久又会残损会千疮百孔。我不害怕像西西弗那样，看着那些用泪水和拥抱所修补的东西会碎而又补补而又碎，我只是来不及涂完其中的任何一个，我只是希望你也有再次破碎的不幸和再次选择死亡的幸运，可是好遗憾你两者都没有，我从认识你之前独自面对巨石，到认识你时独自面对巨石，再到你走后独自面对巨石。走得好匆忙，好多或许你并不愿带着的东西都被你带走了，不曾有机会亲吻的梦和你想要的那个世界，你带走了好多，你落下了全部。从千叶到静枼然后是你，每一次每一次你们离开的时候，我都清晰地感到自己的某一部分正在死去，随你们一起，盯着自己溃烂消失的部分想着，要是从一开始就没有相遇没有彼此认识该多好。好傻，我明明像想要逃离疼痛那般想要拥抱它，鲜嫩的苍老的爬满蚤子的你们消逝的生命。认识你很幸运，傻孩子，我不疼呀，你可要做一个好梦。","submitter":"眠洲","date":"Mar 22, 2024"},{"id":17082,"content":"看望你，晚安。泪水又止不住的涌出了","submitter":"刺风","date":"Mar 31, 2024"},{"id":17138,"content":"善良的灵魂，愿地平线的阳光伴你同行，与你心中的温情一道，点明这个世界。","submitter":"忆涵","date":"Apr 27, 2024"},{"id":17186,"content":"今日了解到你的故事，甚为感动。事已至此，愿你一路走好。\n","submitter":"Anonymous","date":"May 23, 2024"},{"id":17188,"content":"仅仅是了解了 Arts 的故事的一角，泪水就已经在外溢了......R.I.P","submitter":"Anonymous","date":"May 28, 2024"},{"id":18111,"content":"事情已经过去一年多了，还记得去年 Suraimu 重生后我们一起参加东京骄傲游行，活动后去原宿逛街时她在某个小店里刻印了一枚写着 arts 的吊牌，当时只知道是一位来自清华的已故的姐妹。直到近些天才得知她的真实身份，我们曾经在同一个高中的同一个班级做过一年同学，只记得她是一个瘦瘦小小、不苟言谈、成绩好到让我艳羡不已的人。可这么久了，我竟然始终没有将这两个人对到一起，实在感到抱歉，没想到我竟然以这样的方式与她重新相识。我也是一位已经 RLE 许久的跨性别女性，只是远远不如她优秀，更没有足够的能力为社群做出那么多贡献…写到这儿时我的脸颊已经被泪水浸湿了，那个曾经相识过但已默不作声地去往天国的姐妹，祝你安好","submitter":"花路","date":"Aug 16, 2024"},{"id":18167,"content":"令人尊敬的勇气，令人痛心的结局——一路走好，晚安。\n我不知道您所做的是否值得——但世界会因此明亮的。","submitter":"匿名路人","date":"Sep 24, 2024"},{"id":18302,"content":"晚安❤️","submitter":"飔","date":"Nov 13, 2024"},{"id":18351,"content":"无言\n我甚至还没能真正的认识你\n有一日，我们会再见吗？\n我想试试，从自己的视角而非他人的视角来认识姐姐","submitter":"Anonymous","date":"Nov 15, 2024"},{"id":20002,"content":"愿 Arts 早安 午安 晚安","submitter":"Anonymous","date":"Nov 18, 2024"},{"id":21163,"content":"Arts 你好。我们第一次见面大概是 13 年或者 14 年。我们租住在了中山公园附近的同一幢居民楼里。我甚至从没有和你打过照面，我只是记得上学时，你走在我前面，背着书包的安静，瘦小的背影。\n后来我们在同一年考进了同一所大学。我们大概同时参加过校友宴会，虽然彼此仍然没有任何交流。我对你的印象依然停留在中学，安静，沉默，聪颖，寡言。\n直到得知你离开这个世界的消息。震惊，悲痛，难以诉说。我甚至一直不敢相信那是你，直到一年多以后，我一点点在网络上找寻关于你的信息，最后找到这里。\nArts 姐姐，祝愿你在另一个世界里健康，幸福，按照自己理想的方式生活。我会永远记得你的善良和理想，好好活着，直到自己也去往另一个世界。","submitter":"fj","date":"Jan 10, 2025"},{"id":21218,"content":"祝你幸福","submitter":"zhaore","date":"Feb 5, 2025"}]}