"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({blockquote:\"blockquote\",p:\"p\",h2:\"h2\",em:\"em\",a:\"a\",strong:\"strong\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"I will transform myself into gentle breeze and rain, then surround you all along.\"'),\"\\n\",Vue.h(_components.p,null,\"By Yumao\"),\"\\n\",Vue.h(_components.p,null,'\"It feels like that you are hiding in crystal alone, all I can see is your shattered figure. \"'),\"\\n\",Vue.h(_components.p,null,\"By Neko\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Yumao (Zhangqianye) is a trans girl, who is gentle, smart, strong and lovely.\"),\"\\n\",Vue.h(_components.p,null,\"Her introduction of herself in her profile:\\nPerhaps Yumao doesn't like taking part in group activities.\\nI love white and red, as well as that kind of rainbow in Glitch.\\nI have a sweet tooth; I will feel happy for a long time after holding a packet of white rabbit creamy candies in my hands.\\nI love cats, and adopted a cat called Ayaka.\"),\"\\n\",Vue.h(_components.p,null,\"She was an admiral of \",Vue.h(_components.em,null,\"Kancolle\"),\", and her first figurine was Destroyer Akizuki in \",Vue.h(_components.em,null,\"kancolle\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"She enjoyed passing time in serenity and ease.\\nFor example, she'd put on headphones and drink hot coffee in a caf\\xe9, then watch out the window and observe people come and go.\\nThat made her relaxed.\\nShe had some unusual thoughts sometimes.\\nShe made wishes to meteors occasionally.\\nShe said: \\\"It's not because I believe it. It's just that it don't cost money. And there's no evidence showing it doesn't work.\\\"\"),\"\\n\",Vue.h(_components.p,null,\"According to Neko, Yumao loved spicy hot pot, and always enjoyed it with rice.\"),\"\\n\",Vue.h(_components.p,null,\"Yumao liked to watch stars while waiting to fall asleep at night.\\nAfter she returned to China, due to bad weather and little spare time, she couldn't watch stars as often as she did.\\nSo \",Vue.h(_components.a,{href:\"https://web.archive.org/web/20210517104313/https://oao.moe/archives/834/\"},\"she made a special trip to Dishui Lake and watched stars\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"She saved many thoughts in her \",Vue.h(_components.a,{href:\"https://web.archive.org/web/20210420170241/https://oao.moe/archives/\"},\"blog\"),\", and these blog posts spanned many subjects: computer science, military and politics.\\nShe was also interested in literature, and she wrote lots of beautiful proses and poems.\\nOf course, she also recorded daily life in her blog, and we can still see her story, her experience, and her train of thoughts even now.\"),\"\\n\",Vue.h(_components.h2,null,\"Experience\"),\"\\n\",Vue.h(_components.p,null,\"Yumao once studied abroad in the US, then she went back to Shanghai to continue her study in university.\"),\"\\n\",Vue.h(_components.p,null,\"In 2017, she encountered Neko on Twitter (Now X), and she felt that Neko was a strong person.\\nAfter that, they became close partners.\"),\"\\n\",Vue.h(_components.p,null,\"In that period, there was not so much censorship about transgender topics in Zhihu.\\nSo Yumao always @ Neko in relevant topics, then showed their affection in public.\"),\"\\n\",Vue.h(_components.p,null,\"During that time, Yumao got many supports mentally. She described the care from Neko like this:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"Even those things were dark and painful, which had been hidden, you still observed and felt them. Maybe you understood more than myself. How wonderful... You also found my scattered identity, then lifted me out of abyss. That was the first time I was touched by others.\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,'However, they were separated forcibly in March 2018.\\nNeko was brought back to Yunnan by her family, and was sent to correctional school (a \"school\" which uses punishments on students to force them to conform).\\nThen, it was reported that Neko had died by suicide.\\nYumao was extremely saddened after hearing the news.\\nShe continuously sent messages about missing Neko in their Telegram channel.\\nShe quoted ',Vue.h(_components.em,null,\"Cassiopeia(カシオペヤ)\"),\", which was a song they used to listen together, to express her grief.\"),\"\\n\",Vue.h(_components.p,null,\"Although she also found that the circumstances of the suicide of Neko was complicated and confusing according to some sources,\\nthere was no more news about Neko indeed.\\nShe really hoped Neko was still alive:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"For you I always stay alive... For without you I get lost in life. Wish you are still alive... \"'),\"\\n\",Vue.h(_components.p,null,'(Another version in Zhihu: \"Only for you I stay alive... But you are not by my side. Isn\\'t it? Wish you are still alive...\")'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Yumao always missed Neko, and recalled the days with her.\\nShe often wrote down some caring words in her blog, such as prompting Neko to manage her hair or switching up her clothes.\"),\"\\n\",Vue.h(_components.p,null,\"In this period, Yumao tried to remember the previous times, those moving, happy or blissful events.\\nBut her heart was overtaken by sadness, and her memory gradually worsened.\\nShe said that she forgot many things.\"),\"\\n\",Vue.h(_components.p,null,\"She formerly planned to complete SRS within the year, but had to push it back because of her bad mental health and other reasons.\"),\"\\n\",Vue.h(_components.p,null,\"On 30th June 2018, she lost all hope and tried to take her own life.\\nThe next day, she left this world with regrets at her age of 17.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Wish that I could become a pretty girl who is kind-hearted, and become the sister of Ayaka and Ruri.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In her blog post \",Vue.h(_components.em,null,Vue.h(_components.a,{href:\"https://web.archive.org/web/20210517104118/https://oao.moe/archives/948/\"},\"Separation and Reunion\")),\" published in March, she left many words to her friends, and thanked their company all along.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\"]}),\"\\n\",\"\\n\",Vue.h(_components.h2,null,\"After Her Leaving\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"In Zhihu question \",Vue.h(_components.a,{href:\"https://www.zhihu.com/question/284818437\"},\"What are your thoughts about ZhiHu user @yu-zhang-31-35 ?\"),\", many friends wrote their memories of yumao, and expressed their sadness and regret of the death of her.\\nThey also felt regrettable for Neko's death due to close relationship between Neko and Yumao.\"),\"\\n\",Vue.h(_components.p,null,'In fact, Neko didn\\'t pass away. Before her \"death\", in her email in 19th March, they still encouraged each other with the words \"Must stay alive\".'),\"\\n\",Vue.h(_components.p,null,\"The transgender community investigated this, and found Neko was pronounced dead by her family.\"),\"\\n\",Vue.h(\"details\",null,Vue.h(\"summary\",null,Vue.h(_components.strong,null,\"Fact\")),Vue.h(_components.p,null,\"Neko and Yumao were forced to separate in Shanghai. After that, Neko was brought to Kunming, Yunnan, and then hospitalized at a mental health centre for treatment.\"),Vue.h(_components.p,null,'During the time, Neko always hoped to meet with Yumao. She had dinner with her parents and got an interim leave from the hospital, then she tried to contact Yumao in this time gap. After their contact, she persuaded the doctor on duty to issue discharge certificate for her.\\nThis action irritated her family. Shortly afterward, her family drove her to Kunming Anning Haohaizi School (hereinafter referred to as \"Haohaizi\", a school that punishes students to force them conform) by lying to her that they were taking her to Changshui Airport.\\nAfter that, Neko was locked in the Room 308, which can be seen as a black room.'),Vue.h(_components.p,null,\"Days after she came out of the Room 308, owing to her excellent command of computer and their trust in her, the propaganda department of Haohaizi found her and asked her to fix network system. Neko accepted and fixed the system quickly, then sent a help email to Yumao at once.\"),Vue.h(_components.p,null,\"After that, the outside world started to lash out her parents.\\nThe investigative journalist of \",Vue.h(_components.em,null,\"Beijing News\"),\" also interviewed the staff of Haohaizi to ask the whereabouts of Neko.\"),Vue.h(_components.p,null,\"However, her parents made a shocking decision.\\nThey said that they had already brought her out of the school, then cancelled the census register of Neko.\\nIn the interview of \",Vue.h(_components.em,null,\"Beijing News\"),\", they spoke in a tearful voice and claimed that Neko had taken her own life in the early hours of 24th March.\"),Vue.h(_components.p,null,\"Neko was continued to be in Haohaizi since then. She was informed of Yumao's death in October. This news almost devastated her.\"),Vue.h(_components.p,null,'But nevertheless, Neko still implemented the words \"Must stay alive\".\\nShe never gave up and tried to calm herself. She kept a diary and developed her hobbies and interests at that time.\\nShe also found some ways which could resolve her difficulties to take her mind off.'),Vue.h(_components.p,null,\"During the latter time in Haohaizi, those around her helped her a lot, her friends accompanied her, and some people delivered things from the outside.\\nSome friendly drillmasters would take her out to play, or bought things to her. This might have made her happier.\"),Vue.h(_components.p,null,\"On 1st September 2019, Neko left Haohaizi, and started her new life after a period of time.\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"To commemorate all the difficulties I suffered in the past two years\"),\"\\n\",Vue.h(_components.p,null,\"From 2018-03-16 22:31\"),\"\\n\",Vue.h(_components.p,null,\"To 2020-03-16 22:31\"),\"\\n\",Vue.h(_components.p,null,\"Thanks to all your efforts in that period\"),\"\\n\",Vue.h(_components.p,null,\"This is also, to remember all the things you experienced after we separated\"),\"\\n\",Vue.h(_components.p,null,\"Also, for you in 2018-07-31\"),\"\\n\",Vue.h(_components.p,null,\"Thank you everyone.\"),\"\\n\",Vue.h(_components.p,null,\"Neko, on Telegram\"),\"\\n\")),\"\\n\",Vue.h(_components.p,null,\"After survived the ordeal, Neko tried to get out of the shadow, and she gradually moved toward to the right road of life.\"),\"\\n\",Vue.h(_components.p,null,'\"Neko will stay alive, to remember that girl I used to loved.\" This is what Neko always uses to encourage herself.'),\"\\n\",Vue.h(_components.p,null,\"Good night, yumao, wish you can be a girl and live happily.\"),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: One-Among-Us, \",Vue.h(_components.a,{href:\"https://twitter.com/ayakaneko\"},\"Ayaka Neko\")),\"\\n\")}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"