"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",br:\"br\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Story\"),\"\\n\",Vue.h(_components.p,null,\"When Shuiyue stepped into the vast realms of the internet under her present name, she was met with suspicion.\\nShe was transparent about her missteps when she was a child; she participated in \",Vue.h(_components.em,null,\"Esu\"),\" culture (an online movement that seeks to bully everyone with supposedly deviant behaviours).\\nAfter she realized the dangers of \",Vue.h(_components.em,null,\"Esu\"),\" culture, she hoped to use her experience to help friends protect their personal information and reduce the cruelty online for trans people.\"),\"\\n\",Vue.h(_components.p,null,\"She didn’t have many friends.\\nThe shadows of her history cast its long, uneasy doubts, keeping many at bay.\\nHer struggles with bipolar disorder manifested as impulsive spending—an army of AirPods neatly aligned in a row.\\nAs she swore, “They’re all fake.”\",Vue.h(_components.br),\"\\n\",\"And when regret crept in, she’d lament,\\n“If only I hadn’t squandered so much…I would have saved up enough money for the surgery.”\"),\"\\n\",Vue.h(_components.p,null,\"Seeking solace and counsel, she posed a question to her confidantes:\",Vue.h(_components.br),\"\\n\",\"“What advice do you all have for me?”\\nAnd the candid replies poured in:\",Vue.h(_components.br),\"\\n\",\"“Don’t flaunt wealth, don’t go mad, don’t keep in contact with people involved in \",Vue.h(_components.em,null,\"Esu\"),\".”\"),\"\\n\",Vue.h(_components.p,null,\"“All right. Got it. I’ll start immediately.”\\nBut who knows if she kept her promises?\"),\"\\n\",Vue.h(_components.p,null,\"“Don’t go mad—that’s the hardest part,”\\nshe’d confessed with a wicked grin.\\n“I’ve got this itch to stir chaos now and then.”\",Vue.h(_components.br),\"\\n\",\"“Oh, you troublesome, endearing soul,” we’d sigh.\"),\"\\n\",Vue.h(_components.p,null,\"“The madness, it seems, is in my marrow now—beyond reach, incurable.”\"),\"\\n\",Vue.h(_components.p,null,\"But beneath the whimsical storms, she was still the girl in the sailor-style uniform,\",Vue.h(_components.br),\"\\n\",\"adorned with a blue ribbon, peddling absurd humour with a pure, radiant laugh.\\nHer joys lingered in the glow of digital gadgets and their intricate riddles.\\nIn her modest and cluttered abode, treasures lay scattered—cassette tapes, phones, hard drives, stickers—\",Vue.h(_components.br),\"\\n\",\"each sorted with loving precision.\",Vue.h(_components.br),\"\\n\",\"Some were sealed neatly in boxes, labelled in her tidy handwriting.\\nI’ve secretly wondered if she held a penchant for collecting duplicates—artifacts in mirroring rows.\",Vue.h(_components.br),\"\\n\",\"To her, data security was like a religion. Backups, an unspoken vow.\"),\"\\n\",Vue.h(_components.p,null,\"She had a collection of glasses fitted identically to her prescription,\",Vue.h(_components.br),\"\\n\",\"as if each lens held its intimate history and was etched into her memory.\"),\"\\n\",Vue.h(_components.p,null,\"Yet she wasn’t confined to her small, crowded sanctuary. No, not Shuiyue.\",Vue.h(_components.br),\"\\n\",\"Whenever Shuiyue wasn’t depressed, she travelled from place to place, sometimes visiting friends in distant Changchun.\\nOften, she’d parade photos of her cat with unmasked pride—though her family loathed the feline spirit.\",Vue.h(_components.br),\"\\n\",\"As for her unpopularity with certain souls, she met it not with ire but disheartened sighs.\"),\"\\n\",Vue.h(_components.p,null,\"Love had knocked at her door time and time again,\",Vue.h(_components.br),\"\\n\",\"but it was a pattern cruelly familiar—a yearning for love, a longing to be loved.\",Vue.h(_components.br),\"\\n\",\"She eventually walked a path of playful rivalry and friendship with someone she cherished: Youhun.\",Vue.h(_components.br),\"\\n\",\"Their bond deepened during a brief cohabitation in Dongguan.\",Vue.h(_components.br),\"\\n\",\"Yet, shadows loomed—gender dysphoria, body image battles,\",Vue.h(_components.br),\"\\n\",\"and the persistent echo of mental unrest haunted her.\",Vue.h(_components.br),\"\\n\",\"The thought of leaving this world lingered in her mind.\"),\"\\n\",Vue.h(_components.p,null,\"When news of Youhun’s death reached Shuiyue, it struck her like a thunderclap.\",Vue.h(_components.br),\"\\n\",\"“How could she go before me? I’m still here,” she whispered, shaken.\",Vue.h(_components.br),\"\\n\",\"And then came sorrow’s flood: “But as soon as she left, my balance wavered.\",Vue.h(_components.br),\"\\n\",\"Me—soft-hearted, crumbling at anyone’s passing as though my soul, too, would shatter.”\",Vue.h(_components.br),\"\\n\",\"Her voice trembled with a selfless plea:\",Vue.h(_components.br),\"\\n\",\"“Could I trade my life for hers? Bring her existence back and restore her sanity bar to the max?”\"),\"\\n\",Vue.h(_components.p,null,\"Three days after Youhun’s departure, an acquaintance reached out to Shuiyue.\",Vue.h(_components.br),\"\\n\",\"Sensing her fragility, they sought to comfort her, to find someone who might stand vigil through her long and dark hours.\",Vue.h(_components.br),\"\\n\",\"But alas, no one arrived.\"),\"\\n\",Vue.h(_components.p,null,\"“Darling, please don’t follow her. If you show up chasing her into the afterlife, she’ll be \",Vue.h(_components.em,null,\"so\"),\" annoyed with you.”\"),\"\\n\",Vue.h(_components.p,null,\"“I’m joking!” Shuiyue laughed, her bravado laced with defiant fragility.\",Vue.h(_components.br),\"\\n\",\"“I’m terrified of death—I’d never actually go through with it.\",Vue.h(_components.br),\"\\n\",\"You think I’d die for her? Please, I haven’t even lived enough yet.\",Vue.h(_components.br),\"\\n\",\"What nonsense is there to fear?”\"),\"\\n\",Vue.h(_components.p,null,\"In this final exchange with her friend Shu, her words danced with denial and trembling strength.\",Vue.h(_components.br),\"\\n\",\"Less than a week later, her passing was confirmed by Aypasha, a dear friend from her brightest days.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"