"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",blockquote:\"blockquote\",ol:\"ol\",li:\"li\",em:\"em\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Zha Ke (Lilith) was a transgender man. We have little information of him, only a letter he left to the world.\"),\"\\n\",Vue.h(_components.p,null,\"(Warning: Please be informed that the letter by Zha Ke is potentially triggering, includes depiction of suicidal thoughts and mental health issues. The letter is in simplified Chinese and translated to English.)\"),\"\\n\",Vue.h(\"details\",null,Vue.h(\"summary\",null,\"My Will\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I have been continuously harrassed by people online for two years because my inability to adapt to society and stupidity.\\nI had been doxxed by both people online and in the real world; the police wasn't able to do much.\\nI have mental health issues like borderline personality disorder, bipolar disorder type 2, severe anxiety, PTSD.\\nMaybe it's because of my own personality problems, which might stemmed from my mental health issues.\\nI cannot take care of myself nor do I have enough money.\\nFor a long time, I've been tortured by suicial thoughts.\\nTherefore, here is my will:\"),\"\\n\",Vue.h(_components.ol,null,\"\\n\",Vue.h(_components.li,null,\"I wish my parents won't damage my stuff.\"),\"\\n\",Vue.h(_components.li,null,\"I wish my remains would be sent into the sea.\"),\"\\n\",Vue.h(_components.li,null,\"I wish all my online presence be erased.\"),\"\\n\",Vue.h(_components.li,null,\"I wish there's no funeral.\"),\"\\n\",Vue.h(_components.li,null,\"My suicide isn't because of other people.\"),\"\\n\",Vue.h(_components.li,null,\"I wish my haters refrain from hating me after my death.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Works like \",Vue.h(_components.em,null,\"Suicide Room\"),\" and \",Vue.h(_components.em,null,\"No Longer Human\"),\" expresses the sentiment of the pain of living.\\nI don't wish to become a secular person like Lucien in \",Vue.h(_components.em,null,\"Kill Your Darlings\"),\".\\nI wished to live freely like Sid Vicious from the band \",Vue.h(_components.em,null,\"Sex Pistols\"),\", but I know the pain he holds deep inside and the sufferings he had experienced.\\nI know I cannot become someone like him.\\nAlthough these may sound a little chunibyo, I'm not going to keep those thoughts all to myself anymore.\"),\"\\n\",Vue.h(_components.p,null,\"People come and go and few ended up friends with me.\\nThinking of all those who had left, how many of them were actually nice to me?\\nYet I kept thinking about their wellbeing, even me myself is starting to think there's something wrong with me.\\nEven if I die and see them in the afterlife, they might not be nice to me.\\nYet I keep thinking about them.\"),\"\\n\",Vue.h(_components.p,null,\"I feel extreme pain just from living.\\nI know I'm turning numb, but sometimes my heart beats faster anyway, reminding me I'm easily agitated.\\nMaybe I have already lost the ability to love. I might never love anyone ever again.\\nThis is my own fault and my own problem.\\nI know people love me and care about me but I can't feel it.\"),\"\\n\",Vue.h(_components.p,null,\"What I can't gain is what I can't gain no matter how much I work for it.\\nMaybe I'm actually flawed as a human.\\nWhy do I keep loving people I shouldn't?\\nWhy can't I keep it to myself?\"),\"\\n\",Vue.h(_components.p,null,\"Maybe I won't gain true love. Maybe I won't even be able to maintain any long-term relationships.\\nI will spend my days in emptiness without feeling the vibrance of life.\\nI will suffer in the eternity of being burdened by my sins.\"),\"\\n\",Vue.h(_components.p,null,\"Before, when people told me nicely the importance of studying, I thought they were trying to tell me to off myself asap.\\nI know they're trying to tell me to accept reality, but I couldn't accept it until now.\\nI should set aside my ambitions and accept the crumbling reality.\"),\"\\n\",Vue.h(_components.p,null,\"I'm a piece of trash and everytime I listen to sad songs I feel a bit moved.\\nYet I don't even have the ability to continuously feel sad anymore.\\nI cannot do anything well.\\nI even lost the right to be sad.\"),\"\\n\",Vue.h(_components.p,null,\"To think a person would feel extreme loneliness in a crowd of billions.\\nTo think a person would be overcome by suicial thoughts yet no one saw a sign.\\nWhat kind of society is this?\\nThat's not a society; it's a lair of beasts.\"),\"\\n\",Vue.h(_components.p,null,\"— \",Vue.h(_components.em,null,\"On Suicide\"),\" Bocher\"),\"\\n\",Vue.h(_components.p,null,\"My future plans are nothing but suicide.\\nSuicide has always been the least difficult option.\\nOnly suicide can release me from my suffering.\\nRemember we lived under one sky.\\nRemember you are not alone when we separate.\"),\"\\n\",Vue.h(_components.p,null,\"December 13th, 2021 to April 6th 2023\\n— Zha Ke\"),\"\\n\",Vue.h(_components.p,null,\"The world abandoned me long ago.\\nI'll be forgotten by everyone eventually.\"),\"\\n\")),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/letter.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"He wrote, “The world abandoned me long ago. I will also eventually be forgotten by everyone.” However, we will remember him forever. We are grateful that the owner of \",Vue.h(_components.a,{href:\"https://startransforeve.com/\"},\"StarTransForEve\"),\" provided his information for our remembrance.\\nRest in peace, Zha Ke\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"