"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",blockquote:\"blockquote\",br:\"br\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"The departure of YuDong shocked many of her friends. Many people said it was hard to believe. Perhaps only a few close friends understood her true feelings.\"),\"\\n\",Vue.h(_components.p,null,\"YuDong is a transgender person from Liupanshui, Guizhou. She experienced gender dysphoria and transitioned over six or seven years, switching between MtF and MtX identities. In early December 2023, she underwent gender reassignment surgery, but the results did not meet her expectations.\"),\"\\n\",Vue.h(_components.p,null,'The author of this page and YuDong had their surgeries at the same hospital around the same time. After regaining the ability to walk, I frequently visited her in the ward, witnessing each other\\'s recovery. I never imagined that the \"goodbye\" when I was discharged would be our final farewell.'),\"\\n\",Vue.h(_components.p,null,\"She enjoyed photography and had arranged to meet a fellow trans woman who was a cosplayer for a photo session. However, before they could meet, the tragic news of YuDong's passing reached her.\"),\"\\n\",Vue.h(_components.p,null,\"Her mental state had been poor before, and the post-surgery emptiness exacerbated her issues. The regrets and detransition of fellow patients further undermined her resolve. In this state, she turned to hallucinations to fill the void.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"By the way, are there any effective hallucinogenic drugs?\",Vue.h(_components.br),\"\\n\",\"——Apr.12, 2024\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In the early morning of June 30, 2024, after another overdose, she said her last words to her friends and then chose to end her life. The friend who received the news tried to intervene and then called the police, but it was too late.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"in mind\\nLots of information\\nAll my memories\\nBecome a dream\\n——Jun.30, 2024\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"She asked this friend to inform her contacts of her passing, but due to the two-step verification on her QQ account, the friend could not fulfill her last wish.\"),\"\\n\",Vue.h(_components.p,null,\"On QZone, YuDong's last post seemed normal, except for a series of \\\"good night\\\" messages below, silently expressing her friends' grief and reflecting her warmth and care for others during her life.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"