"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"Her name, Jin Yu, sounds unusual to many Chinese ears at first.\\nActually, most people know her better as Dong Jin.\"),\"\\n\",Vue.h(_components.p,null,\"Dong Jin was a special trans girl.\\nWe remembered her as kind, with a lovely voice and sharp gaming skills,\\nyet there was always something about her that made others feel tender towards her,\\neven a bit heart‑sore.\\nIn many things she showed her own unique way of seeing the world,\\nand she was truly loved by her online community.\\nThough she carried many burdens in life, she held on to her dreams—as she once wrote, “It’s a long story…”\"),\"\\n\",Vue.h(_components.h2,null,\"Art\"),\"\\n\",Vue.h(_components.p,null,\"If we turn back time to Dong Jin’s childhood,\\nwe can already see a girl a little different from the rest.\\nWhile other kids were watching cartoons,\\nshe was fascinated by documentaries;\\nwhile others were drawing children’s pictures,\\nshe was carefully sketching buildings and cars from around the world;\\nWhen others were playing puzzles,\\nshe was pestering her family to help her build electronic kits.\"),\"\\n\",Vue.h(_components.p,null,\"She had wide interests.\\nIn piano lessons she discovered her musical talent:\\nonce she heard a tune, she could play it by ear.\\nLater, she learned to reproduce music from other works using software and even created a version of \",Vue.h(_components.em,null,\"Welcome to New York\"),\".\\nEven her mother couldn’t tell which version was hers.\\nBut Dong Jin, ever precise, pointed out with a little grin:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“There’s a quarter‑beat missing—why didn’t you tell me?”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In her hands, music was more than an instrument.\\nEven a string, a comb, even her teeth could “play” a sound.\\nThat must have been the rhythm of her own world.\"),\"\\n\",Vue.h(_components.p,null,\"Her devotion to art bordered on obsession.\\nOne of her dreams was to become a well‑known music producer.\\nShe also hoped that one day her home would include a well‑built home theatre.\\nShe dreamed of seeing the world — the calm of nature and the pulse of cities, the many faces of life itself.\"),\"\\n\",Vue.h(_components.h2,null,\"Society\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“I don’t want to live just for the sake of living.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Beyond art, Dong Jin cared deeply about social issues.\\nShe hoped schools would truly care about students’ well‑being, not only their grades.\\nAs a trans girl, she yearned for society to show respect and inclusion for all gender identities,\\nand for understanding to replace discrimination one day.\"),\"\\n\",Vue.h(_components.p,null,\"She often spoke openly about unfairness.\\n\",Vue.h(_components.a,{href:\"https://twitter.com/MTF_0615/status/1817450501941735438?s=19\"},\"Once\"),\",\\nafter hearing of an old man who broke a shared staircase and charged his neighbours a fortune to use it,\\nshe grew angry about the whole “publicly shared spaces” system that allowed such things to happen.\\nShe even thought of handing out leaflets, saying, “Chinese people have grown numb.”\"),\"\\n\",Vue.h(_components.h2,null,\"Caring\"),\"\\n\",Vue.h(_components.p,null,\"She was not only bright but also kind‑hearted.\\nShe made many friends online and always thought of them with warmth and patience.\\nEven when struggling with depression herself,\\nshe gave everything she could to help others—small things that brought comfort to lonely souls.\\nIn her final days, she even said to her mother:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“Let’s go visit that friend on the internet. At least we might bring them a bit of warmth.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Yet beneath her kindness lay fragility.\\nShe had deep insecurities that sometimes caused her to hurt those closest to her.\"),\"\\n\",Vue.h(_components.p,null,\"Still, the small details she left behind gently tell us—she was never a bad person.\"),\"\\n\",Vue.h(_components.p,null,\"Reading her words now, one can’t help but ache for her.\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.p,null,\"According to her friend Ycl,\\nat the beginning of 2024 she had only one close friend.\\nThe two used to play game \",Vue.h(_components.em,null,\"Tom and Jerry\"),\" together.\\nBy September,\\nshe had met someone she loved,\\nbut when her partner suddenly passed away,\\nshe fell into despair and confusion.\\nBy then, Ycl and she were rarely in touch,\\nand Dong Jin felt abandoned by the world.\\nShe sank into a darkness deeper than ever before.\"),\"\\n\",Vue.h(_components.p,null,\"If you have ever read her posts,\\nyou would know how heavy her heart was.\\nShe grew up in a single‑parent family and had never known full love.\\nPerhaps because of that,\\nher greatest wish was simply to find a true friend.\"),\"\\n\",Vue.h(_components.p,null,\"She was never content with the way of the world;\\nlife often tormented her.\\nIn those last months,\\nshe was far too hard on herself—hurting herself more than once, even attempting suicide.\\nLater, the drug she once used to kill her self was thrown away.\"),\"\\n\",Vue.h(_components.p,null,\"But her will to go was already set.\\nFriends’ kindness could not hold her back.\\nAt some quiet, unknown hour, she left once again—only this time, everyone knew she would not return.\"),\"\\n\",Vue.h(_components.h2,null,\"Afterword\"),\"\\n\",Vue.h(_components.p,null,\"After Dong Jin's departure,\\nher grandmother once had a dream:\\nshe saw Dong Jin crouched by a candle, lost in thought.\\nThe old woman didn’t quite understand,\\nnot realising that Dong Jin had always been a child who loved the gentle glow of candles.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"It suddenly came to mind that she liked cooking for herself.\\nOnce she made a dish of her own invention, “Fried Pineapple with Cheese”.\\nIt was sprinkled with a few crushed nuts.\\nThe cheese was cooked a bit too long, turning dry, and the dish didn’t look great.\"),\"\\n\",Vue.h(_components.p,null,\"She had poured herself into it,\\nworked a bit too hard,\\nand in the long heat,\\nwhat should have been smooth became less sweet.\\nYet that time she still tasted it carefully,\\nsaying it was rather nice after all,\\nand that it smelled good.\\nLife is often like that—sweet and bitter intertwined, never quite apart.\"),\"\\n\",Vue.h(_components.p,null,\"She once said that if she could go to Venice one day,\\nshe’d love to try a truly authentic pizza.\\nPerhaps that was the flavour she had always been longing for.\"),\"\\n\",Vue.h(_components.p,null,\"Dong Jin once hoped to have a home of her own and to travel around the world.\\nTo behold the mountains,\\nto walk through distant cities,\\nto meet the souls along the way.\"),\"\\n\",Vue.h(_components.p,null,\"May she find peace beyond the sky.\"),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: Lin, Xiaolingdang, summersay, Ycl, One Among Us\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"