"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({blockquote:\"blockquote\",p:\"p\",em:\"em\",ul:\"ul\",li:\"li\",h2:\"h2\",a:\"a\",hr:\"hr\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“Does my name mean 澪，you ask? Not really. Actually, ‘Mio’is also something I came up with on a whim. I'm not good at Japanese, sorry.”\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Mio is from Guangdong, Foshan.\\nHer father is a high school teacher; her mother handles everything at home.\\nShe has an older sister who is also trans.\\nShe was accepted to one of the top universities in China because of her brilliance and dexterousness.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"My IQ is 130, my IQ is 130!\\n——Mio when she was small (in primary school)\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In life, she liked to play \",Vue.h(_components.em,null,\"Minecraft\"),\" and \",Vue.h(_components.em,null,\"Kerbal Space Program\"),\".\\nAfter all these years, she became a gentle big sister to many people.\"),\"\\n\",Vue.h(_components.p,null,\"She suffered from major depression throughout the last year of her life.\\nAlthough she was pushed to suicide several times, she still tried to live as happily as she could.\\nShe made many friends and built up many relationships in that year alone:\"),\"\\n\",Vue.h(_components.ul,null,\"\\n\",Vue.h(_components.li,null,\"She came out to her best friend in primary school.\"),\"\\n\",Vue.h(_components.li,null,\"She became close friends with another trans girl.\"),\"\\n\",Vue.h(_components.li,null,\"She started to manage the QQ group \",Vue.h(_components.em,null,\"Harunome Hanbai\"),\".\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,'From best \"boy\" friends to best girl friends with her friend whom she met in primary school'),\"\\n\",Vue.h(_components.p,null,\"In April 2022, \",Vue.h(_components.a,{href:\"https://github.com/BeiyanYunyi\"},\"Bei Yan Yun Yi\"),' saw a social media post from Mio.\\nIt was also at that time that Bei Yan Yun Yi figured out her gender identity.\\nBei Yan Yun Yi remembered that Mio had researched SRS during primary school.\\nTherefore, when she reconnected with Mio, she came out to her.\\nJust like that, best \"boy\" friends became best girl friends.'),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo6.webp\",\"${path}/photos/photo7.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Translation:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Mio: (Sticker)\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Do you have a moment right now?\"),\"\\n\",Vue.h(_components.p,null,\"Me (Translator’s note: The sender is Bei Yan Yun Yi, her friend whom she met in primary school): Sure.\"),\"\\n\",Vue.h(_components.p,null,\"Me: So I was thinking, are you trans?\"),\"\\n\",Vue.h(_components.p,null,\"Mio: How did you know?\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Hey~\"),\"\\n\",Vue.h(_components.p,null,\"Me: Because I remembered that you had already researched SRS in primary school.\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Is it because you saw my Tieba (Translator's note: a popular social media platform) post?\"),\"\\n\",Vue.h(_components.p,null,\"Me: No, I haven’t checked Tieba in a while. I did see your WeChat (Translator's note: another popular social media platform) post, though.\"),\"\\n\",Vue.h(_components.p,null,\"Me: Have you considered what you're experiencing to be Gender Dysphoria?\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Probably…\"),\"\\n\",Vue.h(_components.p,null,\"Me: I think we need to meet. How about May 1st? (Translator's note: a holiday)\"),\"\\n\",Vue.h(_components.p,null,\"Me: (photo, a WeChat post)\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"(Translation of the post):\"),\"\\n\",Vue.h(_components.p,null,\"Being able to maintain a state between male and female is a miracle――height, body shape, behaviour, skin, and voice.\\nA state like this allows me to switch gender presentations relatively easily without fear of being clocked.\\nBeing in a state like this delayed the worsening of my Gender Dysphoria.\"),\"\\n\",Vue.h(_components.p,null,\"But I can't delay it forever.\\nI don't identify with most of what’s commonly considered “musculine qualities”. (Means I don’t want to be a man.) I don’t want to be the object of “male gaze”, too. (That is disgusting.)\\nI only have one choice left:\\nI don’t want to be recognized as a man, nor be seen as the object of “male gaze”.\\nIn other words, I want to be seen as an independent, intelligent, gentle but determined woman (or someone who’s not constrained by gender entirely).\\nHowever, it's really hard to do something like this.\\nI will have to endure the pain of Gender Dysphoria by not presenting as myself in the foreseeable future.\"),\"\\n\",Vue.h(_components.p,null,'This is my coming out post. Rest assured. I will still be the \"me\" who you are already familiar with.\\nAnd one more note: I still won’t be interested in men.'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Me: This Wechat post is my coming out post.\\nMe: We are sisters, now.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Built up another friendship\"),\"\\n\",Vue.h(_components.p,null,\"During one month, Mio and her close friend spent time together six times.\\nThe backpacks they bought together recorded their friendship silently:\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo5.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Her friend didn’t expect the goodbye at the airport to become the last time she could ever see her:\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo4.webp\"]}),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.p,null,\"In China mainland, graduation certificates are void after a gender marker change;\\nSRS is required to change the gender marker.\\nTherefore, only people who are “lucky” enough to afford and go through SRS before graduation can gain their graduation certificates.\"),\"\\n\",Vue.h(_components.p,null,\"Mio was trying to make that money in the hope that she could gain enough money for SRS before graduation.\\nUnfortunately, her depression left her unable to learn programming so she couldn’t make money that way.\\nTherefore, she resorted to being a driver instead.\\nHowever, she was demanded over a thousand (more than she had earned) and got mocked for being trans after an accident in which no one was hurt.\"),\"\\n\",Vue.h(_components.p,null,\"And therefore:\"),\"\\n\",Vue.h(_components.p,null,\"Despite her best efforts, she was overpowered by another episode of depression and suicidal thoughts on 2023 February 24th, two days after the accident.\\nThis time, she didn’t tell anyone about her plan and only set up a scheduled Tweet at noon the next day.\\nWhen her mother found her, it was already too late.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/twitter1.webp\",\"${path}/photos/twitter2.webp\",\"${path}/photos/twitter3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Translation of the above photos:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"@biliacat 2023 Feb 25th:\"),\"\\n\",Vue.h(_components.p,null,\"Mio has already gone according to her mother.\"),\"\\n\",Vue.h(_components.p,null,\"I have no words to express my sadness or shock.\"),\"\\n\",Vue.h(_components.p,null,\"Rest in peace, Mio.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Mio 2023 Feb 25th (Translator’s note: The time discrepancy is because she scheduled this Tweet.):\"),\"\\n\",Vue.h(_components.p,null,\"Goodbye. . .everyone.\"),\"\\n\",Vue.h(_components.p,null,\"This sleep will be a long one…\"),\"\\n\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.p,null,\"@biliacat 2023 Feb 25th:\"),\"\\n\",Vue.h(_components.p,null,\"Mio, you already promised me you aren't going to do something like this…\"),\"\\n\",Vue.h(_components.p,null,'Your mother told me:\\n\"When I came into her room this morning, I saw--\\nMio had put on makeup and pretty clothes.\\nBut her eyes are closed, forever.\"'),\"\\n\",Vue.h(_components.p,null,\"My tears fell. I couldn't keep them in anymore.\"),\"\\n\",Vue.h(_components.p,null,\"Mio, I hope you get to be a normal girl in your next life.\"),\"\\n\",Vue.h(_components.p,null,\"Farewell, Mio.\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.p,null,\"@biliacat 2023 Feb 26th\"),\"\\n\",Vue.h(_components.p,null,\"Mio was a student at one of the best universities in China.\\nShe was brilliant and dexterous.\"),\"\\n\",Vue.h(_components.p,null,\"Her death seems to be an individual incident, but it's more complicated than that.\"),\"\\n\",Vue.h(_components.p,null,\"She suffered from depression and was hospitalized once.\\nShe was managing it with medications, but she was unable to fully control it.\\nShe sometimes harms herself and talks about her suicidal thoughts.\"),\"\\n\",Vue.h(_components.p,null,\"The direct reason behind her suicide is what happened two days ago.\\nHer family members didn't help her in time.\\nIn the end, she took her life during another episode of depression.\"),\"\\n\",Vue.h(_components.p,null,\"(1/2)\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.p,null,\"@biliacat 2023 Feb 26th\"),\"\\n\",Vue.h(_components.p,null,\"Therefore, the real reasons behind her suicide are problems in society and her own family:\"),\"\\n\",Vue.h(_components.p,null,\"Most people don’t understand depression and Gender Dysphoria.\"),\"\\n\",Vue.h(_components.p,null,\"Most people disapprove of trans people and gender-affirming treatments.\"),\"\\n\",Vue.h(_components.p,null,\"A few people persuade others into suicide for fun.\"),\"\\n\",Vue.h(_components.p,null,\"These factors caused tragedy after tragedy.\\nTherefore, I must say that it was already mostly determined at the start.\"),\"\\n\",Vue.h(_components.p,null,\"Let's wish her rest in peace.\"),\"\\n\",Vue.h(_components.p,null,\"(2/2)\"),\"\\n\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.p,null,\"These are the last text messages she sent:\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Translation:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\". . .\"),\"\\n\",Vue.h(_components.p,null,\"Me (Translator’s note: The sender is Bei Yan Yun Yi, her friend whom she met in primary school.): What is happening?\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Just another episode of depression.\"),\"\\n\",Vue.h(_components.p,null,\"Mio: \",Vue.h(\"del\",null,\"I almost wanted to die.\")),\"\\n\",Vue.h(_components.p,null,\"Mio: Actually, I was thinking about what it would be like after death just after having dinner.\"),\"\\n\",Vue.h(_components.p,null,\"Me: (fainting face emoji)\"),\"\\n\",Vue.h(_components.p,null,\"Mio: I’m sorry.\"),\"\\n\",Vue.h(_components.p,null,\"Mio: I had already planned out everything:\"),\"\\n\",Vue.h(_components.p,null,\"Mio: Quit my QQ groups; delete my contacts; schedule a Tweet…\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"May you rest in peace, Mio.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"