"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Lin was a trans girl majoring in art.\\nHer tweets often showcased drafts of her drawings.\"),\"\\n\",Vue.h(\"div\",{style:\"display: flex; margin: auto; gap: 80px; flex-direction: row; justify-self: center; justify-content: center; justify-items: center; flex-wrap: wrap\"},Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo4.webp\",\"${path}/photos/photo5.webp\",\"${path}/photos/photo6.webp\"]}),Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\",\"${path}/photos/photo3.webp\"]})),\"\\n\",Vue.h(_components.p,null,\"She had childlike innocence and was interested in all kinds of cute toys.\"),\"\\n\",Vue.h(_components.p,null,\"Lin had a complex family situation.\\nShe came from a blended family.\\nEach of her parents had a child from previous relationships, and then they had her together.\"),\"\\n\",Vue.h(_components.p,null,\"When she was young, she had many people who cared about her and felt very happy.\"),\"\\n\",Vue.h(_components.p,null,\"But everything changed when she started elementary school.\\nHer father made money and had a change of heart, leading to frequent arguments with her mother, and they eventually divorced...\"),\"\\n\",Vue.h(_components.p,null,\"She and her mother moved to another place, and their economic situation was not as good as before. Her mother often brought other men home, telling her that they were “business partners.”\"),\"\\n\",Vue.h(_components.p,null,\"During that time, Lin struggled with depression and anxiety.\\nShe later learned about what being transgender is and eventually confirmed her desire to be a girl.\"),\"\\n\",Vue.h(_components.p,null,\"She didn’t have many companions. Within her circle of only two or three friends, a girl was very good to her, and they often chatted together.\"),\"\\n\",Vue.h(_components.p,null,\"Her mother’s boyfriend was physically abusive towards her. Even though her mother tried to stop him, she often suffered violence from him.\"),\"\\n\",Vue.h(_components.p,null,\"Then, it's the standard narrative: coming out, running away, returning home, and being beaten.\"),\"\\n\",Vue.h(_components.p,null,\"She was terrified of pain but didn’t know what to do...\"),\"\\n\",Vue.h(_components.p,null,\"She didn’t understand why her family had become like this or how she had become who she was.\"),\"\\n\",Vue.h(_components.p,null,\"Later, there was self-harm, loneliness... and further mental breakdown.\"),\"\\n\",Vue.h(_components.p,null,\"Once, she wrote in a tweet:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Friends, to me, are like: he is my only one, but I am just one of his. Afraid of loneliness, yet having to get used to loneliness.\"),\"\\n\",Vue.h(_components.p,null,\"Watching movies alone, playing games alone, going to the arcade alone, going to the hospital alone... living like a failure...\"),\"\\n\",Vue.h(_components.p,null,\"Afraid of being discovered by others, yet longing for their care. Sometimes, a hug or a word of concern is more effective than any amount of medication, pretending to be normal, pretending to be cheerful all day...\"),\"\\n\",Vue.h(_components.p,null,\"Turning off the phone and closing my eyes, the sense of loneliness comes rushing in, the past pains flashing before my eyes like a lantern...\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In the end, she chose to leave this world.\"),\"\\n\",Vue.h(_components.p,null,\"Lin once wrote: In the next life, I want to be a cat, no studying, no work, no worries, just meowing...\"),\"\\n\",Vue.h(_components.p,null,\"We hope that she can get her wish and be a cute, happy cat...\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"