"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"Menma is a kind and gentle transgender girl who loves \",Vue.h(_components.em,null,\"Ano Hi Mita Hana no Namae wo Bokutachi wa Mada Shiranai\"),\"—the anime, and especially the character Menma. This name is almost her sole identity on all social platforms. Like Menma, she left everyone behind, and this time, perhaps, there will be no reunion ten years later in August.\"),\"\\n\",Vue.h(_components.h2,null,\"Wish\"),\"\\n\",Vue.h(_components.p,null,\"She wants to share her story in her true form and bring happiness to more people.\"),\"\\n\",Vue.h(_components.p,null,\"She’s a girl who loves life. Beneath the lights, in the simplest of lives, she carries the most distant dreams.\"),\"\\n\",Vue.h(_components.p,null,'She enjoys fishing, collecting stamps, singing, and traveling, wanting to connect with the world. She likes recording her life in her own way, leaving marks on the pages of memories. Sometimes, she’s like a painter, sketching a picture of \"Old Man Chen\"—a tea-drinking, newspaper-reading, fishing enthusiast—in her high school classmates’ memories. At other times, she’s like a poet, using high-level English and Japanese to turn her life\\'s memories into poetry. And sometimes, she’s like an actress, hiding her deepest pain under the importance she places on friendship, playing the reliable listener when others share their troubles.'),\"\\n\",Vue.h(_components.p,null,\"In the final moments of her life, she casts a farewell glow to all who knew her. That glow is like the mist that rolls over mountains, like the night music brought by a gentle breeze from a quiet world, like moonlight glistening on the creek. Then, it leaves her ashes as a mark, symbolizing she was once here.\"),\"\\n\",Vue.h(_components.p,null,\"She wants to inspire others with her strength, bringing hope to more people.\"),\"\\n\",Vue.h(_components.p,null,\"So, she’s a girl of incredible perseverance. You see, in the starry night, she bears the greatest pressure with the frailest body.\"),\"\\n\",Vue.h(_components.p,null,\"With type II diabetes, fatty liver, and other underlying health issues, she spent her high school years in Chengdu. After the college entrance exam, she set off for the city by the Jialing River, where she began a new life at Xihua University. Though the school environment wasn’t ideal, her ambition never wavered. As a member of the student council, she faced the intense demands of her research team, but still, she never gave up on her N2 Japanese exam. Such an independent and determined girl deserved a better life, didn’t she?\"),\"\\n\",Vue.h(_components.p,null,\"But perhaps God, in His sense of “fairness,” made her meet with family misunderstandings and pressure. Her phone was taken and checked; soon after, her relationships were interfered with by family, and the dreams locked in her heart were repeatedly obstructed when the cupboard door burst open. “My heart’s peaceful place is not my hometown…”\"),\"\\n\",Vue.h(_components.p,null,\"She wants to care for the lives of others with a warm and kind heart, bringing them small rays of light.\"),\"\\n\",Vue.h(_components.p,null,\"So, she’s a girl who can be trusted. You see, far across the mountains and seas, she gave a clear direction in the most complicated of situations.\"),\"\\n\",Vue.h(_components.p,null,'Even when burdened with both physical and psychological pressure, she would still take care of her companions. She’d plan meals and itineraries in advance, offering reliable solutions when she learned about their busy schedules or personal preferences. The time she left for her companions would always be a memory cherished by everyone. She wasn’t the weak child of stereotypes; she was a \"senior\" people could rely on, and also a \"teacher\" who could be trusted.'),\"\\n\",Vue.h(_components.p,null,\"She wants to accompany more people with her cuteness and bring sunshine to their lives.\"),\"\\n\",Vue.h(_components.p,null,\"So, she’s a gentle and meticulous girl. You see, in her small world, she supports the perfect one.\"),\"\\n\",Vue.h(_components.p,null,\"Because she loves cute things, she loves to present herself in the cutest ways in front of others. She once made a deep impression with the images of Alona and Atori. As a responsible kigurumi performer, she always brought these two cute little girls to life with graceful steps and lively actions, letting them meet everyone in the real world.\"),\"\\n\",Vue.h(_components.p,null,\"Her head is large and heavy, with her eyes barely able to catch a glimpse of the world. But whenever she catches a glimpse of those she has healed, the cute doll feels the recognition and joy in their warm gaze.\"),\"\\n\",Vue.h(_components.p,null,'\"Well, do you like this cute side of me? Can you stay with this cute little doll for a while? I really love it! If you like, we can hug, okay? Wanna come?\"'),\"\\n\",Vue.h(_components.p,null,'\"Wearing this headpiece and being seen as a girl makes me so happy! Even if I face more troubles, I can still hide them under a smile!\"'),\"\\n\",Vue.h(_components.p,null,\"Since high school, she became the “high-performance robot” in the memories of friends and family. Even on the night before her passing, she still managed to bury the greatest worries, choosing to show her cutest side to those who shared her passion.\"),\"\\n\",Vue.h(_components.p,null,'\"Our memories of kigurumi started with the doll, and they will end with it when I leave.\"'),\"\\n\",Vue.h(_components.p,null,'\"My head is so heavy and tired... The doll wants to sleep now... Can you say goodnight again?\"'),\"\\n\",Vue.h(_components.p,null,\"Kigurumi was the few moments of happiness in her life when she could appear as a doll. It was a conversation with the sun, moon, and stars, a dialogue with rivers and lakes, a handshake with trees, and a brush against the grass—a timeless eternity.\"),\"\\n\",Vue.h(_components.p,null,\"She wants to accompany more people with her cuteness and bring sunshine to their lives.\"),\"\\n\",Vue.h(_components.p,null,\"“My... wish? I also want to be cuter. I want to become someone people can trust.”\"),\"\\n\",Vue.h(_components.p,null,\"“Please don’t distance yourself because of my gender... I won’t hurt you.”\"),\"\\n\",Vue.h(_components.h2,null,\"Passing\"),\"\\n\",Vue.h(_components.p,null,\"Pain never truly leaves; it just shifts from here to there, or perhaps transitions from psychological to physical. The sensations from HRT never make things easy, but it brings her closer to her ideal self, and so, she chooses to keep going.\"),\"\\n\",Vue.h(_components.p,null,\"However, due to her underlying health conditions, the side effects of hormones were especially evident in her body. Even so, she still wanted to calm her fluctuating body, for only in a better state could she make more people happy.\"),\"\\n\",Vue.h(_components.p,null,\"“If I take good care of myself, I can make more people feel at ease. Then everything will have a chance.”\"),\"\\n\",Vue.h(_components.p,null,\"The sweet little pills floated through her body, and the hormones slowly entered her system, as if a warm current drove her to edit the final message she would leave us:\"),\"\\n\",Vue.h(_components.p,null,\"“Actually, I feel like I won’t make it to that day. It all feels like a fantasy before death.”\"),\"\\n\",Vue.h(_components.p,null,\"“But I still want to be cuter, more reliable. I want to become an older sister who can help more people. There are so many kids who need help.”\"),\"\\n\",Vue.h(_components.p,null,\"“I’m sorry... Teacher, I just can’t hold on anymore. Remember me as the cutest version of myself. I really wanted to show more people this side of me.”\"),\"\\n\",Vue.h(_components.p,null,\"Just hours after speaking these words, she passed away.\"),\"\\n\",Vue.h(_components.p,null,\"Her memory and imprint turned into a small box, scattered in the Jialing River. The traces were washed away by the water, but the last memory remained in the fishing spot.\"),\"\\n\",Vue.h(_components.p,null,\"She fought silently with bipolar disorder and lost, but the meme she created still flickers through the fragmented lives of others, a fleeting glow, a smile almost familiar.\"),\"\\n\",Vue.h(_components.p,null,\"Goodnight, Menma. This game of hide-and-seek, we really won’t find you anymore.\"),\"\\n\",Vue.h(_components.p,null,\"Sleep well, Menma. This time, the transformation into a doll, truly, we will become one.\"),\"\\n\",Vue.h(_components.p,null,\"Goodbye, Menma. This time, the game of Uno, truly, we’ve added a lot.\"),\"\\n\",Vue.h(_components.p,null,\"There, the cute little girl will continue to comfort everyone. There, the cute doll will continue to play the beloved role. There, she’ll take good care of herself, just as she promised.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"