"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"Menma was a kind and gentle transgender girl who liked the character Meiko in \",Vue.h(_components.em,null,\"Anohana: The Flower We Saw That Day\"),\" (an anime).\\nShe used this name exclusively across all her social media platforms.\\nLike Meiko, she left everyone behind.\\nPerhaps this time, there will be no reunion ten years later in August.\"),\"\\n\",Vue.h(_components.h2,null,\"Wish\"),\"\\n\",Vue.h(_components.p,null,\"She aimed to share her story authentically and spread joy.\"),\"\\n\",Vue.h(_components.p,null,\"She was a girl who loved life. In her simple life, under the lights, she held onto the most distant dreams.\"),\"\\n\",Vue.h(_components.p,null,\"She enjoyed fishing, collecting stamps, singing, and travelling, all to connect with the world. She liked recording her life in her way, leaving marks on the pages of memories. At times, she resembled a painter, creating a depiction of “Old Man Chen”—a tea-drinking, newspaper-reading, fishing enthusiast—in her high school classmates’ memories. At times, she expresses herself like a poet, using eloquent English and Japanese to transform her life’s memories into poetry. At times, she acts like an actress, concealing her deepest pain beneath the importance she places on friendship and playing the reliable listener when others share their troubles.\"),\"\\n\",Vue.h(_components.p,null,\"In the final moments of her life, she cast a farewell glow to all who knew her. That glow is like the mist rolling over mountains, like the night music brought by a gentle breeze from a tranquil world, and like moonlight glistening on the creek. Then, it leaves her ashes as a mark, symbolizing she was once here.\"),\"\\n\",Vue.h(_components.p,null,\"She wants to inspire others with her strength, bringing hope to more people.\"),\"\\n\",Vue.h(_components.p,null,\"So, she’s a girl of incredible perseverance. You see, in the starry night, she bears the greatest pressure with the frailest body.\"),\"\\n\",Vue.h(_components.p,null,\"While battling with type II diabetes, fatty liver, and other underlying health issues, she finished high school in Chengdu.\\nAfter the entrance examination for higher education, she set off for the city by the Jialing River, where she began a new life at Xihua University.\\nThough the learning environment wasn’t ideal, her ambition never wavered.\\nAs a member of the student council, she faced the intense demands of her research team, but she never gave up on her N2 Japanese exam.\\nSuch an independent and determined girl deserved a better life, didn’t she?\"),\"\\n\",Vue.h(_components.p,null,\"But perhaps God, in His sense of “fairness,” made her meet with family misunderstandings and pressure. Her phone was taken and checked; soon after, family interfered with her relationships, and the dreams locked in her heart were repeatedly obstructed when she was outed.\\n“My heart’s rightful place is not my hometown…”\"),\"\\n\",Vue.h(_components.p,null,\"She wanted to care for others with a warm and kind heart, bringing them small rays of light.\"),\"\\n\",Vue.h(_components.p,null,\"So, she’s a girl who can be trusted. You see, far across the mountains and seas, she gave the clearest directions in the most complicated of situations.\"),\"\\n\",Vue.h(_components.p,null,\"Even when burdened with both physical and psychological pressure, she would still take care of her companions.\\nShe planned meals and itineraries, providing reliable solutions when she learned about their busy schedules or personal preferences. The memories she left for her companions will always be cherished by everyone. She was not the weak child of stereotypes; she was a reliable “senior” and a trusted “teacher.”\\nShe wants to share her cuteness and bring joy to others.\"),\"\\n\",Vue.h(_components.p,null,\"So, she was a gentle and meticulous girl. You see, she maintained the best world for everyone despite how intolerant the world was to her.\"),\"\\n\",Vue.h(_components.p,null,\"Because she loved cute things, she sometimes presented herself in the cutest ways.\\nShe once made a deep impression with the images of Alona and Atori. As a responsible Kigurumi performer, she always brought these two cute girls to life with graceful steps and lively actions, letting them meet everyone in the real world.\"),\"\\n\",Vue.h(_components.p,null,\"Her Kigurumi headpiece was large and heavy, so her eyes could barely catch a glimpse of the world while she was wearing it. But whenever she catches a glimpse of those she has healed, the cute Kigurumi doll feels the recognition and joy in their warm gaze.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Well, do you like this cute side of me? Can you stay with this cute little doll for a while? I really love it! If you like, we can hug, okay? Wanna come?\"),\"\\n\",Vue.h(_components.p,null,\"Wearing this headpiece and being seen as a girl makes me so happy! No matter how many troubles I face, I can hide them under a smile!\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Since high school, she has become the “high-performance robot” (a reference to a cute character she cosplayed as) in the memories of close friends. Even on the night before her passing, she still managed to bury the greatest worries, choosing to show her cutest side to those who shared her passion.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Our memories of Kigurumi started with the doll, and they will end with it when I leave.\"),\"\\n\",Vue.h(_components.p,null,\"My head feels so heavy and tired in my headpiece... The doll wants to sleep now... Can you repeat goodnight?\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Kigurumi was the few moments of happiness in her life when she could appear as a doll. It was a conversation with the Sun, the Moon, and the stars, a dialogue with rivers and lakes, a handshake with trees, and a brush against the grass—a timeless eternity.\"),\"\\n\",Vue.h(_components.p,null,\"She wanted to accompany more people with her cuteness and bring sunshine to their lives.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"My... wish? I actually do want to be even cuter. I want to become someone people can trust.”\"),\"\\n\",Vue.h(_components.p,null,\"Please don’t distance yourself from me because of my gender... I won’t hurt you.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Passing\"),\"\\n\",Vue.h(_components.p,null,\"Pain never truly leaves; it just shifts from one place to another, or perhaps from psychological to physical. The sensations from HRT never made things easy, but it brought her closer to her ideal self, and so she chose to keep going.\"),\"\\n\",Vue.h(_components.p,null,\"However, due to her underlying health conditions, the side effects of hormones were especially evident in her body. Even so, she still wanted to calm her fluctuating body, for only by being in a better state could she make more people happy.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"If I take good care of myself, I can make more people feel at ease. Then everything will be fine.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"The sweet little pills floated through her body, and the hormones slowly entered her system as if a warm current drove her to edit the final message she would leave us:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Actually, I feel like I won’t make it to that day. It all feels like a fantasy before death.\"),\"\\n\",Vue.h(_components.p,null,\"But I still want to be cuter, more reliable. I want to become an older sister who can help more people. There are so many kids who need help.”\"),\"\\n\",Vue.h(_components.p,null,\"I’m sorry...teacher, I just can’t hold on anymore. Remember me as the cutest version of myself. I really wanted to show more people this side of me.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Just hours after speaking these words, she passed away.\"),\"\\n\",Vue.h(_components.p,null,\"Her memory and imprint turned into a small box scattered in the Jialing River. The water washed away the traces, but the last memory remained in the fishing spot.\"),\"\\n\",Vue.h(_components.p,null,\"She fought silently with bipolar disorder and lost, but the meme she created still flickers through the fragmented lives of others, a fleeting glow, a smile almost familiar.\"),\"\\n\",Vue.h(_components.p,null,\"Goodnight, Menma. This time, the game of hide-and-seek—truly, we won’t find you anymore.\"),\"\\n\",Vue.h(_components.p,null,\"Sleep well, Menma. This time, the transformation into a doll—truly, you have become one.\"),\"\\n\",Vue.h(_components.p,null,\"Goodbye, Menma. This time, the game of Uno—truly, we’ve added a lot.\"),\"\\n\",Vue.h(_components.p,null,\"There, the cute girl will continue to comfort everyone. There, the cute doll will continue to play the beloved role. There, she’ll take good care of herself, just as she promised.\"),\"\\n\",Vue.h(_components.p,null,\"Contributor for this entry: \",Vue.h(_components.a,{href:\"https://github.com/dongguacute\"},\"Cherry\")))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"