"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.jpg\",\"${path}/photos/photo2.jpg\"]}),\"\\n\",Vue.h(_components.p,null,\"Shihai was a naive girl who preferred to stand by the window, gazing into the distance and losing in thought, just like her favourite QQ avators.\\nIn that state, she won't notice you if you walk close to her quietly.\"),\"\\n\",Vue.h(_components.p,null,\"The first time I met her in real life, I (The author of this entry) was immediately attracted by her glommy temperament just like Lin Tai-yu in \",Vue.h(_components.em,null,\"A Dream of Red Mansions\"),\".\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.jpg\"]}),\"\\n\",Vue.h(_components.p,null,\"（The preceding photo is Shihai measuring her height）\"),\"\\n\",Vue.h(_components.h2,null,\"Her Family\"),\"\\n\",Vue.h(_components.p,null,'Her hometown is located inside the Central Plains.\\nConservative values is dominant there.\\nHer grandfather had two sons because of birth control legislations.\\nHer uncle (the elder son) had one daughter (her sister); her father had one \"son\" (her).'),\"\\n\",Vue.h(_components.p,null,'They had a tradition of throwing away the placenta for female babies and burying the placenta in the center of the courtyard for male babies.\\nTherefore, she had an enormous amount of pressure put on her for \"extending the family line\" ever since her birth.'),\"\\n\",Vue.h(_components.p,null,'Her father was whom we\\'d call a \"traditional father\" who follows Machismo.\\nIn 2023, her father started to be even more strict with her after he almost died from a disease.'),\"\\n\",Vue.h(_components.p,null,\"Her father was proficient in Math and Economics.\\nHe wanted to raise her to be \\\"a man who can support the sky while standing on the ground\\\".\\nHe said \\\"I want him to be resillient and unyielding, but he's too kind; he can't do it.\\\"\\nMoreover, because she was fragile, introverted, and kind since being a child, out of worry, he often taught her what he thought was necessary to live in a society:\\nCapitalism, Laws, the dark side of humanity...but she often wasn't able to meet her father's standard.\"),\"\\n\",Vue.h(_components.p,null,\"She had poor grades in junior middle school, and still wasn't able to meet her family's expectations after junior middle school.\\nShe always blamed herself for that.\\nAfter her graduation from high school, she studied at home for a year and then was able to get into a good public university.\\nSince she was living with her parents, she didn't have much personal space and was always blamed for things that are not her fault.\\nFor example, when she plays a game to take a break form studies, she'd be blamed for \\\"always playing games\\\".\\nTherefore, she was always depressed.\"),\"\\n\",Vue.h(_components.h2,null,\"Her Transgender Experience\"),\"\\n\",Vue.h(_components.p,null,\"Her father told us how she was like as a child.\\nEver since she was a child, she acted femininely.\\nShe told him, when she first started school, students were separated into groups of boys and girls to play.\\nShe imagined playing with the girls after school.\\nAccording to some other stories told by her father, she seems to be a girl who was assigned the wrong gender at birth.\"),\"\\n\",Vue.h(_components.p,null,\"Looking at her early life, her transgender experience is similar to Einar Wegener from \",Vue.h(_components.em,null,\"The Danish Girl\"),\".\\nHer gender incongruity was made apparent in as early as her childhood.\\nHer early male personality was formed by trying to fit in with traditional values and ethics, but that's not the real her.\"),\"\\n\",Vue.h(_components.p,null,'Sigmund Freud explained his theory about \"abnormal behaviors\" in his publication ',Vue.h(_components.em,null,\"Three Essays on the Theory of Sexuality\"),\":\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Where the sexual instinct is fairly intense, but perverse, there are two possible outcomes.\"),\"\\n\",Vue.h(_components.p,null,\"The first, which we shall not discuss further, is that the person affected remains a pervert and has to put up with the consequences of his deviation from the standard of civilization.\\nThe second is far more interesting. It is that, under the influence of education and social demands, a suppression of the perverse instincts is indeed achieved, but it is a kind of suppression which is really no suppression at all. It can better be described as a suppression that has failed.\"),\"\\n\",Vue.h(_components.p,null,\"The inhibited sexual instincts are, it is true, no longer expressed as such—and this constitutes the success of the process—but they find expression in other ways, which are quite as injurious to the subject and make him quite as useless for society as satisfaction of the suppressed instincts in an unmodified form would have done. This constitutes the failure of the process, which in the long run more than counterbalances its success.\"),\"\\n\",Vue.h(_components.p,null,\"The substitutive phenomena which emerge in consequence of the suppression of the instinct amount to what we call nervous illness, or, more precisely, the psychoneuroses.\"),\"\\n\",Vue.h(_components.p,null,\"Neurotics are the class of people who, since they possess a recalcitrant organization, only succeed, under the influence of cultural requirements, in achieving a suppression of their instincts which is apparent and which becomes increasingly unsuccessful. They therefore only carry on their collaboration with cultural activities by a great expenditure of force and at the cost of an internal impoverishment, or are obliged at times to interrupt it and fall ill.\"),\"\\n\",Vue.h(_components.p,null,\"from Freud, S. (1908). ‘Civilized’ Sexual Morality and Modern Nervous I lness. The Standard Edition of the Complete Psychological Works of Sigmund Freud, Volume IX (1906-1908): Jensen's ‘Gradiva’ and Other Works, 177-204\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"According to conservative values, being trans is a kind of such abnormality.\\nShe knew her parents may not be able to accept her choices.\\nShe thought her choice caused her parents' wishes of her void.\\nShe was diagnosed with severe depression after a failed suicide attempt.\\nAt that time, her father thought her trans identity was just a crossdressing fetish and was hopeful for her to be \\\"cured\\\" in a few years.\\nHe thought if that problem is taken care of, then she won't be depressed, and tried to accept her and even allowing her to take HRT.\\nHe told her he'll convince her mother, but he failed.\"),\"\\n\",Vue.h(_components.p,null,\"Her mother ran away from home after learning about the situation.\\nHer mother told her she wants to die and never see her again.\\nBefore that, her parents were a loving couple who'd hold hands while going out.\\nThey even took a new set of wedding photographs in June that same year.\\nTherefore, she was stuck in a dilemma between them.\\nHer mother's words of unacceptance was a big blow for her.\\nAccording to her character, she might think:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"If I'm no longer in this world, or if I was not born in the first place, then maybe my parents won't have to deal with me and will be happier?\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"She's born sentimental and has a fragile but kind heart.\\nIn my opinion, she's a silly girl who's too kind for her own good.\\nShe'd rather blame her misfortune on her fate rather than others' malice,\\njust like Dai-Yu's negative outlook on life and relationships:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Coming together can only be followed by parting. The more pleasure people find in parties, the more lonely and unhappy they must feel when the parties break up. So better not forgather in the first place. The same is true of flowers: the delight people when in bloom, but it's so heart-rending to see them fade that it would be better if they never blossomed.\"),\"\\n\",Vue.h(_components.p,null,\"from A Dream of Red Mansions Volume I (Cao Xueqin, Gao E.), Foreign languages Press, Beijing, China, 1994 (First Published in hardback in 1978) 【第一册 P452】ISBN: 9787119006437\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Since a long time ago, she wanted to avoid forming close relationships because she's afraid of the partings.\"),\"\\n\",Vue.h(_components.p,null,\"She had poor grades in middle school and was often bullied.\\nShe couldn't fight back for unreasonable isolation and even physical abuse.\\nAt that time, she had a close friend.\\nThey were neighbours.\\nShe started to learn to play basketball in order to play together.\\nHowever, they parted after he started to bully her.\\nThat was her first resistance.\\nWith teary eyes, she questioned:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Why'd you bully me too?\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Given her character and lack of therapy, this cruel experience made her eventually develop \",Vue.h(_components.a,{href:\"https://en.wikipedia.org/wiki/Post-traumatic_stress_disorder\"},\"PTSD/PTSR\"),\".\\nShe started to be afraid of close relationships more.\\nHer other mental issues like severe depression is also related to this experience.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"When she remembers the horrible things she'd been through, I had seen her whole body crampling, trembling. I had seen her suffer from fear, dread, and shortness of breath.\\nBut I was too neglectful and obtuse.\\nI didn't realize the severity of the situation and the difficulty of dealing with it.\\nIf I realized, maybe things could be different.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"She inherited the stubborness of her father.\\nHer father researched nutritionalism and sports in order to make her grow taller.\\nAt that time, she wanted to grow taller as well, therefore she did as he instructed:\\neating one meal per day and doing lots of exercise.\\nShe had learnt of HRT since high school, but couldn't decide on it.\\nAfter starting HRT, she started to regret for her efforts to grow taller in the past.\\nShe suffered from gender dysphoria from her height, which was especially painful for her, who was both mentally unwell and stubborn.\"),\"\\n\",Vue.h(_components.h2,null,\"The Story of Her and Transgender Community\"),\"\\n\",Vue.h(_components.h2,null,\"Absurdity and Suicide, the Last Chapter\"),\"\\n\",Vue.h(_components.p,null,\"Contributor: \",Vue.h(_components.a,{href:\"https://twitter.com/LianShihai\"},\"Li'an\")),\"\\n\",Vue.h(_components.h2,null,\"Annotations\"),\"\\n\")}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"