"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",a:\"a\",em:\"em\"},props.components),PhotoScroll=_components.PhotoScroll,Sakura=_components.Sakura;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);if(!Sakura)_missingMdxReference(\"Sakura\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"简介\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"就和她喜欢用的 QQ 头像一样，柿海是个喜欢站在窗户边然后眺望远方发呆的傻傻的姑娘，即使轻轻走近也不易被察觉，初见时，我就被她身上那种林妹妹似阴郁的气质吸引了。\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"（柿海在量身高的照片）\"),\"\\n\",Vue.h(_components.h2,null,\"家庭环境\"),\"\\n\",Vue.h(_components.p,null,\"她的故乡在中原地带，那边的社会思想相对保守，家族观念很重。她的爷爷有两个儿子，因为计划生育，大儿子（她的大伯）有一个独女（她的堂姐），小儿子（她的父亲）有一个「独子」。\"),\"\\n\",Vue.h(_components.p,null,\"在那边，出生下来的女孩子的胎衣是要被扔掉的，男孩子的胎衣是要被埋在院子最中央的，所以她们家因为指派性别的原因从小就肩负着「开枝散叶」的重任。因此她从出生开始，身上就背负着一种巨大的无形的责任感，使命感。\"),\"\\n\",Vue.h(_components.p,null,\"她的父亲扮演着一个大男子主义的传统父亲角色，2013 年，他生了一场重病，从死神手中死里逃生的他在那之后很担心她的未来，对她要求特别高。\"),\"\\n\",Vue.h(_components.p,null,\"她的父亲精通于数字和经济学，想把她培养成一个像自己那样的「顶天立地的汉子」，其父亲说「我对她的要求是外向坚忍钢硬，但她太善良了，她做不到我这些」。又因为她从小性格比较软弱，内向，善良，因而担心她走上社会被别人欺负，所以经常教她一些自己眼里的「社会立足之本」，资本主义经济市场，法律、人性的搏杀与竞争……但是她的性格，总是做不到父亲要求的那些。\"),\"\\n\",Vue.h(_components.p,null,\"她因为初中的时候成绩不好，后面也一直不能达到父母的满意，一直背负着沉重的心理负担。她高三毕业后在家里学习过一年参加自考考上了现在的这个很不错的公立学校，因为待在家里和父母在一块，没什么个人空间，经常会被说压力话，例如她有时学习有时打游戏被说一直在玩电脑打游戏，在家总是被打被骂，导致她在家一直很压抑。\"),\"\\n\",Vue.h(_components.h2,null,\"跨性别\"),\"\\n\",Vue.h(_components.p,null,\"听她的父亲回忆起她小时候的事情，她从小就是女孩子性格，她曾经和我提起刚刚上学的时候，男生和女生被分开成两组玩游戏，晚上她回家想象自己是女孩子被抓，听她爸爸说的一些其他的故事，她是一个天生就被指派错性别的女性。\"),\"\\n\",Vue.h(_components.p,null,\"跨性别，纵观她早年的经历，很像《丹麦女孩》的主角 Einar Wegener，她的性别不一致现象早在童年时期就显露过，早年体内男性人格的形成是在无意识的情况下顺应了传统文化与道德的发展要求，但那并不是真实的她。从这点上讲，发生在她身上的性别不一致是与生俱来的。\"),\"\\n\",Vue.h(_components.p,null,\"弗洛伊德在《性学三论》中说到的这种反常性认为，一个人的反常性如果十分强烈，那就只有两条可能的出路：其中一条路是，在教育和社会规范的影响下，这些人也将得以克制住自身的反常性冲动。克制性冲动可能产生一种替代现象，就是我们所说的精神病。弗洛伊德在形容精神病患者的时候说：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「精神病患者就是一群违心地去适应了文化要求的影响，痛苦地压制了内心的欲望，竭尽全力地为文化的形成添砖加瓦的人，他们为此殚精竭虑，因此时不时地会显露出病态」。\"),\"\\n\",Vue.h(_components.p,null,\"——《文化的性道德与现代人的精神病》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"对于这个局限的前现代文明社会而言，跨性别是「病态」的。她很清楚父母可能完全无法接受她的选择。她说，她的选择，导致父母对她未来的幻想破灭了。之前她曾经自杀未遂被诊断为重度抑郁，那个时候她父亲觉得她的跨性别是类似于异装癖的兴趣爱好什么的，可能过几年可能就好了，觉得这个问题解决了就不抑郁了，试着接受这件事，答应给她买 HRT 的药物，和她说「你妈妈那边由我来说服」，但是最后没有说服。\"),\"\\n\",Vue.h(_components.p,null,\"她妈妈得知情况崩溃离家出走，说了些不想活、不想看见她之类的话，她的父亲和母亲感情很好，出门牵手的那种，很像年轻的小情侣，这一年六月还拍过一套新的婚纱照，她就这样被夹在中间，进退两难，母亲的不接受和那些话对她打击很大，根据她的性格分析她的内心，可能是觉得「如果我不在这个世界上了、或者我从一开始就没有出生，那么父母是不是就不用操心、不用付出了？是不是她们会过得比现在更幸福呢？」\"),\"\\n\",Vue.h(_components.p,null,\"她的性格，天生就多愁善感，她有一颗细腻温柔的心，在我眼里，她是个善良过了头的傻丫头，宁愿把错误归结为自己的无奈，都不愿意想是别人伤害了她。就像林妹妹的天生伤感，喜散不喜聚一样：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「人有聚就有散，聚时欢喜，到散时岂不冷清？既冷清，则生感伤，所以不如到是不聚的好。比如那花，开时令人爱慕，谢时则增惆怅，所以到是不开的好。」\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"从很久之前，她就不想有这种亲密关系，因为她害怕这种亲密关系的消失。\"),\"\\n\",Vue.h(_components.p,null,\"她初中的时候成绩不好，经常遭受霸凌；没有来由的孤立和身体虐待，女孩子性格的她也不敢反抗，那个时候她曾有一段亲密关系，那个人的家和她家很近，都在学校对面的小区，也是那个时候为数不多愿意和她一起玩的朋友，为了一起玩。那个时候她开始学习打篮球。然而这段亲密关系的破碎是伴随着校园暴力的，那个人也加入了欺负她的队伍，那是她唯一一次反抗，哭着问：「你为什么也要这样对我。」\"),\"\\n\",Vue.h(_components.p,null,\"这样一个性格的人，这段残酷的人生经历，巨大的创伤事件，对她伤害一定非常巨大，这段感情里伴随着亲密关系的巨大伤害一直没有被治愈，发展成为 \",Vue.h(_components.a,{href:\"https://zh.wikipedia.org/wiki/%E5%89%B5%E5%82%B7%E5%BE%8C%E5%A3%93%E5%8A%9B%E7%97%87\"},\"PTSD/PTSR\"),\"，所以她对亲密关系很害怕，后来的其他精神失调疾病如重度抑郁症和这段阴暗的人生经历也无法脱开干系。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"我曾在她身边目睹了她因为回忆起一些让她难受的事情而躯体化障碍发作，全身肌肉痉挛，呼吸困难、恐惧、害怕、发抖。可是我是失职的，迟钝的，我没有意识到这种精神疾病的治愈困难和她的情况之糟糕，如果我在后面有意识到问题的严重性，也许事情就会有改变。\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"她性格里遗传了她父亲偏执的一面，她爸爸以前为了让她长个子，对她进行科学训练，研究营养学，那个时候她也觉得长个子很好，就疯狂地吃有利于长身高的食物。小柿子高中时就已经知道 HRT 了，但是一直在纠结要不要吃糖，那个时候为了减肥，也做到了极致，每天只吃一顿，还大量运动。HRT 之后她就对过去科学训练长身高的事很后悔，因为身高的问题性别焦虑，这个对本来精神状态就不好而且还偏执性格来说是非常痛苦的。\"),\"\\n\",Vue.h(_components.h2,null,\"跨圈的故事\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"（跨圈里的故事很长，但是删了细节后还是觉得不合适，就觉得还是\",Vue.h(_components.a,{href:\"https://www.douban.com/note/858246014/?dt_dapp=1&_i=4897516gLA6hO2\"},\"不放这里\"),\"了比较好，毕竟是从我和她另外一个朋友的视角去看的）\")),\"\\n\",Vue.h(_components.p,null,\"进入跨圈最后的这段故事，我是亲历者，又是局外人，在最后，我是最有机会可以救她的一个人，可是我没有做到，最后她走丢了，就像最后在她梦里，找我的那通电话我没有接通一样。\"),\"\\n\",Vue.h(_components.p,null,\"这些故事不过是，一个从小就缺爱的善良的傻丫头，不断地给这个世界，她遇到的所有的人以她最大的善意，最大的信任。然后呢？被以开盒恶俗挂人迫害取乐的恶心顺直人伤害到被害妄想。不断的被最信任、最依赖的朋友所传递负面能量所影响，然后不断地被切割，被疏远，被背叛，被伤害。这条时间线上，本来有无数个转折点，本来一切都在慢慢变好的，可是运气太差了。\"),\"\\n\",Vue.h(_components.p,null,\"我不是个对的人，我太麻木了，活在自己的世界，我在最后才知道一切，原来我对她原生家庭压抑的环境，过往那些故事一无所知，我冷漠的心体会不到她的压抑和痛苦。风起于青蘋之末，如果一开始把我换成另外一个性格的人，至少能察觉到种种异相，也许就不是这个结局。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「亲爱的，别为爱情流泪」。\"),\"\\n\",Vue.h(_components.p,null,\"（出自李银河编《关于情感的对话》）\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"在她眼里我是个喜欢她的大姐姐，她太善良了，她深谙爱会有痛苦，不想伤害任何人，所以她给了我爱，一种复杂的爱，有纯粹的爱情，姐妹亲情，还有一直小心翼翼的保护，因为她知道自己受到很多别的 emo 跨性别的负面影响，所以不想把坏情绪传染给我，就像她一直担心她心里挂念的那个人生存不下来一样。\"),\"\\n\",Vue.h(_components.p,null,\"她对我有距离感，「安安姐是那种已经稳定工作的人，对这种看的开，谈不谈无所谓，不行就下一个」。错误的，小柿子，这个世界上没有什么比爱得到回应更幸福的事情了，你一直是我留恋的这个世界里的辽阔的海和蔚蓝的天。对不起，我忙着去生，忙着去死，却没有忙着抓住你的手，最后把你弄丢了。\"),\"\\n\",Vue.h(_components.h2,null,\"荒诞和自杀，最后的故事\"),\"\\n\",Vue.h(_components.p,null,\"上帝在掷骰子，不断地掷出最差的点数。天生易感性，家庭环境的压力，不断遇到错误的人，一个接一个，没有给她任何短暂喘息的机会。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"花原自怯，岂奈狂飚？柳本多愁，何禁骤雨？\"),\"\\n\",Vue.h(_components.p,null,\"——《芙蓉女儿诔》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"关于那些人，我不想在这里留下更多文字了。人性虽然复杂，但却总是有迹可循。她冰雪聪明，很有悟性，一开始她就懂的：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「那红尘中有却有些乐事，但不能永远依恃。况又有『美中不足，好事多魔』八个字紧相连属，瞬息间则又乐极悲生、人非物换，究竟是到头一梦，万境归空，倒不如不去的好。」\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"所以最后她只是无奈，想了很久很久，只是在等一个契机罢了。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「隐痛深藏于人的内心深处，正是应该在人的内心深处去探寻隐痛。这死亡的游戏是由面对存在的清醒，过渡到要脱离光明的逃遁。我们应该沿着这条线索去理解自杀。」\"),\"\\n\",Vue.h(_components.p,null,\"——加缪《西西弗神话》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"很多哲学家、作家都可以很好地解释人生存在的悲剧感，虚无和荒谬。每个人都是以自己为中心的无限大，在最本质的意义上是孤立的人，他者对自身的意志来说，总是虚无的，这么看，人最核心的精神意志总是孤独的。\"),\"\\n\",Vue.h(_components.p,null,\"人终其一生不过是在向世界祈求爱，但是失望总是常态，这个时候，人就看到了这个世界的杂乱无章和毫无意义，感受到这个世界站在希望的对立面，但人性里有对爱，幸福理性这种美好东西的希望。荒谬感和无意义就产生于这种人性的呼唤和世界的不美好之间。意识到自己在忍受着这荒谬的世界，自杀的动机，就此开始在心灵深处酝酿成熟。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"一个人自愿去死，则说明这个人认识到——即使是下意识地——习惯是可笑的，认识到人活着的任何深刻理由都是不存在的，就是认识到日常行为是无意义的，遭受痛苦也是无用的。\"),\"\\n\",Vue.h(_components.p,null,\"那么，这种难以尽述的情感，这种使精神生活失去对它来说是必需的麻木的情感究竟是什么呢？一个哪怕可以用极不像样的理由来解释的世界仍是人们感到熟悉的世界。然而，一旦世界失去幻想与光明，人就会觉得自己是局外人。这一放逐是无可挽回的，因为他被剥夺了对失去的家乡的记忆，而且丧失了对未来世界的希望。人与他的生活之间的，演员与舞台之间的这种分离，真正构成荒谬感。无须多加解释，人们就会理解到：在所有健在而又已经想过要自杀的人身上，这种荒谬感与对虚无的渴望直接相关。\"),\"\\n\",Vue.h(_components.p,null,\"——加缪《西西弗神话》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"自杀的起因是复杂的，很少有人深思熟虑而后自杀。麻木习惯的活着感到痛苦，但自杀需要莫大超越性的勇气，身体抗拒死亡，刻在基因里的生物本能，「我的灵魂已了无生机，但我的身体并不想死」，倘若这个时候还有点薄弱虚假的意义，也不会走向死亡。她曾经认为的「意义」在某一瞬间破灭了，曾经支撑她维持习惯的信念崩塌了。\"),\"\\n\",Vue.h(_components.p,null,\"加缪对生活充满爱恋，他留恋故乡蔚蓝的天空和辽阔的大海，所以他认识到荒谬后可以义无反顾的生活，他明知不能根除世上的邪恶而仍以西西弗上山的坚定步伐走向荒谬。但亲爱的小柿子，这个世界上已经没有她留恋的蔚蓝的天和辽阔的海了。\\n这是一个怎么样的世界，才会让人宁愿去选择自杀而不是寻找别的出路？何其荒谬。\"),\"\\n\",Vue.h(_components.p,null,\"最后她说，「人生在世不过吃喝玩乐性而已」，「世界孤立我任他奚落~」\"),\"\\n\",Vue.h(_components.p,null,\"最后她在《主播女孩重度依赖》玩出了一个期待的 bad ending，而后带着对诸神赋予她命运的对抗，决绝地选择了重归于虚无。\"),\"\\n\",Vue.h(_components.p,null,\"糖糖可以在下一个周目重新开始，可是这个世界上，即使我穷极一生，都再也找不到那个小傻猫了。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"洲迷聚窟，何来却死之香？海失灵槎，不获回生之药。眉黛烟青，昨犹我画。指环玉冷，今倩谁温？\"),\"\\n\",Vue.h(_components.p,null,\"——《芙蓉女儿诔》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"她走后的那天早上，外面飘起了漫漫的雪花，我想，这样一个美好的人，是不是去了天上的那一颗星星，去做了掌管这人间冬月里霜雪的仙子。\"),\"\\n\",Vue.h(_components.p,null,\"日本人爱把人生喻为樱花，盛开了，很短暂，然后就调谢了。她的生命就像樱花，盛开了，很短暂，然后就磕然凋谢。\"),\"\\n\",Vue.h(_components.p,null,\"三岛由纪夫在《天人五衰》中写过一个轮回的生命，每到 18 岁就死去，投胎到另一个生命里。这样，人就永远活在 Ta 最美好的日子里，不用等到牙齿掉了、头发白了，人变丑了，再悄然逝去。\"),\"\\n\",Vue.h(_components.p,null,\"小柿子就像这样，樱花虽然凋谢了，但它毕竟灿烂地盛开过。\"),\"\\n\",Vue.h(_components.p,null,\"我最亲爱的小柿子，我们来世再见。到那时我肯定还有缘分再见到你，毕竟这辈子的因果交错再也解不开了。我还很想问问你为什么，可是再问一万遍都没有人会给我一个答案了。\"),\"\\n\",Vue.h(_components.p,null,\"条目贡献：\",Vue.h(_components.a,{href:\"https://twitter.com/LianShihai\"},\"梨安\")),\"\\n\",Vue.h(Sakura,{count:\"50\"}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"