"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",a:\"a\",em:\"em\"},props.components),PhotoScroll=_components.PhotoScroll,Sakura=_components.Sakura;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);if(!Sakura)_missingMdxReference(\"Sakura\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"簡介\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"就和她喜歡用的 QQ 頭貼一樣，柿海是個喜歡站在窗戶邊然後眺望遠方發呆的傻傻的姑娘，即使輕輕走近也不易被察覺，初見時，我就被她身上那種林妹妹似陰鬱的氣質吸引了。\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"（柿海在測量身高時的照片）\"),\"\\n\",Vue.h(_components.h2,null,\"家庭環境\"),\"\\n\",Vue.h(_components.p,null,\"她的故鄉在中原地帶，那邊的社會思想相對保守，家族觀念很重。她的爺爺有兩個兒子，因為計劃生育，大兒子（她的大伯）有一個獨女（她的堂姐），小兒子（她的父親）有一個「獨子」。\"),\"\\n\",Vue.h(_components.p,null,\"在那邊，出生下來的女孩子的胎衣是要被扔掉的，男孩子的胎衣是要被埋在院子最中央的，所以她們家因為指派性別的原因從小就肩負著「開枝散葉」的重任。因此她從出生開始，身上就背負著一種巨大的無形的責任感，使命感。\"),\"\\n\",Vue.h(_components.p,null,\"她的父親扮演著一個大男子主義的傳統父親角色，2013 年，他得了一場重病，從死神手中死裡逃生的他在那之後很擔心她的未來，對她要求特別高。\"),\"\\n\",Vue.h(_components.p,null,\"她的父親精通于數字和經濟學，想把她培養成一個像自己那樣的「頂天立地的漢子」，其父親說「我對她的要求是外向堅忍鋼硬，但她太善良了，她做不到我這些」。又因為她從小性格比較軟弱，內向，善良，因而擔心她走上社會被別人欺負，所以經常教她一些自己眼裡的「社會立足之本」，資本主義經濟市場，法律、人性的搏殺與競爭……但是她的性格，總是做不到父親要求的那些。\"),\"\\n\",Vue.h(_components.p,null,\"她因為初中的時候成績不好，後面也一直不能達到父母的滿意，一直背負著沉重的心理負擔。她高三畢業後在家裡學習過一年參加自考考上了現在的這個很不錯的公立學校，因為待在家裡和父母在一塊，沒什麼個人空間，經常會被說壓力話，例如她有時學習有時打遊戲被說一直在玩電腦打遊戲，在家總是被打被罵，導致她在家一直很壓抑。\"),\"\\n\",Vue.h(_components.h2,null,\"跨性別\"),\"\\n\",Vue.h(_components.p,null,\"聽她的父親回憶起她小時候的事情，她從小就是女孩子性格，她曾經和我提起剛剛上學的時候，男生和女生被分開成兩組玩遊戲，晚上她回家想像自己是女孩子被抓，聽她爸爸說的一些其他的故事，她是一個天生就被指派錯性別的女性。\"),\"\\n\",Vue.h(_components.p,null,\"跨性別，縱觀她早年的經歷，很像《丹麥女孩》的主角 Einar Wegener，她的性別不一致現象早在童年時期就顯現過，早年體內男性人格的形成是在無意識的情況下順應了傳統文化與道德的發展要求，但那並不是真實的她。從這點上講，發生在她身上的性別不一致是與生俱來的。\"),\"\\n\",Vue.h(_components.p,null,\"佛洛伊德在《性學三論》中說到的這種反常性認為，一個人的反常性如果十分強烈，那就只有兩條可能的出路：其中一條路是，在教育和社會規範的影響下，這些人也將得以克制住自身的反常性衝動。克制性衝動可能產生一種替代現象，就是我們所說的精神病。佛洛伊德在形容精神病患者的時候說：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「精神病患者就是一群違心地去適應了文化要求的影響，痛苦地壓制了內心的欲望，竭盡全力地為文化的形成添磚加瓦的人，他們為此殫精竭慮，因此時不時地會顯露出病態」。\"),\"\\n\",Vue.h(_components.p,null,\"——《文化的性道德与現代人的精神病》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"對於這個局限的前現代文明社會而言，跨性別是「病態」的。她很清楚父母可能完全無法接受她的選擇。她說，她的選擇，導致父母對她未來的幻想破滅了。之前她曾經自殺未遂被診斷為重度抑鬱，那個時候她父親覺得她的跨性別是類似於異裝癖的興趣愛好什麼的，可能過幾年可能就好了，覺得這個問題解決了就不抑鬱了，試著接受這件事，答應給她買 HRT 的藥物，和她說「你媽媽那邊由我來說服」，但是最後沒有說服。\"),\"\\n\",Vue.h(_components.p,null,\"她媽媽得知情況崩潰離家出走，說了些不想活、不想看見她之類的話，她的父親和母親感情很好，出門牽手的那種，很像年輕的小情侶，這一年六月還拍過一套新的婚紗照，她就這樣被夾在中間，進退兩難，母親的不接受和那些話對她打擊很大，根據她的性格分析她的內心，可能是覺得「如果我不在這個世界上了、或者我從一開始就沒有出生，那麼父母是不是就不用操心、不用付出了？是不是她們會過得比現在更幸福呢？」\"),\"\\n\",Vue.h(_components.p,null,\"她的性格，天生就多愁善感，她有一顆細膩溫柔的心，在我眼裡，她是個善良過了頭的傻丫頭，寧願把錯誤歸結為自己的無奈，都不願意想是別人傷害了她。就像林妹妹的天生傷感，喜散不喜聚一樣：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「人有聚就有散，聚時歡喜，到散時豈不冷清？既冷清，則生感傷，所以不如到是不聚的好。比如那花，開時令人愛慕，謝時則增惆悵，所以到是不開的好。」\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"從很久之前，她就不想有這種親密關係，因為她害怕這種親密關係的消失。\"),\"\\n\",Vue.h(_components.p,null,\"她初中的時候成績不好，經常遭受霸淩；沒有來由的孤立和身體上的虐待，女孩子性格的她也不敢反抗，那個時候她曾有一段親密關係，那個人的家和她家很近，都在學校對面的居民區，也是那個時候為數不多願意和她一起玩的朋友。為了一起玩，那個時候她開始學習打籃球。然而這段親密關係的破碎是伴隨著校園暴力的，那個人也加入了欺負她的隊伍，那是她唯一一次反抗，哭著問：「你為什麼也要這樣對我。」\"),\"\\n\",Vue.h(_components.p,null,\"這樣一個性格的人，這段殘酷的人生經歷，巨大的創傷事件，對她傷害一定非常巨大，這段感情裡伴隨著親密關係的巨大傷害一直沒有被治癒，發展成為 \",Vue.h(_components.a,{href:\"https://zh.wikipedia.org/wiki/%E5%89%B5%E5%82%B7%E5%BE%8C%E5%A3%93%E5%8A%9B%E7%97%87\"},\"PTSD/PTSR\"),\"，所以她對親密關係很害怕，後來的其他精神失調疾病如重度抑鬱症和這段陰暗的人生經歷也無法脫開干係。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"我曾在她身邊目睹了她因為回憶起一些讓她難受的事情而軀體化障礙發作，全身肌肉痙攣，呼吸困難、恐懼、害怕、發抖。可是我是失職的，遲鈍的，我沒有意識到這種精神疾病的治癒困難和她的情況之糟糕，如果我在後面有意識到問題的嚴重性，也許事情就會有改變。\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"她性格裡遺傳了她父親偏執的一面，她爸爸以前為了讓她長個子，對她進行科學訓練，研究營養學，那個時候她也覺得長個子很好，就瘋狂地吃有利於長身高的食物。小柿子高中時就已經知道 HRT 了，但是一直在糾結要不要吃糖，那個時候為了減肥，也做到了極致，每天只吃一次，還大量運動。HRT 之後她就對過去科學訓練長身高的事很後悔，因為身高的問題而性別焦慮，這個對本來精神狀態就不好而且還偏執性格的她來說是非常痛苦的。\"),\"\\n\",Vue.h(_components.h2,null,\"跨圈的故事\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"（跨圈裡的故事很長，但是刪了細節後還是覺得不合適，就覺得還是\",Vue.h(_components.a,{href:\"https://www.douban.com/note/858246014/?dt_dapp=1&_i=4897516gLA6hO2\"},\"不放這裡\"),\"了比較好，畢竟是從我和她另外一個朋友的視角去看的）\")),\"\\n\",Vue.h(_components.p,null,\"進入跨圈最後的這段故事，我是親歷者，又是局外人，在最後，我是最有機會可以救她的一個人，可是我沒有做到，最後她走丟了，就像最後在她夢裡，找我的那通電話我沒有接通一樣。\"),\"\\n\",Vue.h(_components.p,null,\"這些故事不過是，一個從小就缺愛的善良的傻丫頭，不斷地給這個世界，她遇到的所有的人以她最大的善意，最大的信任。然後呢？被以開盒惡俗掛人迫害取樂的噁心順直人傷害到被害妄想。不斷的被最信任、最依賴的朋友所傳遞負面能量所影響，然後不斷地被切割，被疏遠，被背叛，被傷害。這條時間線上，本來有無數個轉捩點，本來一切都在慢慢變好的，可是運氣太差了。\"),\"\\n\",Vue.h(_components.p,null,\"我不是個對的人，我太麻木了，活在自己的世界，我在最後才知道一切，原來我對她原生家庭壓抑的環境，過往那些故事一無所知，我冷漠的心體會不到她的壓抑和痛苦。風起於青蘋之末，如果一開始把我換成另外一個性格的人，至少能察覺到種種異相，也許就不是這個結局。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「親愛的，別為愛情流淚」。\"),\"\\n\",Vue.h(_components.p,null,\"（出自李銀河編《關於情感的對話》）\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"在她眼裡我是個喜歡她的大姐姐，她太善良了，她深諳愛會有痛苦，不想傷害任何人，所以她給了我愛，一種複雜的愛，有純粹的愛情，姐妹親情，還有一直小心翼翼的保護，因為她知道自己受到很多別的 emo 跨性別的負面影響，所以不想把壞情緒傳染給我，就像她一直擔心她心裡掛念的那個人生存不下來一樣。\"),\"\\n\",Vue.h(_components.p,null,\"她對我有距離感，「安安姐是那種已經穩定工作的人，對這種看的開，談不談無所謂，不行就下一個」。錯誤的，小柿子，這個世界上沒有什麼比愛得到回應更幸福的事情了，你一直是我留戀的這個世界裡的遼闊的海和蔚藍的天。對不起，我忙著去生，忙著去死，卻沒有忙著抓住你的手，最後把你弄丟了。\"),\"\\n\",Vue.h(_components.h2,null,\"荒誕和自殺，最後的故事\"),\"\\n\",Vue.h(_components.p,null,\"上帝在擲骰子，不斷地擲出最差的點數。天生易感性，家庭環境的壓力，不斷遇到錯誤的人，一個接一個，沒有給她任何短暫喘息的機會。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"花原自怯，豈柰狂飆？柳本多愁，何禁驟雨？\"),\"\\n\",Vue.h(_components.p,null,\"——《芙蓉女兒誄》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"關於那些人，我不想在這裡留下更多文字了。人性雖然複雜，但卻總是有跡可循。她冰雪聰明，很有悟性，一開始她就懂的：\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「那紅塵中有卻有些樂事，但不能永遠依恃。況又有『美中不足，好事多魔』八個字緊相連屬，瞬息間則又樂極悲生、人非物換，究竟是到頭一夢，萬境歸空，倒不如不去的好。」\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"所以最後她只是無奈，想了很久很久，只是在等一個契機罷了。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"「隱痛深藏於人的內心深處，正是應該在人的內心深處去探尋隱痛。這死亡的遊戲是由面對存在的清醒，過渡到要脫離光明的逃遁。我們應該沿著這條線索去理解自殺。」\"),\"\\n\",Vue.h(_components.p,null,\"——卡繆《西西弗神話》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"很多哲學家、作家都可以很好地解釋人生存在的悲劇感，虛無和荒謬。每個人都是以自己為中心的無限大，在最本質的意義上是孤立的人，他者對自身的意志來說，總是虛無的，這麼看，人最核心的精神意志總是孤獨的。\"),\"\\n\",Vue.h(_components.p,null,\"人終其一生不過是在向世界祈求愛，但是失望總是常態，這個時候，人就看到了這個世界的雜亂無章和毫無意義，感受到這個世界站在希望的對立面，但人性裡有對愛，幸福理性這種美好東西的希望。荒謬感和無意義就產生於這種人性的呼喚和世界的不美好之間。意識到自己在忍受著這荒謬的世界，自殺的動機，就此開始在心靈深處醞釀成熟。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"一個人自願去死，則說明這個人認識到——即使是下意識地——習慣是可笑的，認識到人活著的任何深刻理由都是不存在的，就是認識到日常行為是無意義的，遭受痛苦也是無用的。\"),\"\\n\",Vue.h(_components.p,null,\"那麼，這種難以盡述的情感，這種使精神生活失去對它來說是必需的麻木的情感究竟是什麼呢？一個哪怕可以用極不像樣的理由來解釋的世界仍是人們感到熟悉的世界。\"),\"\\n\",Vue.h(_components.p,null,\"然而，一旦世界失去幻想與光明，人就會覺得自己是局外人。這一放逐是無可挽回的，因為他被剝奪了對失去的家鄉的記憶，而且喪失了對未來世界的希望。\"),\"\\n\",Vue.h(_components.p,null,\"人與他的生活之間的，演員與舞臺之間的這種分離，真正構成荒謬感。無須多加解釋，人們就會理解到：在所有健在而又已經想過要自殺的人身上，這種荒謬感與對虛無的渴望直接相關。\"),\"\\n\",Vue.h(_components.p,null,\"——卡繆《西西弗神話》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"自殺的起因是複雜的，很少有人深思熟慮而後自殺。麻木習慣的活著感到痛苦，但自殺需要莫大超越性的勇氣，身體抗拒死亡，刻在基因裡的生物本能，「我的靈魂已了無生機，但我的身體並不想死」，倘若這個時候還有點薄弱虛假的意義，也不會走向死亡。她曾經認為的「意義」在某一瞬間破滅了，曾經支撐她維持習慣的信念崩塌了。\"),\"\\n\",Vue.h(_components.p,null,\"卡繆對生活充滿愛戀，他留戀故鄉蔚藍的天空和遼闊的大海，所以他認識到荒謬後可以義無反顧的生活，他明知不能根除世上的邪惡而仍以西西弗上山的堅定步伐走向荒謬。但親愛的小柿子，這個世界上已經沒有她留戀的蔚藍的天和遼闊的海了。\\n這是一個怎麼樣的世界，才會讓人寧願去選擇自殺而不是尋找別的出路？何其荒謬。\"),\"\\n\",Vue.h(_components.p,null,\"最後她說，「人生在世不過吃喝玩樂性而已」，「世界孤立我任他奚落~」\"),\"\\n\",Vue.h(_components.p,null,\"最後她在《主播女孩重度依賴》玩出了一個期待的 bad ending，而後帶著對諸神賦予她命運的對抗，決絕地選擇了重歸於虛無。\"),\"\\n\",Vue.h(_components.p,null,\"糖糖可以在下一個周目重新開始，可是這個世界上，即使我窮極一生，都再也找不到那個小傻貓了。\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"洲迷聚窟，何來卻死之香？海失靈槎，不獲回生之藥。眉黛煙青，昨猶我畫。指環玉冷，今倩誰溫？\"),\"\\n\",Vue.h(_components.p,null,\"——《芙蓉女兒誄》\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"她走後的那天早上，外面飄起了漫漫的雪花，我想，這樣一個美好的人，是不是去了天上的那一顆星星，去做了掌管這人間冬月裡霜雪的仙子。\"),\"\\n\",Vue.h(_components.p,null,\"日本人愛把人生喻為櫻花，盛開了，很短暫，然後就調謝了。她的生命就像櫻花，盛開了，很短暫，然後就磕然凋謝。\"),\"\\n\",Vue.h(_components.p,null,\"三島由紀夫在《天人五衰》中寫過一個輪回的生命，每到 18 歲就死去，投胎到另一個生命裡。這樣，人就永遠活在 Ta 最美好的日子裡，不用等到牙齒掉了、頭髮白了，人變醜了，再悄然逝去。\"),\"\\n\",Vue.h(_components.p,null,\"小柿子就像這樣，櫻花雖然凋謝了，但它畢竟燦爛地盛開過。\"),\"\\n\",Vue.h(_components.p,null,\"我最親愛的小柿子，我們來世再見。到那時我肯定還有緣分再見到你，畢竟這輩子的因果交錯再也解不開了。我還很想問問你為什麼，可是再問一萬遍都沒有人會給我一個答案了。\"),\"\\n\",Vue.h(_components.p,null,\"條目貢獻：\",Vue.h(_components.a,{href:\"https://twitter.com/LianShihai\"},\"梨安\")),\"\\n\",Vue.h(Sakura,{count:\"50\"}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"