{
    "id": -4,
    "content": "    呐，不会写诗也不会鼓励别人，讲述一下自己的故事/发表一些评论好了。也许啰嗦了一点，写的也挺乱的，对不起了。我也没希望真的能上晚会，知道在某个时候，某个地方，有也许能理解我的人看到了这些文字对我而言就足够了。还有我可能太只顾着叙述真实感受了，在写的过程中自己精神崩溃了好几次，断断续续写了好几天，别人看了可能也会被触发吧。对不起了。\n    说到“现身”，其实我最初的经历并不是跟性别有关的吧。没办法，到青春期开始发育了之后我的性别认同跟我的指派性别并不一样这个issue才变得突出了起来吧。而我自幼就是明显的神经多样性。管他呢（恼），反正神经多样性和跨性别也有很多交集的地方，要是嫌跑题了把这段编辑掉好了，我觉得可以作为一个铺垫。\n    我从幼儿时期就「不一样」。最开始似乎一切都好，比如我不像autism spectrum容易语言迟缓之类的，反而学会说话比平均要早的多。然后大家对我的认识就打下了一个「神童」的基调。我很沉迷看书，小学就学了中学的东西，初中就学完了大学高数入门线性代数微积分一条龙（不过等到真上了大学差不多又全都忘了就是了（恼））。然后成绩严重偏科，比如说语文阅读这种我就是拼了老命也理解不了里面的人物都在干什么。我一直都是上课不听课，作业不认真写。如果一个普通的学生这样子ta早就被老师家长整死了，但是不管是老师，家长还是同学甚至其他人，评价都是一致的：“他聪明，不一样，反正他都会，管他干什么呢，你们不要跟他学就行了”。我被放到了一个pedestal上变成了一个“展示品?”了。我从来，到现在都不是某个集体的一员，最多只是一个“出于某种原因跟大家在一起混的人”而已。\n    而我即使得到了“这个人确实跟大家不一样”的承认，即使大家都承认我的才华，也一直没有人去celebrate我的独特作用。我一直都背负着去“融入社会”的负担。比如我小学的时候经常在椅子上来回晃，或者无意义地重复一些随机的词句，然后老师就去找我母亲，认为我是“多动症”。她还带我去医院看过，当然什么结果都没有。然后就是我一生的噩梦的一大开始。当时我还小，当时我母亲就咬定这些特征都只是注意一下就可以改掉的坏习惯，到现在也没有表示过歉意。我不记得我因为这种原因被各种暴力过多少次。也许这样也好，certain things are probably best left forgotten. \n    然后就这样子，我上了一个普通的大学。我也许本可以考的更好的，但是这个问题现在已经是应该moot point了不是吗。而且如果我去了另外一个地方我也不会遇到她。当时我抱着我网购的打印版《The art of computer programming》往宿舍走，然后在蜜雪冰城停了一下。她刚好路过，看到我抱着四大本出奇的厚的英文原版书就上来搭话了，然后我们就留了联系方式。我一直好奇我为什么没有在之前注意到我们班里面有一个这样一个人？是我的潜意识敏锐的看到了它知道我还没有准备好接受的东西吗？我为什么没有对一个留着长头发的“男生”感到一点“不自然感”？\n    我们第一次聊天她就很直白的告诉了我她是跨性别，“mtf”。我没有思考，本能的就向一个我刚认识的人袒露了我到当时内心最大的秘密:\n    “我觉得我也有这种倾向”\n    我是如此的渴望一个吐露自己的心声的机会。\n    然后我快速补了一句：\n    “但是我觉得我不是真的跨性别”\n    Not so fast.\n    I wasn’t ready to admit it, not yet.\n    但是虽然这么说，我在坐立不安了几天之后还是做出我这辈子最bold的move。当时我还没有推特，我把我的GitHub头像加上了蓝粉白旗。\n    然后我的人生就天翻地覆了，但是这也是一个大家都听过了的故事吧。我学会上推特了，我学会买糖了，我学会od自残了，我学会了一个刻板印象小药娘的所有技能。我开心过，我绝望过，我魔怔过，我现在也许清醒了。Truth be told，万恶的MECT让我忘掉了这段时间发生过的很多事情。也许这样也好。Anyway，以此作为一个背景，我来叙述一些印象深刻的事情吧。\n    当时我认识她了之后，我跟我母亲闲聊的时候跟她介绍了一下。我母亲并没有多大的反应，她只觉得这是一个与自己无关的猎奇现象吧。就像我一直能体会到我被隔离与community之外一样，我能体会到我的这位朋友的存在也被我母亲安全的隔离在她对这个世界的认知之外。只是一个极端个例而已，在太阳底下除了这种奇葩每个人都是一样的，顺性别，神经典型，热爱正能量，天天积极向上，是这个社会的productive member。“社会，本分，稳定。”七十二个一模一样的人操作着七十二台一模一样的机器。这就是现在这个monolithic的社会的真实写照不是吗。\n    But I digress。然后过了几天我的本能驱使我直接把柜门砸碎了，没办法，我只能压抑自己到那个程度。For a while，我的父母并没有多大反应，我甚至还以为我抽到了罕见的家长党。然后这个事实算是sunk in了吧。\n    然后as they say: “solve lora infernis!”\n    当然，我是在这一切的receiving end上。\n    我并不记得这一切的具体经过发展之类的了。也许这样也好。我也没有把自己的这种遭遇叙述一遍的必要，被家长迫害的例子大家都司空见惯了。然后在这段历史的结尾和高潮，我被送进了精神病院，并在那里呆了差不多两个半月。（对，我估计就凭这个经历你也许就能猜到我其实是谁了）\n    我不想回忆我在精神病院的遭遇。这个对我有点太traumatic了。我只能说他们对于一个其实根本就没有精神病的人的对待就是appalling吧，特别是老是拖着不让我出院。我有的时候还能crack a joke about it，但是其实我做噩梦都不敢再回去了。\n    然后怎么说呢，住院的时候远离了家庭我的精神状态算是稍微恢复了一点吧。然后我回家就得到了一个开幕雷击：趁我不在的时候我母亲把我的房间全部扫荡了一遍，所有能与我的性别认同扯上一点关系的东西都被仔细清除了，除了她没有密码不能把我的笔记本桌面换掉之外，连笔记本上面的贴纸都没能幸免。“要有一个新的开始”她自豪的告诉我，就像2BR02B里的Dr.Hitz一样。“我觉得没用”是我质问她的时候得到的唯一一个nonchalant的回复。“没用”。七十二个一模一样的人有着七十二个一模一样的需求。这就是现在这个社会的假设，不是吗？对于我没有用的东西对于你也没有用，我们都长着一样的脸，一样的心，按照一样的感官和价值观去选择对错。\n    当然之后我精神状态又撑不住了，当然之后我又自杀了，还不止一次。当然这些都是我自找的，我只是一个和“普通人”一样千人一面的机器，不是吗？既然一个大街上的“普通人”没有被“性别焦虑”“阿斯伯格”这种东西困扰，我又怎么会呢？何况我还是一台聪明的高质量机器，我的命运已经被preordinate了不是吗？像一台机器一样去学习，像一台机器一样去工作，结婚生子，光宗耀祖。这也是我父亲到现在最不能释怀的地方吧。我是他的“儿子”，我应该继承他的意志，我本可以成为一个根植农村的宗族的骄傲。然后我变成一个“人妖”了，一个耻辱。我跟他最后一次见面的时候他还在劝我“你真的应该悬崖勒马”。我听不下去起身走开了，然后就没有然后了。我的父母成长于那样的环境之中，他们除了conformity之外什么也不知道不是吗。他们只会用他们认知范围中的“交了恶友受了不良影响”来解释这一切。我的情感希望他们下地狱，我的理性希望他们一生平安。\n    “The road to Hell is paved with good intentions.”，不是吗？\n    “Jesus said, ‘Father, forgive them, for they do not know what they are doing.’ And they divided up his clothes by casting lots.”\n    怎么说呢，这也就是存在TDoV这样的celebration的意义吧。如果我们可以勇敢的站出来，展现出自己真实的样子，展现出这个世界除了normativity和conformity之外还有我们这些虽然少数，但是确实存在，也确实不一样，也应该被承认被平等对待的少数群体的真实的样子。我们不能永远在阴影里指望运气和有人发善心生存。也许有一天，我应该看不到的一天，会有一个跟我一样独特的人得到她应有的人生。\n    “alteri vivas oportet, si vis tibi vivere.”\n    “deus est mortali iuvare mortalem, et haec ad aeternam gloriam via.”\n    就写到这里吧。\n    2024年3月27日，Ellie。",
    "submitter": "Ellie",
    "date": "Mar 31, 2024"
}