"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",em:\"em\",blockquote:\"blockquote\",br:\"br\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,'Arita is a kind and beautiful \"big sister.\" She majors in architecture and urban planning, a field the author once dreamed of pursuing as a child. In addition to architectural design, she has a deep love for painting and is quite talented. Her camera is filled with a variety of photos, further reflecting her artistic nature. Arita also has a keen interest in makeup and fashion. According to a friend, she recommends many lesser-known but high-quality cosmetic brands on Xiaohongshu. She favors rose-colored lipstick and rose-scented perfume and often lights scented candles in her room. She strikes me as someone who truly enjoys life. Her friends describe her personality as similar to the author\\'s. At first glance, she may come across as soft-spoken and reserved, often \"sitting quietly in the corner,\" but she is deeply protective of those close to her. She is unafraid to share her views on various aspects of life with those she trusts and desires a partner who can stand beside her to face the world together.'),\"\\n\",Vue.h(_components.p,null,'Arita\\'s favorite band is Soda Green. In fact, Wu Qingfeng, the frontman of Soda Green, is often noted for his unique and unconventional gender expression. One of Arita\\'s favorite songs is \"Singing with You\": \"I can ride my imagination in your direction/Let the invisible me lean beside you and sleep so sweetly/Let the invisible you walk into my dreamland and sing with me.\" It is a song that brings comfort. Arita also enjoys TVB shows and British dramas, particularly fond of British actors James McAvoy and Carey Mulligan. She has watched almost all of Shunji Iwai\\'s films. The name \"Arita\" is likely derived from one of Iwai\\'s short films. The author later began watching movies from Arita\\'s Douban list, almost feeling as though watching them together. Sometimes I imagine other things we could do, like cooking a hot pot at home, reading novels, discussing urban studies, or even traveling to the Scottish Highlands. I even fantasize about asking her for advice on my transition (laughs).'),\"\\n\",Vue.h(_components.p,null,\"Arita occasionally struggles with depression. As she has mentioned, when she's feeling down, she often turns to reading Dazai Osamu's \",Vue.h(_components.em,null,\"Indignation in the World\"),\" to release her sadness through its resonance, before gradually healing. She tends not to share her negative emotions publicly, preferring to confide in friends privately or process them alone. A few months before her passing, her roommates noticed some changes in her behavior, but perhaps they didn't have the time or awareness to react. Shortly after her graduation photos were taken, she chose to leave us due to some currently unknown circumstances.\"),\"\\n\",Vue.h(_components.p,null,\"Despite all of this, the author never personally interacted with Arita. She was an international student at my school, in the same year as me. One August day, when I was struggling with my thesis and dealing with a failing relationship, I was in a deep state of sadness. A Chinese netizen shared a missing person notice about her. At the time, I didn't pay much attention to it—there were too many things demanding my focus—but something about the description made me uneasy. Later, after I moved into a new apartment, another female roommate casually mentioned that her previous roommate had passed away. I thought about it for a while and suddenly realized the connection. I searched for the notice and discovered that the WeChat ID listed belonged to my new roommate. I was shaken and couldn’t calm down for the rest of the day. Perhaps it was fate—a strange coincidence. It felt as though I had calculated that if I were to die on May 13, 2027 (her birthday), I would always be one day younger than her.\"),\"\\n\",Vue.h(_components.p,null,\"After Arita's death, the police sealed her phone as evidence, which meant that her friends in China weren't notified. Eventually, I was the one who had to deliver the painful news to her friends. Writing the post on Weibo was excruciating, and it often comes across as cold and stiff when I read it now. Arita's ex-boyfriend had planned to send her Soda Green's remastered new album, but after being unable to contact her for more than six months, he and I communicated sporadically through Weibo. He and Arita had lived together in Chengdu, but their contact had gradually faded over the years due to the distance. Perhaps Arita had always been the one he truly cared about. His final request was to visit her grave, but for now, that wish could not be fulfilled. Another friend asked me to send a bouquet of roses to her, and on the first anniversary of her passing, I delivered the flowers to the place where she died. I also ordered a strawberry cake for her on what would have been her 30th birthday.\"),\"\\n\",Vue.h(_components.p,null,\"Unexpectedly, my new roommate and I became very close because of Arita. When I first asked her to join me for a meal, she was open about it, and we began spending time together. Neither of us was in a great mental state, but we found warmth in each other's company. We almost couldn't stay together and had considered returning to China, to the point where I jokingly referred to the apartment as a \\\"hospice care center\\\" (laughs).\"),\"\\n\",Vue.h(_components.p,null,\"Arita holds a very special place in the author's heart. She was someone the author truly admired. Before, I asked Arita's ex-boyfriend if he would mind if I said I loved Arita, and he assured me he wouldn't. Although my gender is listed as female on Weibo, he knew I was transgender, and he offered many encouraging words. I am truly grateful for his kindness.\"),\"\\n\",Vue.h(_components.p,null,\"Sister, I hope we will meet one day. As the heroine in \",Vue.h(_components.em,null,\"The Phantom Thread\"),' said at the end of the film: \"...He is still waiting for me somewhere in the sky. This life, the next, and the next after that. No matter where my destiny leads me, as long as I stay patient, I will return to him.\" I believe I can do the same. I\\'m here. Wait for me.'),\"\\n\",Vue.h(_components.p,null,\"Let me end with a poem by Yeats, \",Vue.h(_components.em,null,\"Haters of the Wind\"),\":\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I became a rush that horses tread:\",Vue.h(_components.br),\"\\n\",\"I became a man, a hater of the wind,\",Vue.h(_components.br),\"\\n\",\"Knowing one, out of all things, alone, that his head\",Vue.h(_components.br),\"\\n\",\"Would not lie on the breast, or his lips on the hair\",Vue.h(_components.br),\"\\n\",\"Of the woman that he loves, until he dies;\",Vue.h(_components.br),\"\\n\",\"Although the rushes and the fowl of the air\",Vue.h(_components.br),\"\\n\",\"Cry of his love with their pitiful cries.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/image0.webp\"]}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"