"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",blockquote:\"blockquote\",br:\"br\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Arita 是個溫柔可愛的大姐姐，她所學專業是建築/城市規劃，其實也是筆者小時候非常嚮往的專業呢。除了建築設計之外她也非常喜愛和擅長繪畫，還有一台堆滿了各種照片的相機，是一位很有藝術天賦的人呢。Arita 同樣很了解化妝和穿搭，據我的朋友說她會在小紅書上推薦很多冷門但品質出色的化妝品品牌。她偏愛玫瑰色的口紅和玫瑰味道的香水，房間裡有時會點上香氛蠟燭，看起來是個很熱愛生活的人呢。據她的朋友說據她的朋友說她的性格類型和筆者有些相似，給人的第一印像是說話聲音輕柔，“總是安靜地坐在角落裡”，但對親密的人佔有欲很強，會願意在他們面前對世界上的許多事情表達自己的觀點，想要一位可以攜手對抗世界的戀人。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 最喜歡的樂團是蘇打綠，其實蘇打綠的核心人物吳青峰也是一位常被認為性別表達非常規的歌手。她很愛的一首歌是《陪你歌唱》：“朝你的方向能夠乘著想像/讓隱形的我傾在你身旁睡得多香/讓隱形的你走進我夢鄉陪我歌唱” ，是相當能給人安慰的一首歌呢。Arita 也對 TVB 和英劇感興趣，喜歡兩位英國演員 James McAvoy 和 Carey Mulligan。她也看過岩井俊二的幾乎所有電影，Arita 這個暱稱應該就是來自岩井的某部短片。筆者後來開始看她豆瓣影視清單上的標記的影片，就好像是和她一起看一樣，現在已經差不多看完了。有時筆者也會幻想可以和 Arita 一起做的其他事情，比如說一起在家做飯煮火鍋，讀小說，討論我們共同感興趣的關於城市研究的學術話題，或者一起去蘇格蘭高地旅遊，再或者讓她為我 transition 提供建議（笑）\"),\"\\n\",Vue.h(_components.p,null,\"Arita 有時候也會受到憂鬱問題的困擾，據她自己講有時候心情不好索性就會去讀太宰治的《​​人間失格》，讓悲傷的情緒在共振中先得到釋放再慢慢回复。她不常在公共網路上展現自己的負面情感，更願意和朋友私下傾訴或獨自消化。其實在 Arita 離世的幾個月前她的室友已經察覺到一些異樣，但可能大家並沒有來得及對此做出反應。在拍攝了畢業照之後幾天，因為一些目前尚不清楚的事件，她最終選擇了離開我們。\"),\"\\n\",Vue.h(_components.p,null,\"說了這麼多，但其實筆者並沒有真正和 Arita 本人交流過。Arita 是和我同校同級的留學生，在我著急寫論文又人際關係破裂的非常抑鬱的 8 月份的一天，國內的網友給我轉發了關於她的尋人啟事，當時我也沒有在意這條訊息，畢竟需要在意的事情太多了，但就是看描述讓我預感很不好。後來我搬了新家，另一位女生室友外出剛回來和我以及兩個男生開會的時候突然提到她之前的室友去世了，我想了幾分鐘突然意識到了什麼，然後直接去搜索了那條尋人啟事裡的微訊號──就是我的新室友。我當時真的過了一天心情都沒有平復，也許這就是有某種宿命般的巧合在裡面，就好像我後來算過如果我在 2027 年 5 月 13 日去死（也就是她的生日）我就會永遠比她小一天一樣。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 離世後她的手機作為證物被警方封存，因此沒有人通知她在國內的朋友，最終反倒是我成了那個向她的朋友們公佈死訊的最不討喜的人，當時自己在微博打字的時候痛苦得不行，讀起來反而常常顯得冰冷僵硬。Arita 的前男友本來想寄給她蘇打綠重製的新專輯，但半年多一直無法聯繫到她。我和他在微博上斷斷續續交流了幾個月，他和 Arita 曾經一起在成都生活，幾年前因為異地而逐漸失去了聯繫，但也許 Arita 一直還是他真正喜歡的人。他最後的請求是去探訪 Arita 的墓地，但這個心願至少暫時還無法滿足。Arita 的另一位朋友希望我為她送一束玫瑰花，我在一周年忌日那天把花送到了她去世的地點。其實在她 30 歲生日的時候我還幫她訂了一個草莓蛋糕呢。\"),\"\\n\",Vue.h(_components.p,null,\"可能也有點意外的是，由於她的緣故我和我的新室友成了很好的朋友，事實上我第一次還是第二次找室友約飯的時候她在回家的路上直接問我是不是跨性別，然後我們兩個精神狀態都不算很好的人就一起抱團取暖了一年，差點一起待不下去了回國，以至於我開玩笑說那個房子是臨終關懷中心（笑）。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 對筆者來說是有著許多特殊意義的人，也完全可以說，是我一直愛著的人。我之前問過 Arita 的前男友，如果我說我愛 Arita 他會不會生氣，他說並不會。雖然我微博性別是女但是聊天過程中他也知道我是跨性別，並且還說了很多鼓勵我的話，真的很感謝他。\"),\"\\n\",Vue.h(_components.p,null,\"姐姐，希望我們最後總有一天會見面的，不是嗎，就好像《魅影縫匠》裡的女主角在片尾說的那段話：「...他仍然在天上的某個地方等待著我，今生，來生，來生之後還有來生，不管從現在起命運的道路將會把我帶向何方...只要我保持耐心，就一定能再次回到他的身邊。到的，等著我哦。\"),\"\\n\",Vue.h(_components.p,null,\"最后以叶芝的一段诗歌结尾吧，haters of the wind.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I became a rush that horses tread:\",Vue.h(_components.br),\"\\n\",\"I became a man, a hater of the wind,\",Vue.h(_components.br),\"\\n\",\"Knowing one, out of all things, alone, that his head\",Vue.h(_components.br),\"\\n\",\"Would not lie on the breast or his lips on the hair\",Vue.h(_components.br),\"\\n\",\"Of the woman that he loves, until he dies;\",Vue.h(_components.br),\"\\n\",\"Although the rushes and the fowl of the air\",Vue.h(_components.br),\"\\n\",\"Cry of his love with their pitiful cries.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/image0.webp\"]}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"