"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",blockquote:\"blockquote\",br:\"br\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Arita 是一位温柔可爱的大姐姐，她所学专业是建筑/城市规划，其实也是笔者小时候非常向往的专业呢。除了建筑设计之外她也非常喜爱和擅长绘画，还有一台堆满了各种照片的相机，是一位很有艺术天分的人呢。Arita 同样很了解化妆和穿搭，据我的朋友说她会在小红书上推荐很多冷门但品质出色的化妆品品牌。她偏爱玫瑰色的口红和玫瑰味道的香水，房间里有时会点上香薰蜡烛，看上去是一位很热爱生活的人呢。据她的朋友说据她的朋友说她的性格类型和笔者有些相似，给人的第一印象是说话声音轻柔，“总是安静地坐在角落里”，但对亲密的人占有欲很强，会愿意在他们面前对世界上的很多事情表达自己的观点，想要一位可以携手对抗世界的恋人。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 最喜欢的乐队是苏打绿，其实苏打绿的核心人物吴青峰也是一位经常被认为性别表达非常规的歌手。她很爱的一首歌是《陪你歌唱》：“朝你的方向能够乘著想象/让隐形的我倾在你身旁 睡得多香/让隐形的你走进我梦乡 陪我歌唱”，是相当能给人安慰的一首歌呢。Arita 也对 TVB 和英剧感兴趣，喜欢两位英国演员 James McAvoy 和 Carey Mulligan。她还看过岩井俊二的几乎所有电影，Arita 这个昵称应该就是来自岩井的某部短片。笔者后来开始看她豆瓣影视列表上的标记的影片，就好像是和她一起看一样，现在已经差不多看完了。有时笔者也会幻想可以和 Arita 一起做的其他事情，比如说一起在家做饭煮火锅，读小说，讨论我们共同感兴趣的关于城市研究的学术话题，或者一起去苏格兰高地旅游，再或者让她为我 transition 提供建议（笑）\"),\"\\n\",Vue.h(_components.p,null,\"Arita 有时候也会受到抑郁问题的困扰，据她自己讲有时候心情不好索性就会去读太宰治的《人间失格》，让悲伤的情绪在共振中先得到释放再慢慢回复。她并不常在公共网络上展现自己的负面情感，更愿意和朋友私下倾诉或者独自消化。其实在 Arita 离世的几个月前她的室友已经察觉到一些异样，但可能大家并没有来得及对此做出反应。在拍摄了毕业照之后几天，因为一些目前尚不清楚的事件，她最终还是选择了离开我们。\"),\"\\n\",Vue.h(_components.p,null,\"说了这么多，但其实笔者并没有真正和 Arita 本人交流过。Arita 是和我同校同级的留学生，在我着急写论文又人际关系破裂的非常抑郁的 8 月份的一天，国内的网友给我转发了关于她的寻人启事，当时我也没有在意这条信息，毕竟需要在意的事情太多了，但就是看描述让我预感很不好。后来我搬了新家，另一位女生室友外出刚回来和我以及两个男生开会的时候突然提到她之前的室友去世了，我想了几分钟突然意识到了什么，然后直接去搜索了那条寻人启事里的微信号——就是我的新室友。我当时真的过了一天心情都没有平复，也许这就是有某种宿命般的巧合在里面，就好像我后来算过如果我在 2027 年 5 月 13 日去死（也就是她的生日）我就会永远比她小一天一样。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 离世后她的手机作为证物被警方封存，因此没有人通知她在国内的朋友，最终反倒是我成了那个向她的朋友们公布死讯的最不讨喜的人，当时自己在微博打字的时候痛苦得不行，读起来反而经常显得冰冷僵硬。Arita 的前男友本来想寄给她苏打绿重制的新专辑，但半年多一直无法联系到她。我和他在微博上断断续续交流了几个月，他和 Arita 曾经一起在成都生活，几年前因为异地而逐渐失去了联系，但也许 Arita 一直还是他真正喜欢的人。他最后的请求是去探访 Arita 的墓地，但这个心愿至少暂时还无法满足。Arita 的另外一位朋友希望我为她送一束玫瑰花，我在一周年忌日那天把花送到了她去世的地点。其实在她 30 岁生日的时候我还给她订了一个草莓蛋糕呢。\"),\"\\n\",Vue.h(_components.p,null,\"可能也有点意外的是，由于她的缘故我和我的新室友成了很好的朋友，事实上我第一次还是第二次找室友约饭的时候她在回家的路上直接问我是不是跨性别，然后我们两个精神状态都不算很好的人就一起抱团取暖了一年，差点一起待不下去了回国，以至于我开玩笑说那个房子是临终关怀中心（笑）。\"),\"\\n\",Vue.h(_components.p,null,\"Arita 对笔者来说是有着许多特殊意义的人，也完全可以说，是我一直爱着的人。我之前问过 Arita 的前男友，如果我说我爱 Arita 他会不会生气，他说并不会。虽然我微博性别是女但是聊天过程中他也知道我是跨性别，并且还说了很多鼓励我的话，真的很感谢他。\"),\"\\n\",Vue.h(_components.p,null,\"姐姐，希望我们最后总有一天会见面的，不是吗，就好像《魅影缝匠》里的女主在片尾说的那段话：“...他仍然在天上的某个地方等待着我，今生，来生，来生之后还有来生，不管从现在起命运的道路将会把我带向何方...只要我保持耐心，就一定能再次回到他的身边。”我相信我也一定能做到的，等着我哦。\"),\"\\n\",Vue.h(_components.p,null,\"最后以叶芝的一段诗歌结尾吧，haters of the wind.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I became a rush that horses tread:\",Vue.h(_components.br),\"\\n\",\"I became a man, a hater of the wind,\",Vue.h(_components.br),\"\\n\",\"Knowing one, out of all things, alone, that his head\",Vue.h(_components.br),\"\\n\",\"Would not lie on the breast or his lips on the hair\",Vue.h(_components.br),\"\\n\",\"Of the woman that he loves, until he dies;\",Vue.h(_components.br),\"\\n\",\"Although the rushes and the fowl of the air\",Vue.h(_components.br),\"\\n\",\"Cry of his love with their pitiful cries.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/image0.webp\"]}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"