"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Mizuki was a very cheerful, optimistic, and caring non-binary person.\\nThey neither went on HRT nor clearly identified with either gender.\"),\"\\n\",Vue.h(_components.p,null,\"After graduating from college, Mizuki worked for an e-commerce company but was laid off following the 2022 epidemic in Shanghai.\\nThey had a strained relationship with their family which made surviving after the layoff even more difficult.\"),\"\\n\",Vue.h(_components.p,null,\"I met Mizuki at a dinner party during the National Day holiday.\\nAs fellow Kigurumi enthusiasts, Mizuki and I, along with other friends, participated in various events such as the Shanghai Halloween, Shanghai-Saudi cultural exchanges, and several private and scheduled photo shoots, creating splendid memories.\"),\"\\n\",Vue.h(_components.p,null,\"At the moment the photo was taken, it transcended mere photography.\\nMy heart was filled with endless mourning and sorrow.\"),\"\\n\",Vue.h(_components.p,null,\"In early December, when Mizuki got their first Kigurumi headpiece, they were overjoyed and felt liberated.\\nThree days later, I invited them for an outdoor photoshoot in Century Park – my first outdoor photoshoot.\"),\"\\n\",Vue.h(_components.p,null,\"After this photoshoot, Mizuki organized a Kigurumi party and travelled twice: one to Kuala Lumpur before Christmas, and another to Hong Kong after New Year's Day.\\nThey were not fond of travelling, so that was a bit surprising.\"),\"\\n\",Vue.h(_components.p,null,\"Then they left this world.\\nPerhaps it was financial troubles that overwhelmed them, or maybe they had fulfilled all their wishes.\"),\"\\n\",Vue.h(_components.p,null,\"According to their close friends, Mizuki had already attempted suicide twice. Although dissuaded before, they carried out their third attempt before the scheduled message was sent.\\nRegrettably, no one was aware of it.\\nBy the time I confirmed the news, it was already noon the next day — Mizuki had passed away on January 10, 2024, leaving us forever.\"),\"\\n\",Vue.h(_components.p,null,\"I regret not taking more photos of them.\\nTheir smile and sincere friendship will always be unforgettable.\"),\"\\n\",Vue.h(_components.p,null,\"I hope they have found a world free of pain, a future full of colour.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\",\"${path}/photos/photo3.webp\",\"${path}/photos/photo4.webp\",\"${path}/photos/photo5.webp\",\"${path}/photos/photo6.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: \",Vue.h(_components.a,{href:\"https://twitter.com/NNGnoMKT\"},\"NNG\")))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"