"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",strong:\"strong\",blockquote:\"blockquote\",h3:\"h3\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"Xu Yushu is a trans girl from Chongqing, China.\"),\"\\n\",Vue.h(_components.p,null,'Xu Yushu was seen as a \"genius boy\" by others.\\nShe was in ',Vue.h(_components.em,null,\"Jingmen Evening News\"),\" once as \",Vue.h(_components.em,null,\"The Child Who Skipped Kindergarten\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"Although, maybe such fame isn't what's important about her.\\nWhat'd important is her having a precious and unique heart of gentleness and sensitivity.\\nShe had the drive to express her feelings through words.\\nMaybe it's more accurate to describe her as \",Vue.h(_components.em,null,\"literary girl\"),\".\"),\"\\n\",Vue.h(_components.h2,null,\"Her Interests and Ambitions\"),\"\\n\",Vue.h(_components.p,null,'One of Xu Yushu\\'s ambitions is to be accepted by the people around her as a \"real\" girl.'),\"\\n\",Vue.h(_components.p,null,\"Xu Yushu had always been a lonely child, but she made friends with books.\\nReading made her mature faster than her peers.\\nShe loved being immersed in the world of books.\\nHer bookshelf was filled up already at that time.\\nNot only that, she also went to the bookstore next to her father's workspace and left a deep impression on the bookstore's manager.\"),\"\\n\",Vue.h(_components.p,null,\"During her high school years, Nan'an Wanda Plaza's Sisyphe Books was one of the places she went to the most.\\nThere, she could find tranquility in the pleasant smell of coffee and books.\"),\"\\n\",Vue.h(_components.p,null,'She loved writing, and was once elected as the president of Chongqing No.2 Foreign Language School Nanlu Literary Club.\\nIn one of her writings, she wrote \"Real writing is offering the writer themselves to Goddess Muses\\'s sacrificial altar.\"'),\"\\n\",Vue.h(_components.p,null,\"Because of her depression and gender dysphoria, her grades dropped a bit, but she still longed to get into Peking University or Beijing Normal University's Department of Chinese Language and Literature.\"),\"\\n\",Vue.h(_components.p,null,\"Aside from being interested in literature and history, she liked anime, and was always happy to share her insights about it with others.\"),\"\\n\",Vue.h(_components.h2,null,\"Her Story\"),\"\\n\",Vue.h(_components.p,null,'As early as her third year during elementary school, Xu Yushu had the dream of becoming a girl.\\nAs soon as she found out she started to exhibit male pattern secondary sexual characteristics, she locked herself in her room and cried for a whole day, not willing to check in the mirror.\\nWhen she reached her sixth year, many classmates bullied her because she was different from others.\\nHer father told her: \"This world needs tolerance. Because there are so many idiots in this world, your excellence is made more dazzling.\"'),\"\\n\",Vue.h(_components.p,null,'She had a thick notebook for her elementary school classmates, but only a handful pages were filled in the end.\\nThere were lots of words of bullying in them.\\nShe wrote three pages at the end herself \"Xu Yushu 1\", \"Xu Yushu 2\", and \"Xu Yushu 3\".\\nIn these pages, she wrote \"Kill ',Vue.h(_components.strong,null,\"him\"),\", find \",Vue.h(_components.strong,null,\"her\"),\".\\\"\\nAt this point, she's already strongly against identifying as her assigned gender.\"),\"\\n\",Vue.h(_components.p,null,\"After entering her second year of junior high school, her mental state started to worsen.\\nAlthough her mother suggested her to take a year off, her father disagreed and blamed her.\\nShe wasn't able to bravely express herself.\\nAfter some time, she had a suicide attempt at school but no one cared.\"),\"\\n\",Vue.h(_components.p,null,\"At the New Year's party of her first year in senior high school, although she didn't have a role in the show, she still prepared her best and wore red dress and cute shoes.\\nThose shoes were a bit uncomfortable, yet she persisted to be the self she liked.\"),\"\\n\",Vue.h(_components.p,null,\"During the New Year celebrations of 2018, she wrote down her mental struggles in \",Vue.h(_components.em,null,\"Living with Depression 1\"),\".\\nAlthough her teacher told her she thought too much, they still praised her bravery to face the struggles that come with life, and suggested Shi Tiesheng's works.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/composition.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Xu Yushu later was hospitalized for her depression.\\nShe told her mother during that time something horrible and illegal happened in school.\\nHowever, when her mother asked her if they should report it to the police, she hesitated.\\nHer mother was afraid of interfering with her depression treatment and didn't continue to ask her about it.\\nAfter reviewing the chat history, it was clear that she might've already been sexual assaulted multiple times.\"),\"\\n\",Vue.h(_components.p,null,\"While she was hospitalized, she wrote \",Vue.h(_components.em,null,\"Living with Depression 2\"),\".\\nThe preface: \\\"My only hope is the few little boxes of meds. They're my life-saving straw...(The little pills) are like eyes of a sunset. This light is so easily perishable, but I decided on it anyway. Although I know this means giving up any chance of exit.\\\"\\nSometimes she compares it to Pandora's box.\\nShe wrote: \\\"I know it's prohibited, but I still long for the hope found in these boxes.\\\"\\nShe's already started DIY HRT by then.\"),\"\\n\",Vue.h(_components.p,null,\"February 2019, she went to the northeastern area all alone.\\nShe left a letter to her family:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Sorry about the sudden departure.\\nDon't miss me.\\nI don't have the ability to feel beauty, even if I know they do exist in my life.\\nIt's been tiring to pretend to have it.\\nI've been living my life just waiting for the next day while doing nothing but to pass the time.\\nI don't want to live this way.\\nSo I'm on a journey to look for something.\\nDon't look for me.\\nI love you.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"She planned to attend a comic con during the trip but didn't succeed in the end.\"),\"\\n\",Vue.h(_components.h2,null,\"Her Departure\"),\"\\n\",Vue.h(_components.p,null,\"She gave a hug to her mother one week before she left.\"),\"\\n\",Vue.h(_components.p,null,'In an afternoon of November 12th, 2023, she and her classmates gathered to watch gaming videos. She told one of her classmates: \"This might be the last time we watch videos together.\"\\nNo one thought she was hinting at her death.\\nOn the same day, she said she\\'s already been \"socially dead\".\\nMaybe it\\'s because she commonly used meaningful words, so no one thought of any further of it, too.'),\"\\n\",Vue.h(_components.p,null,\"Dawn November 13th, 2023, she ended her young and vibrant life, and left her will:\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/will.webp\"]}),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"My soul will fly to Geladaindong Peak.\\nI once said Tibet is where young people interested in literary accept the spiritual baptism, but I really want to go there.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"After Her Departure\"),\"\\n\",Vue.h(_components.h3,null,\"Related Reports\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"Life Week\"),\" reported her story reasonably accurately.\\nThey mourned for her and her talent.\\nThey described her internal struggles realistically.\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"Si Ruiming Mental Health\"),\" and the like tried to raise awareness of depression in teenagers.\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"Shandong Rainbow Talk\"),\" and other voices focusing on transgender people mourned for Xu Yushu and tried to raise awareness of the science of being transgender.\"),\"\\n\",Vue.h(_components.h3,null,\"About Her Family\"),\"\\n\",Vue.h(_components.p,null,\"Xu Yushu's father actively communicated with her former classroom teacher about her bullying, and been trying to raise awareness of bullying ever since she left.\\nAfter going through his memory of her growth, he thought: \\\"Since she's always been outstanding, she was the target of jealousy and bullying. The grades-only educational environment didn't help; her genius wasn't developed Therefore, her started to fall into depression and suicide.\\\"\"),\"\\n\",Vue.h(_components.p,null,'When Xu Yushu\\'s doctor gave her a diagnosis of \"Gender Dysphoria\", he only said: \"This isn\\'t important right now. Sex is something that people do to lengthen their bloodline. We should only consider it when you\\'re getting married. We are not considering that right now. Now it\\'s the time to study.\"\\nAfter listening to the advice of the doctor, he told Xu Yushu \"Try to forget it, don\\'t let it take the center of your attention.\"'),\"\\n\",Vue.h(_components.p,null,'Xu Yushu\\'s father actually always tried to understand Xu Yushu.\\nHe learnt psychology in university but was never taught anything about gender.\\nHe didn\\'t think his child really had gender dysphoria.\\nHe said Xu Yushu \"never had any weird behaviors\" at home,\\n\"didn\\'t cry for feminine clothing or wigs\", and was only wanting to be a girl because she wanted to have people to protect her from all that bullying,'),\"\\n\",Vue.h(_components.p,null,\"After her departure, her father still used male pronouns to refer to Xu Yushu, and seldom talked about her desire of being a girl.\\nObviously, Xu Yushu's father didn't have an accurate grasp of knowledge about gender (maybe because the textbook he read were outdated, maybe because he doesn't want to believe his child is transgender), and he didn't realize gender dysphoria was a major part of Xu Yushu's pressure.\\nWhile she needed support from her family the most, he failed as a core family member.\"),\"\\n\",Vue.h(_components.p,null,\"Although her parents didn't completely understand her and her anxiety within her, they still took her to see doctors with formal trainings, and gave her a certain amount of care.\\nMaybe in another world, she would've persisted to walk through the darkness and walk toward her ambitions again.\"),\"\\n\",Vue.h(_components.h3,null,\"About Her Friends\"),\"\\n\",Vue.h(_components.p,null,\"Although Xu Yushu was always misunderstood and bullied by people around her, she still had her share of friends.\"),\"\\n\",Vue.h(_components.p,null,\"On top of her desk is a deck of playing cards her classmate sent her.\\nThe cards are old and some of them are tattered.\\nIn the will she wrote specifically to this classmate, she called him her best friend.\\nShe also listed a few other friends, and wrote:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Thank you for being my friends, even though it might be one-sided from me.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Conclusion\"),\"\\n\",Vue.h(_components.p,null,'Maybe \"Xu Yushu\" is not the name she prefers the most, but because of limited information, we can\\'t figure out which name she had in mind.\\nMaybe this will be a secret forever.'),\"\\n\",Vue.h(_components.p,null,\"No matter how much time passes, maybe her soul would be still in a bookstore somewhere because of her attachment in the literatures of this world.\"),\"\\n\",Vue.h(_components.p,null,\"Good night, and wish you a dream filled with the sweet smell of books.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"