"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",em:\"em\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Line\"),\"\\n\",Vue.h(_components.p,null,\"Fragmented memories,\\nlike chaotic threads, cross, combine, split, and dissipate...\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"You’re leaving now… sis...\"),\"\\n\",Vue.h(_components.p,null,\"How do I read this antenna’s feeder line again?\"),\"\\n\",Vue.h(_components.p,null,\"Aren’t you going to school anymore...\"),\"\\n\",Vue.h(_components.p,null,\"Didn’t we agree to...\"),\"\\n\",Vue.h(_components.p,null,\"Shanmaomao\",Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-1\",id:\"footnote-ref-1\"},\"1\")),\"! Hug!\"),\"\\n\",Vue.h(_components.p,null,\"Her hearing isn’t very good...\"),\"\\n\",Vue.h(_components.p,null,\"Why...\"),\"\\n\",Vue.h(_components.p,null,\"You left us here...\"),\"\\n\",Vue.h(_components.p,null,\"This is for her...\"),\"\\n\",Vue.h(_components.p,null,\"Next time, let's play maimai together...\"),\"\\n\",Vue.h(_components.p,null,\"Teach me how to drive~\"),\"\\n\",Vue.h(_components.p,null,\"Please take good care of Shanmaomao~\"),\"\\n\",Vue.h(_components.p,null,\"You’re so amazing, sis. I envy you...\"),\"\\n\",Vue.h(_components.p,null,\"My family scolded me again, and work at the company is piling up...\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Waves\"),\"\\n\",Vue.h(_components.p,null,\"The bitter winter will eventually pass.\\nDo you still remember that day, March 18th?\"),\"\\n\",Vue.h(_components.p,null,\"Why I bring it up now?\\nBecause, truly, thank you...\"),\"\\n\",Vue.h(_components.p,null,\"Branches twist and sprawl, black and white,\\nA withered tree among others still lush with green leaves.\"),\"\\n\",Vue.h(_components.p,null,\"The path through the campus, paved with ivory and magenta bricks,\\nDust settles softly upon the worn stones.\"),\"\\n\",Vue.h(_components.p,null,\"That great tree, its roots encased by bricks and stone,\\nSways its slender branches ever so gently.\"),\"\\n\",Vue.h(_components.p,null,\"A tall figure stands there,\\nBeside a graceful girl, beautiful and serene.\"),\"\\n\",Vue.h(_components.p,null,\"I watched the directions on my phone, carefully walking over.\"),\"\\n\",Vue.h(_components.p,null,\"“Hello...?”\\nI asked timidly.\\nShe hesitated for a moment before realizing and greeted me warmly.\"),\"\\n\",Vue.h(_components.p,null,\"She told her friends that I was also here to take the radio exam.\"),\"\\n\",Vue.h(_components.p,null,\"I sat by the tree, feeling honoured,\\nas I watched them joyfully operating their handheld radios.\"),\"\\n\",Vue.h(_components.p,null,\"Then, we headed out together,\\nand the three of us took out our radios and captured a \",Vue.h(_components.em,null,\"tete\"),\" moment, placing our devices side by side and taking a photo to celebrate the meetup.\"),\"\\n\",Vue.h(_components.p,null,\"But they didn’t know I was also a trans girl at first.\\nBefore I had a chance to explain,\\nthey found out — because I had shared something related on my social media,\\nand they were shocked.\"),\"\\n\",Vue.h(_components.p,null,\"That sister said:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“This is something kids shouldn't know, but in this day and age, it's normal.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"So I mustered up the courage to come out to them.\\nThey seemed even more surprised, but their attitude toward me changed a lot, feeling even warmer.\\nI liked it when she patted my head, and I felt flattered.\\nThey didn’t ask me too much about my private life and just continued chatting about radios.\"),\"\\n\",Vue.h(_components.p,null,\"We visited the local radio museum together,\\nand it was the first time I saw such rare collections.\"),\"\\n\",Vue.h(_components.p,null,\"She brought three radios: a Tecsun 2P3, a PL330,\\nand one she designed herself, it was still just a bare PCB, with no casing.\"),\"\\n\",Vue.h(_components.p,null,\"When we entered the museum,\\nshe said she had always wanted to bring these radios to see their predecessors — those ancient ones.\"),\"\\n\",Vue.h(_components.p,null,\"After leaving, I felt so happy to have made friends with such common interests.\"),\"\\n\",Vue.h(_components.p,null,\"She also gave me some trans-themed acrylic charms.\\nShe was so kind...\"),\"\\n\",Vue.h(_components.p,null,\"Later, I had to go back to school.\\nBefore that, we exchanged contact information.\\nThe first time I called her from the school's public phone, she sounded so happy.\"),\"\\n\",Vue.h(_components.p,null,\"We even talked about how to listen to the repeater station.\\nI thought about using it to talk with her from school, but the school's remote location had poor signal.\\nOnly when I took the bus home on weekends could I barely pick up the repeater’s signal.\\nI really wanted a call sign; it sounded so cool!\"),\"\\n\",Vue.h(_components.p,null,\"She later introduced me to a local radio group, and that was my first time connecting with others over radio, exchanging messages.\\nWe used randomly assigned numbers as call signs.\\nShe even told the group members to clear the frequency for me QAQ\\nThat day it was raining, but we still connected smoothly, and the signal was great, yay!\"),\"\\n\",Vue.h(_components.p,null,\"Although I was timid and didn’t want to be a bother, her encouragement, as an older sister, always warmed my heart.\\nThat first experience was what led me to become who I am today.\\n(Though there was a troublemaker trying to interfere with the repeater frequency that day, which made us really angry.)\"),\"\\n\",Vue.h(_components.p,null,\"Later on, I would always pick up the phone at school when I had time and talk to her about how things were going, any new happenings with the group.\\nSince I was a transfer student and had no close friends at school, she became my only “sis.”\\nEventually, I just called her “sis” all the time.\"),\"\\n\",Vue.h(_components.p,null,\"We were really happy together back then.\\nAfter school, you'd always answer my call right away. You’d always greet me cheerfully with “Maomao~.”\\nYou often answered just as you were getting into your car after work, either on your way home or heading to your grandpa’s house.\"),\"\\n\",Vue.h(_components.p,null,\"Then, we talked about radio repairs, school issues, work complaints, hobbies, and life in general...\"),\"\\n\",Vue.h(_components.p,null,\"We shared servers,\\nand I sent her some supplies and little gadgets,\\nand even commissioned her to solder a USB drive for me.\"),\"\\n\",Vue.h(_components.p,null,\"Sometimes, on weekends, she’d take me out.\\nLast time, she planned to take me to Qi’ao Island, but the traffic was so bad we had to turn back.\\nInstead, she showed me the old streets in Jiangmen and took me to eat at Magic Kitchen.\\nAlong the way, we talked a lot,\\nand I learned that she loved circuit design, photography, animals,\\nand had previously volunteered at an animal shelter.\\nShe also liked collecting plant specimens — she seemed like such a carefree and optimistic person.\"),\"\\n\",Vue.h(_components.p,null,\"Not long after, one evening, I made my usual call to her,\\nbut later that night, she suddenly had a powerful suicidal urge.\\nI saw the message on my smartwatch, and I was terrified...\\nI rushed to the farthest bathroom in the dorm to follow up, trying to find someone to help contact her.\\nI spent an hour juggling fear and worry while trying not to get caught by the dorm supervisors, and then, exhausted, I fell asleep.\\nThe next day, I woke up in tears, scared she might be gone. By noon, when I heard she was okay, I finally felt some relief.\"),\"\\n\",Vue.h(_components.p,null,\"But things didn’t get better.\\nShe constantly complained about her family, especially her dad and grandpa's disapproval of her growing her hair long, the unfair company policies, and the life obstacles she couldn’t overcome.\\nAfter work, she’d go to the park by the river, carrying NaNO2, and tell me she didn’t want to live anymore. She told me her plans for ending it. I always tried to talk her down, hoping she’d push through this difficult time.\"),\"\\n\",Vue.h(_components.p,null,\"After giving her all the comforting words and doing my best to console her, she’d always be crying on the phone.\\nI did what I could. I almost always rushed into the classroom right on time for evening study because I had to occupy the phone for so long and got targeted by my roommates. But I felt it was my duty, as someone she cared for.\"),\"\\n\",Vue.h(_components.p,null,\"After that, though, there were things I just couldn’t do...\"),\"\\n\",Vue.h(_components.h2,null,\"Fate\"),\"\\n\",Vue.h(_components.p,null,\"I’ve cried all my tears. Now I’m numb.\"),\"\\n\",Vue.h(_components.p,null,\"After she passed away, I felt a deep sense of guilt, guilty for not being there for her more. I had been with her through so many hard times, but I still felt I should have done more to comfort her and give her hope.\"),\"\\n\",Vue.h(_components.p,null,'A scene suddenly flashed through my mind: that \"first time.\"'),\"\\n\",Vue.h(_components.p,null,\"I arrived at the hospital and found her stepmother while she was still being resuscitated.\"),\"\\n\",Vue.h(_components.p,null,\"The emergency doctor said:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“Once someone attempts suicide, there’s always a second time.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"The first time was impulsive, the second time, it was fate.\"),\"\\n\",Vue.h(_components.p,null,'Her first \"death\" seemed to bring about a new beginning, but the knot in her heart was never untied. The world still looked blurry to her.'),\"\\n\",Vue.h(_components.p,null,\"Many people believe in rebirth, thinking it can wash away everything. But this time, would fate favor her?\"),\"\\n\",Vue.h(_components.p,null,\"Actually, yes. After walking through the gates of death, she began to express her sexual orientation more openly. Before she left, she still complained about how the older generation disliked her long hair...\"),\"\\n\",Vue.h(_components.p,null,\"You seemed to gradually find your direction in life. From the initial confusion about buying clothes to later confidently wearing the most fitting and beautiful styles for everyone to see. We took lots of lovely photos of you, at least in the pictures, you looked happy, and more lively than before.\"),\"\\n\",Vue.h(_components.p,null,\"We met more often after that, and we shared many warm memories.\"),\"\\n\",Vue.h(_components.p,null,\"But, how should I put this? Since you began to lose hope in yourself, every event felt like playing Russian roulette with your own life.\"),\"\\n\",Vue.h(_components.p,null,\"Blood inevitably flowed. There were more than six bullets. Some hits were light, some heavy. But it wasn’t just six bullets. When you lost hope, you knew you were cornered...\"),\"\\n\",Vue.h(_components.p,null,\"Being transgender was the main theme of your life. It wasn’t inherently wrong, but the negative emotions within you kept building up over time, eventually leading to this tragedy.\"),\"\\n\",Vue.h(_components.p,null,\"All of it — it was a struggle against yourself.\"),\"\\n\",Vue.h(_components.p,null,\"I said:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“I only knew the you before death. I don’t want to know the confused you.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Why did I say that?\"),\"\\n\",Vue.h(_components.p,null,\"Because I forgive you for dying with dignity, due to family and work issues.\"),\"\\n\",Vue.h(_components.p,null,\"But I cannot forgive you for accepting the emptiness inside you. You wanted to be with those who had already passed. With such thoughts, it was hard to save you.\"),\"\\n\",Vue.h(_components.p,null,\"You deeply felt that you had become dispensable.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“After all, being alone is just like this.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"You finally said, tiredly...\"),\"\\n\",Vue.h(_components.p,null,\"I know the unprofessional medication you were prescribed made you feel awful, making your already joyless life even darker, shrouded in layers of mist.\"),\"\\n\",Vue.h(_components.p,null,\"Eating and sleeping are things we’re born knowing how to do; they’re driven by instinct. But drinking, smoking, overdosing, and using drugs are things we had to force ourselves to learn.\"),\"\\n\",Vue.h(_components.p,null,\"Once it happens the first time, it's hard for it not to happen again.\"),\"\\n\",Vue.h(_components.p,null,\"Just like alcohol—if you think it tastes bad, it's only because you haven’t found the one that suits you. Once you find the right one, you might start liking it.\"),\"\\n\",Vue.h(_components.p,null,\"These learned behaviors are nothing more than emotional painkillers, ways to console oneself.\"),\"\\n\",Vue.h(_components.p,null,\"And suicide? Suicide is an incredibly complex topic. Our society today lacks compassion, post-crisis therapy, and meaningful social support. For someone on the brink, suicide feels like the only way to escape profound despair.\"),\"\\n\",Vue.h(_components.p,null,\"Otherwise, how could there be parents asking doctors in the ICU, ‘Will my child be able to go to school tomorrow?’\"),\"\\n\",Vue.h(_components.p,null,'People who attempt suicide need love and care, not to be thrown back into the fight alone after surviving. Few can endure such isolation and pressure.\"'),\"\\n\",Vue.h(_components.p,null,\"In the months after I helped Danpian out of her first crisis,\\nI didn’t speak with her much.\\nIt was her life to live, and I had a hunch she might leave.\\nI told her I wanted her to be well,\\nbut I didn’t want to interfere with her choices—she was exhausted and needed time to rest.\"),\"\\n\",Vue.h(_components.p,null,\"Her struggles stemmed from her gender identity, work, family, and the departure of \",Vue.h(_components.a,{href:\"https://one-among.us/profile/SS3B_0016\"},\"Yantian\"),\".\"),\"\\n\",Vue.h(_components.p,null,'Danpian was simply tired. She was kind to everyone, always the one comforting others in dire situations. Yet, no one truly understood or cared about her struggles—her despair was rooted in the realization that no one would stand by her side, and in her mind, death became her only refuge.\"'),\"\\n\",Vue.h(_components.p,null,'\"The world is cold and indifferent. No matter how hard you try, some fates feel inescapable, beyond effort or willpower.'),\"\\n\",Vue.h(_components.p,null,\"Without love and security, she tried to sync her wavelength with her friends countless times, but the signals always missed.\"),\"\\n\",Vue.h(_components.p,null,'Poor Danpian, rest in peace. I only hope you can find joy on the other side.\"'),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"Suicide is always complicated, and where there is one attempt, there will likely be another.'),\"\\n\",Vue.h(_components.p,null,\"I sincerely hope that everyone can find their inner sanctuary.\"),\"\\n\",Vue.h(_components.p,null,\"And even if it hasn’t happened yet, don’t give up.\"),\"\\n\",Vue.h(_components.p,null,\"Because you’re not living for those certificates or career achievements.\"),\"\\n\",Vue.h(_components.p,null,'You’re living for yourself, for the unique, living version of you.\"'),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Love\"),\"\\n\",Vue.h(_components.p,null,\"Danpian once talked with her stepmother about Yantian. Her stepmother asked, ‘Why don’t you help others like Yantian did?’\"),\"\\n\",Vue.h(_components.p,null,\"Maybe Danpian wanted to, but all she truly longed for was to find a companion—a person who would love and understand her.\"),\"\\n\",Vue.h(_components.p,null,\"Yantian saved people for the sake of saving.\"),\"\\n\",Vue.h(_components.p,null,\"And Danpian? She just wanted to be loved.\"),\"\\n\",Vue.h(_components.p,null,\"She gave her all in search of that love.\"),\"\\n\",Vue.h(_components.h2,null,\"Epilogue\"),\"\\n\",Vue.h(_components.p,null,\"This note was written in the middle of the night, after taking melatonin.\\nIt may differ from the thoughts I originally intended to express.\\nMy brain is barely functioning.\"),\"\\n\",Vue.h(_components.p,null,\"What I’ve recorded here reflects only my subjective understanding of Danpian and my thoughts about her. Nobody can truly understand another person. Even she was lost within herself.\"),\"\\n\",Vue.h(_components.p,null,\"About 75% of what I wrote is rational analysis; the rest is just emotion poured out for Danpian.\"),\"\\n\",Vue.h(_components.p,null,\"I’m sorry...\"),\"\\n\",Vue.h(_components.p,null,\"I feel lost and empty too.\"),\"\\n\",Vue.h(_components.p,null,\"Will I be next?\"),\"\\n\",Vue.h(_components.p,null,\"I’ve been thinking too much these days, maybe just out of boredom. But I feel so hollow I don’t know what to do...\"),\"\\n\",Vue.h(_components.p,null,\"I think I’ve had enough of living.\"),\"\\n\",Vue.h(_components.p,null,\"I listened to her sorrow every day, trying to ease her anxiety. I even called her the day before her first suicide attempt.\"),\"\\n\",Vue.h(_components.p,null,\"But she still chose that path. She was revived that day, but on the call, she told me:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"You might not see me tomorrow.\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"That sentence hit me like ice water.\"),\"\\n\",Vue.h(_components.p,null,\"If it happens again, I fear I’ll be powerless to help—because I can't fill the emptiness within her soul. I can't recharge her spirit like some robot and set her life parameters back to normal.\\\"\"),\"\\n\",Vue.h(_components.p,null,'\"I arrived too late, but I still came. Before she slept, I saw her post a video of herself taking pills. I messaged her, asking what she took, but she just said it didn’t matter. Alone in her cold rented room, she had already made her decision.'),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"This is all life amounts to when you\\'re on your own.\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Her words were muddled by the effects of the drugs, but I knew this time, there was no light left.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"May the wind carry you away.\"),\"\\n\",Vue.h(_components.p,null,\"Rest in peace. I only wish for you to be a happy girl in the next world.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"These are words written for Danpian. May she find peace on the other side.\"),\"\\n\",Vue.h(_components.p,null,\"Contributor for this entry: \",Vue.h(_components.a,{href:\"http://twitter.com/UnnnLlllx3\"},\"Shayu Xiliye\")),\"\\n\",Vue.h(\"ol\",null,Vue.h(\"li\",{id:\"footnote-1\"},'\"Maomao\" and \"Shanmaomao\" in the article stand for Shayu Xiliye, the author of this entry.',Vue.h(\"a\",{href:\"#footnote-ref-1\"},Vue.h(\"svg\",{viewBox:\"0 0 16 16\",version:\"1.1\",id:\"svg1\",\"xmlns:xlink\":\"http://www.w3.org/1999/xlink\",xmlns:\"http://www.w3.org/2000/svg\",\"xmlns:svg\":\"http://www.w3.org/2000/svg\",style:\"margin-left: 0.5rem; margin-bottom: -2px; width: 1rem; height: 1rem\"},Vue.h(\"defs\",{id:\"defs1\"},Vue.h(\"linearGradient\",{id:\"linearGradient3\"},Vue.h(\"stop\",{style:\"stop-color:#ff8373;stop-opacity:1;\",offset:\"0.5\",id:\"stop3\"}),Vue.h(\"stop\",{style:\"stop-color:#ff8373;stop-opacity:0;\",offset:\"0.5\",id:\"stop4\"})),Vue.h(\"linearGradient\",{id:\"linearGradient1\"},Vue.h(\"stop\",{style:\"stop-color:#ff8373;stop-opacity:0;\",offset:\"0.5\",id:\"stop1\"}),Vue.h(\"stop\",{style:\"stop-color:#ff8373;stop-opacity:1;\",offset:\"0.5\",id:\"stop2\"})),Vue.h(\"linearGradient\",{\"xlink:href\":\"#linearGradient1\",id:\"linearGradient2\",x1:\"2.6681123\",y1:\"8\",x2:\"13.331888\",y2:\"8\",gradientUnits:\"userSpaceOnUse\",gradientTransform:\"translate(2.6678295,-2)\"}),Vue.h(\"linearGradient\",{\"xlink:href\":\"#linearGradient3\",id:\"linearGradient4\",x1:\"3.7075224\",y1:\"8\",x2:\"12.292478\",y2:\"8\",gradientUnits:\"userSpaceOnUse\"})),Vue.h(\"g\",{id:\"layer1\",transform:\"translate(0,2)\"},Vue.h(\"circle\",{style:\"fill:#cccccc;fill-opacity:0;stroke:url(#linearGradient2);stroke-width:1.5;stroke-linecap:square;paint-order:stroke fill markers\",id:\"path1\",cx:\"10.667834\",cy:\"6\",r:\"4.5818877\"}),Vue.h(\"path\",{style:\"fill:#cccccc;fill-opacity:0;stroke:#ff8373;stroke-width:1.5;stroke-linecap:square;paint-order:stroke fill markers\",d:\"M 9.9178343,10.577036 H 1.7971455\",id:\"path2\"}),Vue.h(\"path\",{style:\"fill:#cccccc;fill-opacity:0;stroke:url(#linearGradient4);stroke-width:1.5;stroke-linecap:square;paint-order:stroke fill markers\",id:\"path3\",d:\"M 8.0000001,11.231817 4.7681825,8.0000001 7.9999999,4.7681825 11.231817,7.9999999 Z\",transform:\"translate(-3.6894439,2.577036)\"})))))),\"\\n\",\"\\n\")}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"