"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Yuxue is a transgender catgirl. In her self-introduction, she said, [I declare that I am a transspecies cat girl, a cross-species cat girl. Although I am a human being physically, I identify myself as a cat girl. At the same time, I identify myself as a woman, but my body is male, so I am a male to female. ]\"),\"\\n\",Vue.h(_components.p,null,\"Yuxue is a person who needs companionship very much, which is often mentioned in her tweets. She often tweets about her unbearable loneliness and longing for companionship. Finally, she found several best firends who could accompany her. But her sensitivity made her worry that she would be hated by others.\"),\"\\n\",Vue.h(_components.p,null,\"As a little girl side, she used to decorate mangoes with candles. She also did some research on electronic devices.\"),\"\\n\",Vue.h(_components.p,null,\"Her parents expressed serious disapproval of her transgender behavior at first, but eventually gained a little support after she fought for it. Like traditional Chinese schools, her school was not kind to her, which preventing her from carrying HRT medicines and keeping her hair long, which may have exacerbated her depression.\"),\"\\n\",Vue.h(_components.p,null,\"It is a pity that everyone's efforts did not stop her worsening depression. In the end, he chose to die.\"),\"\\n\",Vue.h(_components.p,null,\"After her death, Han Lianyi reflected on her failure to transfer Yuxue to someone else in time when Han was not capable enough for her case, failing to discover Yuxue's obvious signs of suicide in time, and Han's inadequacy in guiding the rescue of Yuxue at hospital. Han hope that this failure could bring some inspiration for future suicide intervention.\"),\"\\n\",Vue.h(_components.p,null,\"May Yuxue become a beautiful girl in heaven and never be discriminated against.\"))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"