"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Yuxue is a transgender catgirl. In her self-introduction, she said, “I declare that I am a transspecies cat girl, a cross-species cat girl. Although I am a human being biologically, I identify myself as a catgirl. At the same time, I identify myself as a woman, but I'm male biologically, so I am MtF.”\"),\"\\n\",Vue.h(_components.p,null,\"Yuxue is a person who craves companionship, which was often mentioned in her tweets. She often tweets about her unbearable loneliness and longing for companionship. Eventually, she found several best friends who could accompany her. But her sensitivity made her worry that she would be hated by others.\"),\"\\n\",Vue.h(_components.p,null,\"She had the side of being a little girl. She used to decorate mangoes with candles. She also did some research on electronics.\"),\"\\n\",Vue.h(_components.p,null,\"Her parents expressed serious disapproval of her transgender behavior at first, but eventually gained a little understanding of her after her efforts. Like other Chinese schools, her school prevented her from carrying HRT medicines to school and keeping her hair long, which may have exacerbated her depression.\"),\"\\n\",Vue.h(_components.p,null,\"It is a pity that her friends’ efforts did not stop her depression from worsening.\\nIn the end, she chose suicide.\"),\"\\n\",Vue.h(_components.p,null,\"After her death, Han Lianyi (a Chinese trans women known for her volunteer suicide prevention work) reflected on her failure to transfer Yuxue to someone else in time when Han was not capable enough for her case; failing to discover Yuxue's obvious signs of suicide in time; and her inadequacy in guiding the rescue of Yuxue at hospital. Han hopes that this failure could help guide future suicide prevention efforts.\"),\"\\n\",Vue.h(_components.p,null,\"May Yuxue become a beautiful girl and never be discriminated against in heaven.\"))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"