"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",a:\"a\",blockquote:\"blockquote\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Shui Yuan Zhu is a trans woman living in Shanghai.\\nShe was friends with Ying.\\nDuring her life, she was an active long-term contributor for Chinese Wikipedia and other MediaWiki sites.\\nSince 2019, she started playing Azur Lane.\\nHer favorite character was Xiang.\\nHer hobbies were tinkering with computer hardware like Respberry Pi and drawing.\\nShe was also proficient in Japanese.\"),\"\\n\",Vue.h(_components.p,null,\"Because of depression and other problems, she had to stop going to school since 2019;\\nbecause of inacceptance of her family and other problems she faced, her depression and anxiety got worse and started to suffer from insomnia.\\nOn 2021 July 21st, she took her own life to leave this cruel world.\"),\"\\n\",Vue.h(_components.p,null,\"This is the \",Vue.h(_components.a,{href:\"https://pbs.twimg.com/media/E6odBBBVIAAM-Zt?format=jpg&name=4096x4096\"},\"last piece of writing\"),\" she left us.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"To every one of my friends\"),\"\\n\",Vue.h(_components.p,null,\"People who know me well usually call me Shui Senpai or Shui Yuan, but my name is actually 水原なぎさ。\\nNot my legal name, of course.\\nHow do I say this?\\nDuring these past few years I've been tormented by chronic depression and anxiety issues.\\nI think they finally overcame me today,\\nso I decided to end my life.\\nI don't really know what would happen,\\neither I'd be dead or I'd be in the ICU, lol.\\nRegrettablly, I would be unable to enjoy the 3060 video card I just got.\\nAnd Nintendo Switch, PlayStation 5.\"),\"\\n\",Vue.h(_components.p,null,\"Everything goes wrong when my family is involved.\\nIt's better to hope for a better start in the next life?\\nNope, of course I'm not going to come to this cruel world again;\\nthe worlds portrayed in animes are much better, not that I think they exist.\"),\"\\n\",Vue.h(_components.p,null,\"(Switching my pen.)\"),\"\\n\",Vue.h(_components.p,null,\"I'm tired of everything.\\nI still have games to play:\\nWhat would happen to the girls in Zhen Shou Fu?\\nWould that character keep waiting for me?\\nI'm sorry, but I cannot keep going anymore.\\nI really can't find any energy in myself to keep me going.\\nThis body is also broken, from head to toe.\\nMight as well throw it away, along with these health issues.\\nI hope that in the next life,\\nI can master drawing;\\nI can read more books, number exceeding those I've read in this life;\\nMost importantly, being a cute girl.\\n(Not that I believe in there being a next life, just a wish.)\"),\"\\n\",Vue.h(_components.p,null,\"I want to thank everyone who have helped me during my short life.\\nYou helped me many times during various time periods of my life,\\nbut I really can't thank you individually.\\nAnd, Ying, if there really is a world we go to after death,\\nI'll mark the route for you.\\nNot really, please live healthily and happily in this life.\\nOh, I forgot.\\nI have a Vtuber video to watch, I'm going to watch that now.\\nOnce again, thank you, every one of my friends.\\nSorry for taking your time.\"),\"\\n\",Vue.h(_components.p,null,\"— Shui Yuan Zhu, 2021 June 21st.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/letter.jpg\"]}),\"\\n\",Vue.h(_components.p,null,\"Wish you to be able to meet the girls in Zhen Shou Fu and live happily in another world,\\nafter leaving all of this world's sufferings behind.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"