"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({blockquote:\"blockquote\",p:\"p\",h2:\"h2\"},props.components),PhotoScroll=_components.PhotoScroll,Sakura=_components.Sakura;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);if(!Sakura)_missingMdxReference(\"Sakura\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"Flowers never know a time to wither, nor does love find a moment to be conveyed. Love is eternal, and the violet shall forever endure in this world.\"'),\"\\n\",Vue.h(_components.p,null,'\"May you and your beloved meet again by chance one day.\"'),\"\\n\",Vue.h(_components.p,null,\"—— Toka Sakyo, 2024/10/07\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"The moment she opened her eyes, a magical world blossomed before her.\"),\"\\n\",Vue.h(_components.p,null,\"The starry sky brought the daughter of the heavens, who desires to become a companion in the mortal world henceforth\"),\"\\n\",Vue.h(_components.p,null,\"The morning sun lights up a streak of dawn, transforming into her two wings from then on\"),\"\\n\",Vue.h(_components.p,null,\"The clouds and mists paints the scenery of the day, then silently leaves behind her iridescent robe\"),\"\\n\",Vue.h(_components.p,null,\"The narrow and long Big Dipper transforms into a shimmering tassel\"),\"\\n\",Vue.h(_components.p,null,\"The meandering stream transforms into dynamic musical notes\"),\"\\n\",Vue.h(_components.p,null,\"The flawless young girl moves through the crowd, taking in the splendor with her eyes\"),\"\\n\",Vue.h(_components.p,null,\"Like a spirit in a dream, she silently moves among all things\\n\\uFEFF\\nHowever, deep within the shadows where the day and night cycle on the surface of the earth alternates, darkness always lurks.\"),\"\\n\",Vue.h(_components.p,null,\"As the sun that lights up the earth sets, and the bright moonlight fades away, she stands alone in the silent cold.\"),\"\\n\",Vue.h(_components.p,null,\"She caressed the rock, feeling its icy coldness like frost. There was no wind in her ears, only the gentle glow of warmth in her heart that never faded.\"),\"\\n\",Vue.h(_components.p,null,\"At this moment, the light has moved away from her, but the inner spark has not been extinguished.\"),\"\\n\",Vue.h(_components.p,null,\"At this moment, life may be temporarily absent, but the seeds of waiting will eventually sprout and bloom.\"),\"\\n\",Vue.h(_components.p,null,\"At this moment, thorns are growing, but the greenery will surely spread with the arrival of spring.\\n\\uFEFF\\nAs the last warm sunset fades behind the horizon, she remains steadfast in the depths of the cold night.\"),\"\\n\",Vue.h(_components.p,null,\"In her anticipation, she saw the light piercing through the shadows, gradually warming the cold rock.\"),\"\\n\",Vue.h(_components.p,null,\"In the deepest recesses of the soul, those tiny hopes burn like flickering flames,\"),\"\\n\",Vue.h(_components.p,null,\"Despite the thorns that litter the path ahead, she still believes that the gentle green will spread to every inch of darkness.\\n\\uFEFF\\nPerhaps in her world, the light is no more than a tiny candle flame.\"),\"\\n\",Vue.h(_components.p,null,\"But it is this glimmer of light that illuminates her brushstrokes, bringing warmth to the world.\"),\"\\n\",Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Toka Sakyo, also Nonamev, member of LS Project, a literary girl who loves writing.\"),\"\\n\",Vue.h(_components.p,null,\"She has a light and elegant writing style. She often quotes scriptures and writes long letters a month or two after the college entrance examination, wishing her a bright future.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\",\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"Occasionally inspiration strikes, and after careful consideration, I leave a neat rhythm.\"),\"\\n\",Vue.h(_components.p,null,'On weekdays, she also writes down her thoughts or participates in popular literature. \"Life of Aiden\" (or \"Aiden\\'s Life of Fantasy\") is one of her co-creations with her friends.'),\"\\n\",Vue.h(_components.p,null,\"Either witnessing her passion for writing or feeling the resonance behind her words, several friends were influenced by her and started writing one after another.\"),\"\\n\",Vue.h(_components.p,null,\"In her spare time from work, she also studies AI graphics. Not only did she use Stable Diffusion to generate a channel avatar, she also created several 2023 Mid-Autumn Festival greeting cards (Illustration: Greeting Cards).\"),\"\\n\",Vue.h(_components.h2,null,\"The final chapter\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"さようなら~\"),\"\\n\",Vue.h(_components.p,null,\"By reading this letter, I shall remain only in your memories.\"),\"\\n\",Vue.h(_components.p,null,\"From the moment we met, time really flew by. And next, everyone will have to spend a time that I don’t know.\"),\"\\n\",Vue.h(_components.p,null,\"What will everyone do in the future? Will it continue to be the same as now? But we are all extremely ordinary people, and we may one day be squeezed out or bullied by others...\"),\"\\n\",Vue.h(_components.p,null,\"But I believe everyone can do well no matter where they are.\"),\"\\n\",Vue.h(_components.p,null,\"I want everyone to live happily, but I also know that I may not be able to realize my dream in this life. But I feel very happy to hear everyone's thank you and see everyone's endless discussion. I am proud of myself for being able to work with you all so much and get to know so many great people.\"),\"\\n\",Vue.h(_components.p,null,\"Thank you all\"),\"\\n\",Vue.h(_components.p,null,\"Toka Sakyo\"),\"\\n\"),\"\\n\",\"\\n\",Vue.h(Sakura,{count:\"50\"}))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"