"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",blockquote:\"blockquote\",p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Juezhe was a trans girl who grew up in the rural areas of Guangxi. Though she didn't have much formal education, she carried within her a unique courage.\"),\"\\n\",Vue.h(_components.p,null,\"We often see many trans women with different backgrounds and experiences.\"),\"\\n\",Vue.h(_components.p,null,\"We might find it easier to notice those girls who shine brightly, trying to break barriers with their knowledge and education.\"),\"\\n\",Vue.h(_components.p,null,\"But across this vast land, there are many more trans women who deserve to be seen.\"),\"\\n\",Vue.h(_components.p,null,\"Juezhe didn't leave many words, so we have preserved her first-person narrative to retain more of her presence in this world.\"),\"\\n\",Vue.h(_components.p,null,'\"Girls, don’t be ashamed... you’re not a freak, everyone is always with you.\"'),\"\\n\",Vue.h(_components.p,null,\"—— One Among Us\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Juezhe's Self Narration\"),\"\\n\",Vue.h(_components.p,null,\"When I was in elementary school,\\nI really liked the smooth, hairless skin of girls and how they could dress however they wanted, grow long hair, and braid it.\\nMost importantly, they could wear skirts, which was awesome.\\nEvery time I saw other girls, I envied them very much.\"),\"\\n\",Vue.h(_components.p,null,\"I secretly wore my sister's skirt once.\\nI was so happy but also very scared, scared of being discovered.\\nI hated my secondary sexual characteristics.\\nWhy couldn't I be a girl...\"),\"\\n\",Vue.h(_components.p,null,\"I hated the labels they put on me.\\nI couldn’t accept that,\\nbut gender isn’t something you can choose.\\nI was destined not to change anything.\\nIn others' minds,\\nboys were supposed to be rough and messy.\"),\"\\n\",Vue.h(_components.p,null,\"I have a very considerate sister who always took care of me.\\nWhen I talked back and got hit by my dad,\\nshe was always the first to comfort me.\\nI felt very happy staying with her,\\nbut this short-lived happiness only lasted until she graduated from elementary school...\"),\"\\n\",Vue.h(_components.p,null,\"Maybe it was partly because of family reasons.\\nWhen I was young, my dad smoked, drank, gambled, and liked to commit domestic violence.\\nHe often hit me, leaving bruises and marks.\\nOnce he beat me so hard that a thick black mark was left on my calf.\\nAfter a few instances of domestic violence,\\nmy mom left to work in another province.\\nMy dad often gambled till late and didn’t come home.\\nI was too scared to sleep alone,\\nso I kept the TV on and hid in the corner of the bed by the wall.\\nMaybe growing up in this kind of loveless environment made me crave love even more...\"),\"\\n\",Vue.h(_components.p,null,\"I belonged to the passive personality type,\\nwithout my own opinions,\\nalways feeling self-pity,\\nalways escaping,\\noverly caring about others' evaluations,\\nand yearning for recognition.\\nNo matter how sad I was,\\nI would always force a smile in front of others,\\nafraid of being misunderstood.\"),\"\\n\",Vue.h(_components.p,null,\"Although only my childhood friend was willing to hang out with me,\\nI longed even more to play with girls.\\nWhen I saw female classmates playing string figure or jump rope,\\nI wanted to join them but didn’t have the courage,\\nso I could only watch from afar.\\nI remember very clearly one time during long-break,\\nI stood in the corner watching girls play jump rope for a long time.\\nI wanted so badly to join them but was afraid of being laughed at,\\nso I didn’t dare to speak.\\nIn the end, one girl noticed me and invited me to play.\\nJust as I was about to go over, the bell rang.\\nI was really sad then, and this memory still stays with me...\"),\"\\n\",Vue.h(_components.p,null,\"Sigh...\\nI kept these thoughts to myself and never told anyone.\\nUntil one day,\\nI stumbled upon information about transgenders, estrogen, and transitioning on the internet.\\nThis changed my rigid mindset, and after learning more, I unhesitatingly sought out ways to start HRT...\"),\"\\n\",Vue.h(_components.h2,null,\"Juezhe's Departure\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"I never really hoped to be accepted. Born a misfit...\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"On that day, that girl went to a secluded mountain, intending to end it all.\"),\"\\n\",Vue.h(_components.p,null,\"She knew her family's financial situation couldn’t support her transition nor save her life.\"),\"\\n\",Vue.h(_components.p,null,\"She always felt like a burden...\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"The liquid was so strong, so bitter, and so salty...\"'),\"\\n\",Vue.h(_components.p,null,'\"I hope in the next life I can be a girl... Sorry for making everyone worry even in death...\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Say goodnight to that girl, she was just too tired, and fell asleep...\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"