"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Proselyte was our ally. They often friendly interacted with us despite their introverted personality.\"),\"\\n\",Vue.h(_components.p,null,\"They were fond of cute cats. Whether it was their cat, cats in a pet shop, or strays.\"),\"\\n\",Vue.h(_components.p,null,\"They liked niche pixel art RPG games, such as \",Vue.h(_components.em,null,\"Ib\"),\" and \",Vue.h(_components.em,null,\"Yume 2kki\"),\".\\nThey shared their passion for RPG games on Bilibili.\"),\"\\n\",Vue.h(_components.p,null,\"Proseleyte also contributed to some of their favourite games.\\nAccording to their friends, they made soundtracks for some games and took up the management position for \",Vue.h(_components.em,null,\"Yume Nikki Online Project\"),\" before.\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.p,null,\"Owing to long-term domestic violence, having been hurt by friends in senior high school, and getting mentally abused by their professor in university, Proselyte was troubled by anxiety and depression all along.\\nThey gradually felt that they were losing their sense of existence.\"),\"\\n\",Vue.h(_components.p,null,\"However, they still tried to support themselves by finding beautiful things in life, including their favourite games, cute animals, and pretty illustrations.\\nWhen our friends fell in anxiety, they would generously give them warm hugs too.\"),\"\\n\",Vue.h(_components.p,null,\"Until early November, they still held on to the hope of curing depression before their birthday.\\nSurprisingly, their former friend abruptly said that they harassed him, and asked many other mutual friends to block them.\\nThey never knew what happened, and had no chance to clarify.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I felt malice in the world again. I don’t understand even why... Perhaps I was just born to be hated.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"This thing triggered their PTSD about assaults and cold violence.\\nAfter that, their mental health gradually deteriorated.\\nIn an evening, they went out of their home silently and assimilated into the night.\"),\"\\n\",Vue.h(_components.h2,null,\"After their leaving\"),\"\\n\",Vue.h(_components.p,null,\"Owing to their introverted personality, they still had some untold words for their best friends.\\nAfter Proselyte’s departure, a friend of theirs who didn’t want to disclose their identity took over their account and sent those words in their name.\\nThe friend also replied to those caring messages in Discord, Twitter/X, QQ and so on.\"),\"\\n\",Vue.h(_components.p,null,\"Proselyte’s sister contacted us as well. She couldn’t see them for the last time because she was overseas at the time, so she expressed her condolence in her email to us:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“They are the other half scattered soul of mine. I wish they be well in paradise. I hope there’s no autism in heaven.”\"),\"\\n\",Vue.h(_components.p,null,\"Proselyte’s sister, written on 2023 December 5th.\"),\"\\n\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“Death is not the end of life, but oblivion is.”\\nProselyte wrote this for \",Vue.h(_components.a,{href:\"https://one-among.us/profile/qiqi233345\"},\"Qi\"),\" to remember her.\\nThis is also a quote sentence shown on the main page of \",Vue.h(_components.a,{href:\"https://one-among.us\"},\"One Among Us\"),\". We will never forget you, who are gentle and tough. Rest well, Proselyte.\"),\"\\n\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"