"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Proselyte was our ally. They often interacted with us friendly in spite of their introverted personality.\"),\"\\n\",Vue.h(_components.p,null,\"They were fond of cute cats. Whether it was their own cat, or cats in a pet shop, or cats they met on the street.\"),\"\\n\",Vue.h(_components.p,null,\"They liked some niche pixel art RPG games, such as \",Vue.h(_components.em,null,\"Ib\"),\" and \",Vue.h(_components.em,null,\"Yume 2kki\"),\", and always recorded their RPG game experiences on Bilibili.\"),\"\\n\",Vue.h(_components.p,null,\"Proseleyte also contributed to their favourite games.\\nAccording to their friends, they made soundtracks for some games, and took up a position in \",Vue.h(_components.em,null,\"Yume Nikki Online Project\"),\" before.\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.p,null,\"Owing to long-term domestic violence, having been hurt by friend in senior high school, and getting bullied in university, Proselyte was troubled by anxiety and depression all along.\\nThey gradually felt that they were losing the sense of existance.\"),\"\\n\",Vue.h(_components.p,null,\"However, they still tried to support theirselves by consuming beautiful things, incuding their favourite games, cute animals, and colourful illustrations.\\nWhen our friends fell in anxiety, they would generously give their warm hug.\"),\"\\n\",Vue.h(_components.p,null,\"Until early November, they still held on to the hope of curing depression before their birthday.\\nAccidentally, their former friend abruptly said that they harassed him, and blocked them with other people.\\nThey even didn't know what happened, and had no chance to clarify.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"I felt malice in the world again. I even didn\\'t understand why... Perhaps I was born to be hated.\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"This thing triggered their PTSD about offence and cold violence from others previously.\\nAfter that, their mental health gradully deteriorated.\\nIn an evening, they went out of their home silently and assimilated into the night.\"),\"\\n\",Vue.h(_components.h2,null,\"After their leaving\"),\"\\n\",Vue.h(_components.p,null,\"Owing to their introverted personality, they still had some unsent words to their best friends.\\nAfter Proselyte's departure, a friend of them (didn't want to disclose indentity) took over their account, and sent those words in the name of them.\\nThe friend also replied to those caring messages in Discord, Twitter/X, QQ platform and so on.\"),\"\\n\",Vue.h(_components.p,null,\"The sister of Proselyte contacted with us as well. Although she couldn't see the last time of them. But she expressed her condolence in her email to us:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\" They are other half scattered soul of mine. Wish they be well in paradise. I hope there\\'s not austism in the heaven. \"'),\"\\n\",Vue.h(_components.p,null,\"Proselyte's sister, written on 2023-12-05\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,'\"Death is not the end of life, but oblivion is.\"\\nThis is what Proselyte wrote for ',Vue.h(_components.a,{href:\"https://one-among.us/profile/qiqi233345\"},\"Qi\"),' to remember her.\\nThis is also a quote sentence showed on the main page of \"One Among Us\". We will never forget you, who are gentle and tough. Rest well, Proselyte.'))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"