"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Qi didn’t often talk on the Internet, but she was very welcoming in real life. Her humor always brought people around her happiness.\"),\"\\n\",Vue.h(_components.p,null,\"She seemed mysterious. She didn’t often introduce herself because she thinks: “I am me, I want you know me for who I am, not know me as someone with a certain label. If someone can’t understand me, that’s their problem. I don’t want them to hate people who have the same label or experience as me because of me.”\"),\"\\n\",Vue.h(_components.p,null,\"Qi was a gentle, brave, and resolute person who dares to love and hate. She would bravely speak up for other transgender people, and patiently comfort those who are sad. She has many unique and sharp insights while being strong at the same time. She did not allow others to hurt her friends and love, nor did she allow herself to be hurt by others.\"),\"\\n\",Vue.h(_components.p,null,\"However, she was also plagued by depression and anxiety.\"),\"\\n\",Vue.h(_components.p,null,\"On March 14, 2023, she attempted suicide by jumping off a building due to depression, and her legs were disabled. This made her life very inconvenient and she became more depressed.\"),\"\\n\",Vue.h(_components.p,null,\"On July 1, 2023, she jumped off a building again after taking a large amount of antidepressant drugs.This time, her injuries were beyond saving.\"),\"\\n\",Vue.h(_components.p,null,\"Qi chose to jump pff the builiding due to the suicide of her childhood friend by jumping off a building. She always regretted not being able to save him, so she chose the same way to end her own life.\"),\"\\n\",Vue.h(_components.p,null,\"Qi wrote in her suicide note:\\n“My death has nothing to do with anyone, it’s just a choice of mine, please don′t hate others for it. Please live a good, sunny and happy life, and please live a good life for yourself.”\"),\"\\n\",Vue.h(_components.p,null,\"She had always hoped that everyone can live happily and healthily.\"))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"