"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",strong:\"strong\",blockquote:\"blockquote\",h2:\"h2\",a:\"a\",h3:\"h3\",em:\"em\",hr:\"hr\",code:\"code\"},props.components),PhotoScroll=_components.PhotoScroll,Hexagon=_components.Hexagon,DottedNumber=_components.DottedNumber,BlurBlock=_components.BlurBlock;if(!BlurBlock)_missingMdxReference(\"BlurBlock\",true);if(!DottedNumber)_missingMdxReference(\"DottedNumber\",true);if(!Hexagon)_missingMdxReference(\"Hexagon\",true);if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,Vue.h(_components.strong,null,\"Come back later!\")),\"\\n\",Vue.h(_components.p,null,Vue.h(\"svg\",{style:\"display: inline-block; overflow: visible !important; vertical-align: sub; fill: rgb(154, 103, 0); margin-right: 10px;\",viewBox:\"0 0 16 16\",version:\"1.1\",width:\"16\",height:\"16\",\"aria-hidden\":\"true\"},Vue.h(\"path\",{d:\"M6.457 1.047c.659-1.234 2.427-1.234 3.086 0l6.082 11.378A1.75 1.75 0 0 1 14.082 15H1.918a1.75 1.75 0 0 1-1.543-2.575Zm1.763.707a.25.25 0 0 0-.44 0L1.698 13.132a.25.25 0 0 0 .22.368h12.164a.25.25 0 0 0 .22-.368Zm.53 3.996v2.5a.75.75 0 0 1-1.5 0v-2.5a.75.75 0 0 1 1.5 0ZM9 11a1 1 0 1 1-2 0 1 1 0 0 1 2 0Z\"})),\" This version is NOT the formal version. Maintainers will update this after finishing Simplified Chinese version.\"),\"\\n\",Vue.h(_components.p,null,Vue.h(\"svg\",{style:\"display: inline-block; overflow: visible !important; vertical-align: sub; fill: rgb(209, 36, 47); margin-right: 10px;\",viewBox:\"0 0 16 16\",version:\"1.1\",width:\"16\",height:\"16\",\"aria-hidden\":\"true\"},Vue.h(\"path\",{d:\"M4.47.22A.749.749 0 0 1 5 0h6c.199 0 .389.079.53.22l4.25 4.25c.141.14.22.331.22.53v6a.749.749 0 0 1-.22.53l-4.25 4.25A.749.749 0 0 1 11 16H5a.749.749 0 0 1-.53-.22L.22 11.53A.749.749 0 0 1 0 11V5c0-.199.079-.389.22-.53Zm.84 1.28L1.5 5.31v5.38l3.81 3.81h5.38l3.81-3.81V5.31L10.69 1.5ZM8 4a.75.75 0 0 1 .75.75v3.5a.75.75 0 0 1-1.5 0v-3.5A.75.75 0 0 1 8 4Zm0 8a1 1 0 1 1 0-2 1 1 0 0 1 0 2Z\"})),\" This is an unfinished version. Please refer to the Traditional Chinese page.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Yes, life is a game, so living is my right, not my obligation. So, I can even do something while holding a cyanide capsule. I’m willing to do it, and I am preparing to do it. That means, in some dangerous situations, I might even do such things. In situations where I might get caught, I would still say, “Yes, I’ll do it, and I will absolutely not let my enemies get me.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,Vue.h(\"svg\",{style:\"display: inline-block; overflow: visible !important; vertical-align: sub; fill: rgb(26, 127, 55); margin-right: 10px;\",viewBox:\"0 0 16 16\",version:\"1.1\",width:\"16\",height:\"16\",\"aria-hidden\":\"true\"},Vue.h(\"path\",{d:\"M8 1.5c-2.363 0-4 1.69-4 3.75 0 .984.424 1.625.984 2.304l.214.253c.223.264.47.556.673.848.284.411.537.896.621 1.49a.75.75 0 0 1-1.484.211c-.04-.282-.163-.547-.37-.847a8.456 8.456 0 0 0-.542-.68c-.084-.1-.173-.205-.268-.32C3.201 7.75 2.5 6.766 2.5 5.25 2.5 2.31 4.863 0 8 0s5.5 2.31 5.5 5.25c0 1.516-.701 2.5-1.328 3.259-.095.115-.184.22-.268.319-.207.245-.383.453-.541.681-.208.3-.33.565-.37.847a.751.751 0 0 1-1.485-.212c.084-.593.337-1.078.621-1.489.203-.292.45-.584.673-.848.075-.088.147-.173.213-.253.561-.679.985-1.32.985-2.304 0-2.06-1.637-3.75-4-3.75ZM5.75 12h4.5a.75.75 0 0 1 0 1.5h-4.5a.75.75 0 0 1 0-1.5ZM6 15.25a.75.75 0 0 1 .75-.75h2.5a.75.75 0 0 1 0 1.5h-2.5a.75.75 0 0 1-.75-.75Z\"})),\" The following text was written in accordance with the wishes of XingZ60 herself. Because of the large time span, the loss of some of the suicide note, and the fact that after her death her friends were generally in a state of great grief and acted in their own ways, it is difficult to write this article in a way that fully realizes the arrangements and ideas that she had in mind before she passed away.\"),\"\\n\",Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"XingZ60 (contemporary trans “xyn” community); originally known as Z60 (limelight); Wu Siya (ZhiHu).\"),\"\\n\",Vue.h(_components.p,null,\"During her active years on ZhiHu, she was a trans ally boy. In early 2022, after losing her phone, she became a part of limelight and continued her activities there, still maintaining the personal image of an ally.\"),\"\\n\",Vue.h(_components.p,null,\"Until July 2022, she started transition. In October 2022, she attempted suicide for the first time. Afterward, she disappeared from the community and retreated from her transition for a period, from October 2022 to April 2023. During this time, she returned for her interest in the rhythmic game “Maimai”, diving deeper into trans culture.\"),\"\\n\",Vue.h(_components.p,null,\"Finally she came out as a trans in September 2023. Afterward, she was able to get diagnosed for her identity.\"),\"\\n\",Vue.h(_components.p,null,\"The inclination of transition is something that cannot be changed.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/image0.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"She had a very good intuition of rhythmic games, but due to her concentration problem, she did not play the purple (hardest) tracks.\"),\"\\n\",Vue.h(_components.h2,null,\"Engagement in Trans Aid\"),\"\\n\",Vue.h(_components.p,null,\"In her view, helping others, especially those in marginalized groups, to survive, live, and develop better has always been very important.\"),\"\\n\",Vue.h(_components.p,null,\"In her spare time, she organized and participated in numerous suicide intervention and rescue operations. She was involved in the rescue of \",Vue.h(_components.a,{href:\"https://one-among.us/profile/GLaDOSister\"},\"Shizuha\"),\". , which had a significant impact in daily life. Trans aid work had always been a part in her daily life. \"),\"\\n\",Vue.h(_components.p,null,\"Her actions helped marginalized people. Through her efforts, she did her utmost to prevent self-harm and suicide.\"),\"\\n\",Vue.h(_components.h2,null,\"Memories by Friends\"),\"\\n\",Vue.h(_components.h3,null,\"Irako\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Z60 is the second stupidest person I have ever seen in my life\"),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——Irako, February 7, 2025\"),\"\\n\"),\"\\n\",Vue.h(_components.h3,null,\"Lingyu\"),\"\\n\",Vue.h(\"h3\",{align:\"center\"},\"This article is written to commemorate my old friend XingZ60\"),\"\\n\",Vue.h(\"p\",{style:\"text-align: center;\"},\"Lingyu\"),\"\\n\",Vue.h(Hexagon,null,Vue.h(\"h3\",null,\"I\"),Vue.h(\"h3\",null,\"Preface\")),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,\"According to XingZ60's will, I am writing this article to commemorate XingZ60. \",Vue.h(\"br\"),Vue.h(\"br\"),\"Originally, this article should have been completed a long time ago, but firstly, XingZ60 had a great influence on me, and my language skills were limited, so a few words didn’t seem enough to write a good article; secondly, XingZ60’s departure also brought me a great shock, so this article was put on hold. Later, after my mental state recovered a little, I began to try to understand and know XingZ60 from all aspects and angles, and this article came about. \",Vue.h(\"br\"),Vue.h(\"br\"),'Some people say that XingZ60 is an \"abstract\" person, and everyone has a unique understanding of XingZ60. The XingZ60 reflected in this article may only be limited to my personal understanding of XingZ60. Don’t just listen to one person’s opinion; listen to both sides and you will be enlightened, while listening to only one side will lead you to confusion. '),Vue.h(DottedNumber,{n:\"II\"}),Vue.h(_components.p,null,'\"The dead are the greatest\" and \"Respect the deceased\" seem to be self-evident and self-evident truths in the minds of most of us. However, everyone seems to have a different understanding of what \"respecting the deceased\" means.'),Vue.h(_components.p,null,\"We once witnessed with our own eyes how XingZ60's parents dressed up her appearance to represent the traditional male gender at her funeral, and hung a headshot with a buzz cut in the center of the mourning hall; we also watched with our own eyes as XingZ60's parents threw her ashes into the trunk of a car and dragged them away. At that time, many people were shocked and angry at the behavior of XingZ60's parents. The respect for the deceased in the eyes of TA's parents seems to be overridden by so-called social customs and the deep-rooted prejudices of the living themselves.\"),Vue.h(_components.p,null,'Throughout the ages, people tend to \"write some good words on the tombstone\", talking more about achievements and less or even not talking about faults. Only Wu Zetian erected a stele without words at Ganling Mausoleum, and her merits and demerits will be judged by future generations. In this matter, XingZ60 is somewhat similar to the latter. TA once said that when a person dies, all the right and wrong, merits and demerits are \"finally judged\"; everyone can make their own judgments. This is also reflected in his suicide note - he invited people who had different opinions from her to write the earlier part of One Among Us, and also left a message saying \"Anyone can write whatever they want.\"'),Vue.h(_components.p,null,\"Since XingZ60 has this idea, I will just write some stories casually. I would like to write down some of the thoughts that XingZ60 brought to me, but I will try not to make any value judgments on her behavior, and let future generations judge her right and wrong, merits and demerits.\"),Vue.h(DottedNumber,{n:\"III\"}),Vue.h(_components.p,null,'XingZ60 seems to have split personality. She said she has at least three personalities, \"Nebula\", \"Dream\" and \"Benzene Ring\". Among them, the gender identity of one personality is male, the gender identity of another personality is female, and the gender identity of another personality is not clear to the author.'),Vue.h(_components.p,null,\"The author once thought XingZ60 was a transgender woman for a long time, but after learning about this situation, he still pondered for a long time - perhaps this is somewhat similar to the situation of Gender Fluid, and it seems that no personal pronoun is appropriate to refer to the other party.\"),Vue.h(_components.p,null,\"This is the first time I have met such a friend. Later, I saw a badge in the shape of a pointer turntable on some of my other friends. The turntable was divided into three parts: sky blue (he), pink (she) and purple (they). You can adjust the direction of the pointer to point to any part to indicate your status.\"),Vue.h(_components.p,null,\"Maybe this thing is suitable for her.\"),Vue.h(_components.p,null,\"However, if we look at it from a higher level, the essence of this confusion is actually the conflict between XingZ60's various personalities; and such a problem of personal pronouns may just be a side effect of this personality conflict at the gender level. What about on other levels? Perhaps the temperament, character, abilities, needs, interests, ideals, and values ​​of XingZ60's various personalities are different. As friends, how should we treat these personalities, or how should we treat such a \\\"complex of multiple personalities\\\"? Even more so, if XingZ60's will only represents the wishes of a certain personality of XingZ60, then is this will valid? If I execute this will and write this article for him/her, is this respecting the deceased as mentioned above, or not?\"),Vue.h(_components.p,null,'I studied law and hold a legal professional qualification certificate; but I don’t know the answer to this question. I tried to search online, but all I got were the same old, mechanical applications of legal provisions: \"Whether a person with split personality has civil capacity depends on whether he or she can recognize his or her own behavior.\" It seems that this answer does not fundamentally solve the problem.'),Vue.h(_components.p,null,'So someone patched it up and said, \"If this is a behavior done in a normal personality state, then it is effective; if this is a behavior done in an abnormal personality state, then it is ineffective.\" So how do we distinguish between normal personality and abnormal personality? Why can an outsider forcibly label \"Nebula\" as \"normal personality\" and forcibly label \"Dream\" as \"abnormal personality\" (or vice versa)?'),Vue.h(_components.p,null,\"I don't know the answers to these questions.\"),Vue.h(DottedNumber,{n:\"IV\"}),Vue.h(_components.p,null,\"XingZ60 (or possibly one of her personalities) publicly made jokes about other deceased sexual minorities more than once during her lifetime; therefore, some of XingZ60's friends also made jokes about the deceased XingZ60 more than once. This sparked quite a bit of debate - these friends believed that XingZ60's behavior showed that she was a person who agreed that \\\"it's okay to make fun of the deceased\\\", so making fun of her was actually a manifestation of respect for her behavior patterns and values. However, some of XingZ60's friends think that this is unacceptable. So the two sides started arguing, and it ended up in a mess.\"),Vue.h(_components.p,null,\"Yes, human beings’ sorrows and joys are not the same, and human thought circuits are not the same. But who can be blamed for this? People's brain power and nervous system development are different, people's growth environment and life experience are also very different, people's rationality and sensibility are clearly controlled by the neurotransmitters in the human body, and the deep thinking and communication required for people to understand each other requires enormous energy. Therefore, human freedom is still constrained by conditions that are beyond one’s control; or in other words, human freedom is “always in chains”\",Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-1\",id:\"footnote-ref-1\"},\"1\")),\" - and for this reason, mediation often ends up being futile, and resonance between people with “different ideologies” is a luxury. Instead, people go to war, attack each other, and hurt each other. So the world became a disguised Colosseum.\"),Vue.h(_components.p,null,'\"A certain group\" is even more of such an arena. Some people ridicule each other in the group and even attack each other offline. In the past, in order to \"make everyone live in peace\", I \"mediated\" the conflicts among \"a certain group\" without any bottom line, but there was no obvious effect, and it was even counterproductive. And XingZ60 said this:'),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I can understand both sides, but I can't reconcile them.\"),\"\\n\"),Vue.h(_components.p,null,\"What a helpless reality. And the world is full of helplessness. Whether it is between people or between people and things.\"),Vue.h(_components.p,null,\"Faced with such a contradiction, XingZ60's approach was to separate the two groups by creating a group. Since people who have achieved success through their own efforts are attacking those who gain attention by playing the victim, let them join different groups. So he created a new group:\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"This is a place to lick your wounds, not a place to show off your superiority.\"),\"\\n\"),Vue.h(_components.p,null,\"He added many members to the new group who he believed were not successful in the secular sense (or even failed in the secular sense), some of whom had repeatedly self-harmed and abused drugs - but XingZ60 showed special tolerance for all kinds of people:\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"They were all forced.\"),\"\\n\"),Vue.h(_components.p,null,\"XingZ60 even publicly said:\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I am no different from everyone else. Although you think I am a highly educated talent of Beihang University, the admission score line of Beihang University was broken that year, and I was just lucky to get in. I was supposed to be like everyone else.\"),\"\\n\"),Vue.h(_components.p,null,\"Later, I checked the admission score line of Beihang University on the Internet and found that there was no gap in the admission score line that year.\"),Vue.h(_components.p,null,\"I didn't take it seriously at the time, until I heard about the story of another friend - the general situation was that he grew up in a single-parent family and was emotionally neglected by his guardian while growing up; this environment shaped his distorted personality, causing her to become addicted to drug abuse and be dealt with by the public security authorities.\"),Vue.h(_components.p,null,'After hearing this story and thinking about it, I suddenly had a creepy feeling of surviving a disaster: if my life was also \"interrupted\" by chance, and I started out in a single-parent family with no emotional support, then my ending might not be much better than that of this friend. Maybe I should have been shot for murder and arson.'),Vue.h(_components.p,null,'XingZ60\\'s parents are both teachers. This seemed to make me suddenly understand XingZ60\\'s \"modesty\" about her academic qualifications. I once regarded XingZ60 as a god in my heart. Later, I suddenly realized that there was no need for this. Because, by the same logic, if I \"upgrade\" and become XingZ60\\'s life, then \"I can do it too\"; if XingZ60 \"downgrades\" and becomes my life, then \"TA can\\'t step down either\".'),Vue.h(_components.p,null,\"Thinking of this, I suddenly felt a sense of relief.\"),Vue.h(DottedNumber,{n:\"V\"}),Vue.h(_components.p,null,\"However, the operating mode of this world is not controlled by a single variable.\"),Vue.h(_components.p,null,\"Of course, the beginning of life is just one of the variables. It may be an important variable, but it is not the only variable.\"),Vue.h(_components.p,null,\"The world is a huge web, with seven billion people acting together on it, collectively exerting large or small influences on the direction of this web.\"),Vue.h(_components.p,null,\"Everyone is a part of this big network, being influenced by it and also influencing it.\"),Vue.h(_components.p,null,\"No one knows what kind of people they will meet or what kind of things will happen on this big Internet; it is even more impossible to predict what impact these things will have on their future.\"),Vue.h(_components.p,null,\"When XingZ60 passed away, some people blamed themselves:\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"If only I had looked at her more.\"),\"\\n\",Vue.h(_components.p,null,\"I should have noticed that his mental state was not right.\"),\"\\n\",Vue.h(_components.p,null,\"There was something wrong with the meal he invited me to the day before yesterday. I was so dumbfounded that I didn’t react.\"),\"\\n\",Vue.h(_components.p,null,\"I was free that day, otherwise I would have gone straight to the hospital.\"),\"\\n\"),Vue.h(_components.p,null,'However, the arrival of the \"big net\" was so accidental. It just so happened that XingZ60 encountered a not-so-good growing environment, and it just so happened that her parents knew everything, and it just so happened that no one had time, and it just so happened that the hospital couldn\\'t find out what the disease was, and it just so happened that all the coincidences came together.'),Vue.h(_components.p,null,\"So this is the result.\"),Vue.h(DottedNumber,{n:\"VI\"}),Vue.h(_components.p,null,'But, XingZ60 still hopes that I will \"stick to what I insist on\" - I think it means \"mediate the conflict\".'),Vue.h(_components.p,null,\"But I guess I really can’t keep on insisting anymore. XingZ60's way of understanding these interpersonal conflicts seemed to have turned into something that was deeply rooted in me. It seems that I have inherited a little bit of his thoughts and continue to live - maybe one day I will die, and if someone reads what I wrote and gains some insights, they will also live with these feelings...\"),Vue.h(_components.p,null,'Later, I accidentally saw a famous saying by a poet: \"When a person dies, it is like water disappearing into water.\"',Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-2\",id:\"footnote-ref-2\"},\"2\"))),Vue.h(_components.p,null,\"So I opened the window, and what came into my sight was the boundless sea with spring flowers blooming.\"),Vue.h(DottedNumber,{n:\"VII\"}),Vue.h(_components.p,null,'However, \"Genshin Impact\" is a brand new open world adventure game independently developed by miHoYo. XingZ60 plays \"Genshin Impact\". This \"Genshin Impact\" is not that \"Genshin Impact\"; for example, \"Wu Meng DX\", which is called \"Arcade Genshin Impact\" by everyone, is also a type of \"Genshin Impact\".'),Vue.h(_components.p,null,\"XingZ60 has complained more than once that \\\"Genshin Impact\\\" is very addictive, and has expressed the idea of ​​quitting the game - every day, she has to face the same daily tasks, repeating day after day, and if she doesn't complete a task one day, she will receive one less day's daily reward. However, when talking about quitting, he would always force herself to stop. However, one day, the following conversation occurred between me and him/her:\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Hey, have you played the new song updated on the Chinese server? It's called something like Trans or something. It's really fun. Other songs are all tap, slide or tap, tap, slide, but this song is tap, tap, tap, slide. It's really fun.\"),\"\\n\"),Vue.h(_components.p,null,\"I vaguely remember that his tone was actually full of laughter.\"),Vue.h(_components.p,null,\"Later, he and I hugged each other and said goodbye. This was the first time he and I hugged each other, and he looked very happy.\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"I will always be with you, sir.\"'),\"\\n\"),Vue.h(_components.p,null,\"The glory is always there, and I will always be with you, wherever you are.\"),Vue.h(Hexagon,null,Vue.h(\"h3\",null,\"VIII\"),Vue.h(\"h3\",null,\"Written at the end\")),Vue.h(_components.p,null,\"I have written so much without realizing it. Perhaps, I think the more important experiences with her and the thoughts and ideas he brought to me should all be written here. Due to length and other reasons, I think this article should end here. There are many stories in life that are the same and different every day. Some of them I will present in other ways, and others I will just let remain in my memories.\")),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——Lingyu, December 24, 2024\"),\"\\n\",Vue.h(_components.h3,null,\"HiYku\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Born of love, by love undone.\"),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——HiYku, December 17, 2024\"),\"\\n\"),\"\\n\",Vue.h(_components.h3,null,\"Ann\"),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,'You wanted me to write what you called the \"final conclusion\" for you, so I wrote it. '),Vue.h(_components.p,null,\"I always have a question about this: I am almost the person you have chosen who has the least time with you and knows you the least. Why did you choose me, and what do you want to see me write? I think you should know that when you choose the people who write this section for you, you also choose the content that will be presented in this section. Many things about you, especially those that are generally considered bad, I only learned about them after you passed away. Perhaps if you hadn't ended your life so simply, I would have had the chance to hear you tell me these things in person, but there is really no chance anymore. I decided to write only based on my experiences with you while you were still alive. This is probably what you want, right?\"),Vue.h(_components.p,null,\"In addition, there is another difficult dilemma: it is difficult for me to describe what kind of person you are as you want, and it is difficult to summarize you with concise words and capable sentences. People's deviations and imaginations in their understanding of words and short sentences will deviate from your true self. So please allow me to recall and narrate some past events that have connected me with you and make some lengthy and vague evaluations. As for what kind of person you are, please let the friends who come to this page to mourn find out from these words. Of course, no matter who reads these words, they will feel that it is more appropriate to put them in the comments section, but please allow me to complete what you have asked me to do in the way that I can barely do. This is my privilege as a living person towards you as a dead person. If you were still alive, these things would not happen.\"),Vue.h(_components.p,null,\"The first time I met you and the only time I saw you was on August 12, 2023, when I had just ended a long period of hesitation and decided to start GAHT and get in touch with the transgender community. I still remember the scene of our meeting very clearly. At noon, I was sitting in a KFC seat with a window near the street opposite the Peking University Third Hospital and eating lunch. When I saw you push open the door and come in wearing a blue, pink and white mask, I unintentionally pulled out a chair to greet you. Later I discovered that I had actually been in contact with you in the online world for a long time. I am a nobody in the QQ group who dares not speak much, and I often just watch silently. Although you always say that you are numb to everything including tragedy, you always provide medication advice to those in need, always comfort those who are hurt, and always make decisive judgments and effective arrangements in response to crises. In my heart, you have always been a knowledgeable, lovely, respectable and approachable helper. You always try to be tolerant and understanding of everyone, and always do your best, even giving your all.\"),Vue.h(_components.p,null,\"At that time, as a transgender girl who was just starting out in many things, it was a great fortune for me to meet you. I regard you as a respected senior and a close sister. You would share some unique perspectives with me, give me GAHT advice, and teach me how to fight against the malice from every corner of the world... At that time, when you were in the active group chat, people were always arguing over something. I always feel something similar from your speeches, of course, yours is always much deeper than mine. This made me very interested in your ideas, but I am not good at communicating with people, so we agreed to have a serious chat during the winter vacation. At that time, I didn't know that all this would become impossible in less than a month.\"),Vue.h(_components.p,null,\"Although I was an eyewitness to the \\\"Werewolf Killing\\\" that took place on December 21, 2023, I still don't know the full story, let alone figure it out. At that time, I was attracted by your profound thoughts and gentle personality, and it was impossible for me to accept that you said such words and did such things. I was instantly disheartened and didn't have any desire to think or ask about it anymore. I chose to stay away from you quietly. But I never thought that just a few days later, I would hear the tragic news of your suicide. I never thought that I could only listen to your situation as told by others. I never thought that the separation on that day might be a real separation. At that time, I found that I was like a stubborn and sulky child. I didn't want to leave you at all, and I didn't want you to leave either.\"),Vue.h(_components.p,null,\"On December 26, I asked for a dextromethorphan medicine box to make a handmade gift for a friend in another group chat where you were, and you promised to give me one.\"),Vue.h(_components.p,null,\"On the 27th, you said that you forgot to send the express delivery due to an emergency. I simply thought that you were busy with something and didn't care about you at all.\"),Vue.h(_components.p,null,\"On the 30th, when I was opening the express package, someone had just told me that you had committed suicide. I hurriedly dug out the express delivery label from the trash can, wanting to keep it as a souvenir, but I didn't expect that I would tear your name neatly in the middle horizontally. All the anxiety, regret and sadness were concentrated in that moment. I was deeply afraid that all this foreshadowed an irreversible tragedy...\"),Vue.h(_components.p,null,\"I started to have a fever the day after hearing the news, a fever I had never had before. During this period, I could only repeat between pure drowsiness and pure crying with a high fever. Although there seemed to be some not-so-bad news during this period, my memory is really vague, and these not-so-bad news did not turn into not-so-bad facts.\"),Vue.h(_components.p,null,\"Finally, at 23:56 on January 1, 2024, the nebula, which used to be full of vitality, shining and changing, quietly dissipated in the endless darkness of the universe, became a part of the silence, and merged into the cold darkness.\"),Vue.h(_components.p,null,\"I read your will with a feeling that I don't know how to describe. There was almost nothing about you in it. It was all about your care, instructions and messages to your friends. When everything for you might be over, you were still caring about the people around you.\"),Vue.h(_components.p,null,\"I have some selfish desires that I am not ashamed of. If I had not left your personal group on December 21, 2023 because of those things, I would have been able to get your relics as a souvenir, and I would definitely have been able to hear a few of the words you wanted to say to me. In your last words, write what you want to say to your group members at the very beginning. Before reading the will, I didn't know that you cared so much about everyone in that group. My action of leaving the group and distancing myself from you not only caused me endless regret in the future, but also must have hurt you at that time. You didn't say anything to me in your will, but you chose me to be the one to write these things on those autumn leaves. I don't understand why, so just consider it as a punishment for me. However, compared with other people, the interactions between you and me are too few. Maybe you just feel that there is nothing much to say to me. I don’t know, or maybe you have simply forgotten.\"),Vue.h(_components.p,null,\"I followed my original idea and gave the quicksand mahjong made from the dextromethorphan medicine box you gave me to a friend instead of keeping it for myself as a souvenir. She was also sad that she didn't have the chance to meet you and really get to know you.\"),Vue.h(_components.p,null,\"It is only in the days when you were gone that I deeply feel your influence on me in every aspect of my daily life. Not only does my GAHT program look almost identical to yours, I have also unconsciously internalized many of your concepts, which factor heavily into my decision-making in life. Although I used to feel that your practice of burning paper, medicine boxes and changing gray portraits to commemorate the deceased was pretentious, I was away from home and could not attend the farewell ceremony to mourn you in person, so I don't know what other reasons drove me to do this for you. In addition to these natural actions, I can't help but think seriously about how I can become a person like you in my eyes. I want to be like you and share the beauty and goodness you bring to me with more people who need them. I hope I can do it.\"),Vue.h(_components.p,null,\"I am still in my own predicament and see no hope, which makes me miss you even more. I've never told you this, but I guess you won't hate it. Whenever I feel hopeless for various reasons and find it difficult to express or communicate with others, I always wish I could hear what you would say about this situation. Even if I had talked to you more in the past, if I could remember more of your thoughts, I might be able to try to find a way out of them, and my helplessness might be alleviated. I also think that if I could internalize your outlook on life and your view on life, which may seem crazy to others, then I would be able to live freely.\"),Vue.h(_components.p,null,\"Many things have ended, but many things are still going on. Many people died, but many people still have to continue living.\"),Vue.h(_components.p,null,\"You often compare the past and future changes in the transgender community to an ongoing war, which I didn’t take seriously in the past. I thought it was a bit naive at the time. But for now, wish me good luck in this war, wish us good luck.\\nI don't know what kind of feelings I have for you, but I feel that at least I loved you.\")),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——Ann, May 4, 2024, cloudy\"),\"\\n\",Vue.h(_components.h3,null,\"Shinonome\"),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,\"With heavy hearts, we mourn the loss of a brave and resilient soul. Though her life was short, it was filled with unwavering struggle and defiance. She lived much like the words spoken by Big Boss in \",Vue.h(_components.em,null,\"Metal Gear Solid 2\"),': \"The loser will be liberated from the battlefield. And the winner... will remain. The survivor will live out every one of the rest of his days as a soldier.\" She was a warrior on this battlefield, and although she was unable to escape the cruelty of the fight, her spirit and determination will never be forgotten.'),Vue.h(_components.p,null,\"Her passing is not a defeat, but a different kind of liberation—freedom from the oppressive forces of a society that could not understand or accept her. She has been released from the endless battle. Her departure is not surrender, but the conclusion of an unjust fight. She no longer has to endure the pain and pressure that society inflicted on her. In the end, she has earned the freedom of her true self.\"),Vue.h(_components.p,null,'However, as the quote reminds us, \"The winner will remain.\" Her departure does not mark the end of her story. Her spirit lives on in each of us. She was a warrior to the very end, holding onto strength and courage. We will continue her mission and fight for those still struggling on this battlefield. Her victory was the hope she brought to every transgender person, and the call for more compassion and acceptance in society.'),Vue.h(_components.p,null,\"May her soul find peace in another world, free from the confines of this one. Her legacy will continue to inspire us to carry on her unfinished work and keep fighting for a better future.\")),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——Shinonome, December 31, 2024\"),\"\\n\",Vue.h(_components.h3,null,\"Mik\\xe4\"),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,Vue.h(\"blockquote\",null,Vue.h(\"p\",null,\"Meowvelous Demise\"),Vue.h(\"p\",{style:\"text-align: end;\"},\"——Xu\"))),Vue.h(BlurBlock,null,Vue.h(_components.p,null,\"I don’t know why Mik\\xe4 did not appear in XingZ60’s epitaph designation,\"),Vue.h(_components.p,null,\"so I was thinking that if this was the case, maybe it would be better for me not to comment.\"),Vue.h(_components.p,null,\"However, there seems to be a saying in it that “anyone who wants to write can write it.”\"),Vue.h(_components.p,null,\"Oh, and it seems that I shouldn’t mention it.\"),Vue.h(_components.p,null,\"After all, this part of the so-called suicide note was written by me personally after spending several afternoons looking at Jinji Lake outside the window and listening to XingZ60’s voice.\"),Vue.h(_components.p,null,\"And maybe because of the above, my departure from XingZ60 happened again. There seems to be a close connection that cannot be ignored.\"),Vue.h(_components.p,null,\"Maybe it also includes the so-called role-playing game of Fake Haku.\"),Vue.h(_components.p,null,\"After all, playing with her for so long, it literally means playing to death.\"),Vue.h(\"br\"),Vue.h(_components.p,null,\"I didn't expect that I would lose so completely in this two-sided game.\"),Vue.h(_components.p,null,\"But I also didn't expect that I lost the two-party game and the other party didn't win.\"),Vue.h(_components.p,null,\"But who won? Think about it carefully. In fact, I, LingYu, KouHaku, and you both won.\"),Vue.h(_components.p,null,\"If you explain the reason, the originally short message will be too lengthy.\"),Vue.h(_components.p,null,\"I must mention it. Even the brain can understand it,\"),Vue.h(_components.p,null,\"so, Meowvelous Demise\"))),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——Mik\\xe4, January 23, 2025\"),\"\\n\",Vue.h(_components.h3,null,\"wing\"),\"\\n\",Vue.h(_components.p,null,\"I didn't know her very well, but in my opinion he was a good man who supported some disadvantaged people and did a lot of unnecessary and troublesome things. He once tried to suppress his feminine personality and claimed that he would die if he let it go. I thought hrt would make her a better person and encourage her to be herself, but I didn't expect this result.\"),\"\\n\",Vue.h(_components.p,null,\"Perhaps it would have been better to encourage her to correct his mistakes. In my opinion, he is a rational person, just like Zifeng, but they are both dead, okay. And they are all overdosed. Overdose is harmful!\"),\"\\n\",Vue.h(_components.p,null,\"It has been more than a year since then. I hope he can rest in peace.\"),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"——wing, February 9, 2025\"),\"\\n\",Vue.h(_components.h3,null,\"Baimao suki\"),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,\"My acquaintance with XingZ60 stems from my exploration of my own gender. We met during the exploration and had a lot in common. Perhaps we are of the same kind or have other similarities. We have become very familiar with each other after knowing each other for seven days. Just 72 days left an indelible mark on your life. \"),Vue.h(_components.p,null,'XingZ60 is a very mature person. When I expressed my anxiety about learning about weight, she not only gave me experience and help, but also said \"take it slow\".'),Vue.h(_components.p,null,\"At school, I often call or chat with her to ease the boredom of studying in the third year of high school, listen to them talk about various interesting things, and listen to their stories. From this we learn that XingZ60 is actually quite indifferent to life and death, which adds fun to the grand funeral. Perhaps it was because of depression that death was not far away from her, and perhaps this day would always come. But I didn't expect it to come so suddenly, after half a year of depression...\"),Vue.h(_components.p,null,'When I discussed my own spiritual exploration with her, she commented on my words as \"no hope\". But in her last words, she told me not to flip over. Maybe she was persuading me based on her own experience, but I still embarked on this difficult road.'),Vue.h(_components.p,null,\"From what others said, XingZ60 is more complicated and abstract than I had imagined. What I know is just the tip of the iceberg, either because of Yasasi or because of lack of time. But anyway, the second half of XingZ60 is as interesting as a game. I regret that I will never have the chance to meet you again, but in a corner of my heart there will always be a guy named XingZ60 teasing me.\"),Vue.h(\"br\"),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"The sunset will eventually set\"),\"\\n\",Vue.h(_components.p,null,\"The dream will soon be shattered\"),\"\\n\",Vue.h(_components.p,null,\"XingZ60 cuts through the sky and falls into the atmosphere\"),\"\\n\")),\"\\n\",Vue.h(\"p\",{style:\"text-align: end;\"},\"—— Baimao Suki, February 4, 2025\"),\"\\n\",Vue.h(_components.h3,null,\"__\"),\"\\n\",Vue.h(\"h3\",{align:\"center\"},\"Three sentences to follow the title\"),\"\\n\",Vue.h(\"details\",{style:\"margin-top: 0.5rem;\"},Vue.h(\"summary\",null,Vue.h(\"p\",{style:\"text-align: end;\"},\"__ /[] Written at 23:56 on January 1, 2024, when the collapse occurred\"),Vue.h(\"p\"),Vue.h(\"blockquote\",null,Vue.h(\"p\",null,'\"Eloi, Eloi, Lama Sabathani? ',Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-4\",id:\"footnote-ref-4\"},\"4\")),'\" And they hated their future more miserably. ',Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-5\",id:\"footnote-ref-5\"},\"5\"))),Vue.h(\"p\",null,\"This ugly world doesn't deserve her beauty\"),Vue.h(\"p\",null,\"《Maybe All Transgender People Are Really Vampires》\",Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-6\",id:\"footnote-ref-6\"},\"6\"))))),Vue.h(\"br\"),Vue.h(_components.hr),Vue.h(\"br\"),Vue.h(_components.p,null,\"2024.1.2 09.26 Tang Ze: Friends who want to say goodbye to XingZ60 can go to Changping Funeral Home to pay their respects today.\"),Vue.h(_components.p,null,'——XingZ60\\'s parents held a funeral for \"him\"'),Vue.h(_components.p,null,'2024.1.2 afternoon Blank: I plan to hold a simple funeral that truly belongs to \"her\" in the evening'),Vue.h(_components.p,null,\"——Blank initiated but not hosted, everyone spontaneously gathered strength to hold a small memorial ceremony for her\"),Vue.h(\"br\"),Vue.h(_components.hr),Vue.h(\"br\")),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.code,null,\"Under Construction\")),\"\\n\"),\"\\n\"),\"\\n\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"