"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Barron was a happy trans girl who studied drawing in Japan.\\nShe had a dream to open a manga studio.\\nBut unfortunately, due to family discord and her coming out, she was forced to give up her studies and return to China at the end of May 2023 after failing to commit suicide in Japan.\"),\"\\n\",Vue.h(_components.p,null,\"After returning to China, she lost almost all her income sources.\\nTo make matters even worse, she was unable to draw again due to her serious PTSD.\\nShe found some good friends in Guangzhou who could keep her company, and then lived for a short time in Beijing.\\nDuring her time in Beijing, although she was often bothered by finance and other issues, she was quite happy with everyone's comfort.\"),\"\\n\",Vue.h(_components.p,null,\"However, owing to financial reasons and her beloved, she returned to Guangzhou at the end of August.\\nShe and her beloved spent quality time in Guangzhou, although they had to engage in sex work to survive.\\nEven though she faced challenges in her relationship with her lover, she bravely confronted the trials of life.\"),\"\\n\",Vue.h(_components.p,null,'Barron once said that she was on a girl\\'s last tour.\\nTragically, she left us too soon and ended her own tour. During her journey, she once left such words, \"Really wish that someone would remember me.\"'),\"\\n\",Vue.h(_components.p,null,\"Rest well, Barron. We will all remember you.\\nHope you have a blissful trip to heaven.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"