"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Xiyin was an outstanding transgender woman. She was cute and gentle. She was a student majoring in electronic information engineering and was good at electronic design and programming. She was a genius in everyone’s eyes, but she also had times when she’s depressed or anxious. She didn’t like to show her emotions: In the school group chat, she was a positive girl who often helps answer questions about electronic design and programming.\"),\"\\n\",Vue.h(_components.p,null,\"She worked hard at college. Since her relationship with her family was bad, she hoped to support herself through part-time jobs and internships and also save funds for sex reassignment surgery. However, COVID-19 had seriously hindered her pace, causing her to fall into financial difficulties. This may be one of the reasons why she chose to commit suicide.\"),\"\\n\",Vue.h(_components.p,null,\"She also wants to be like a little girl who can’t be bothered to make an effort and needs company occationally. However, because of her identification (MtF) and the society’s increasing atomization, she had always been lonely. Her loneliness was increasingly magnified as both her and her MtF friend developed serious mental problems.\"),\"\\n\",Vue.h(_components.p,null,\"Her death caught people off guard. The night before, she had a simple dinner with some people in the school club. She was concerned about the issue of the family district in the school at that time\",Vue.h(\"sup\",null,Vue.h(\"a\",{href:\"#footnote-1\",id:\"footnote-ref-1\"},\"1\")),\", but she wasn’t able to see the issue resolved. We didn't learn of her committing suicide until her dormitory was surrounded by police.\"),\"\\n\",Vue.h(_components.p,null,\"I hope she can be a little girl accompanied by many people in heaven, living happily.\"),\"\\n\",Vue.h(\"ol\",null,Vue.h(\"li\",{id:\"footnote-1\"},Vue.h(_components.a,{href:\"https://www.bilibili.com/video/BV1GF41157DW\"},\"At the beginning of the COVID-19 lockdown, Students of Beihang university were restricted in entering and exiting the campus, but family members of teachers and workers living in the family district in the school were free to enter and exit. A few days after her death, people who lived in the family district and the students had an argument, and the school implemented a hard separation between the family district and the student area.\"),Vue.h(\"a\",{href:\"#footnote-ref-1\"},Vue.h(\"svg\",{width:\"16\",height:\"16\",viewBox:\"0 0 16 16\",version:\"1.1\",id:\"svg1\",xmlns:\"http://www.w3.org/2000/svg\",\"xmlns:svg\":\"http://www.w3.org/2000/svg\"},Vue.h(\"defs\",{id:\"defs1\"}),Vue.h(\"path\",{style:\"opacity:1;fill:#fff9f9;fill-opacity:0.0199483;stroke:#ff8373;stroke-width:1.5000;stroke-linecap:round;stroke-linejoin:miter;stroke-dasharray:none;stroke-opacity:1;paint-order:stroke fill markers\",d:\"m 10,4.0031 c 0,0 4.003714,0.3021906 4.001025,4.1458036 C 13.998336,11.992517 10,12.004973 10,12.004973 l -8,-0.0267\",id:\"path1\"}),Vue.h(\"path\",{style:\"opacity:1;fill:#fff9f9;fill-opacity:0.0199483;stroke:#ff8373;stroke-width:1.5000;stroke-linecap:round;stroke-linejoin:miter;stroke-dasharray:none;stroke-opacity:1;paint-order:stroke fill markers\",d:\"M 3.3112984,10.696288 2,11.978273 3.2812828,13.265655\",id:\"path2\"}))))))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"