"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({p:\"p\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"Xiyin is an outstanding transgender woman. She is cute and gentle. She is a student majoring in electronic information engineering and was good at electronic design and programming. She is a genius in everyone's opinion, but she also has depression and anxiety. She didn't like to show her emotions. In the school group chat, she is a positive girl who often helps answer questions about electronic design and programming.\"),\"\\n\",Vue.h(_components.p,null,\"She worked very hard at college. Since her relationship with her family was bad, she hoped to support herself through part-time jobs and internships, and save funds for sex reassignment surgery(SRS). It is a pity that the COVID-19 and the measure token by Chinese mainland government had seriously hindered her pace, causing her to fall into difficulties. This may be one of the reasons why she chose to commit suicide.\"),\"\\n\",Vue.h(_components.p,null,\"She is also like a little girl who occasionally can't be bothered to make an effort and needs company. It is a pity that she has been walking alone in as an male to female(MtF) and in an increasingly atomized society. Although she also has a similar person growing up with her, her loneliness is increasingly magnified as both of them fall into serious mental problems.\"),\"\\n\",Vue.h(_components.p,null,\"Her death caught people off guard. The night before, she had a simple dinner with the schoolmates she knew in the club. She was concerned about the issue of the family district in the school at that time\",Vue.h(_components.a,{href:\"https://www.bilibili.com/video/BV1GF41157DW\"},\"^1\"),\", but she couldn't wait until the issue to be resolved after her committing suicide. We didn't learn of her death until her dormitory was surrounded by police.\"),\"\\n\",Vue.h(_components.p,null,\"I hope she can be a little girl accompanied by many people happily in heaven.\"),\"\\n\",Vue.h(_components.p,null,\"[1]: At the beginning of the COVID-19 lockdown, Students of beihang university were restricted in entering and exiting the campus, but family members of teachers and workers living in the family district in the school were free to enter and exit. A few days after her death, people live in the family district and students had a dispute, and the school implemented a hard separation between the family district and the student area.\"))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"