{"comments":[{"id":-3,"content":"\n**来信由三位主持人联合回信，不署名；来信量甚大，不能做到一一回复，还请谅解。**","submitter":"One Among Us","date":"Mar 15, 2024"},{"id":16035,"content":"在當今這個逐漸變得保守的世界中，勇敢地面對自己，並驕傲地站在陽光下，這便是最好的「現身」方式……","submitter":"阿雪","date":"Mar 16, 2024","replies":[{"content":"面对自己是骄傲与力量的开始。","submitter":"Maintainer"}]},{"id":16036,"content":"敬启：\n无论要遭受怎样的痛苦，无论要面临怎样的困难，请一定要顽强的去坚持下来，请振翅吧，直到能够飞翔。","submitter":"举荷风","date":"Mar 16, 2024","replies":[{"content":"困难的时候，一句振奋的话语能改变很多。谢谢你依然坚持爱与希望。","submitter":"Maintainer"}]},{"id":16037,"content":"我们之所以现身，是因为现在虽然是漆黑的深夜，但是我们的信念坚信曙光即将来临。我们现身是为了得到大众的爱，是渴求社会给我们一个大大的拥抱，是祈祷每一位酷儿都可以健康快乐。我们每一个人都希望获得爱，但是更希望人性之光早日来到，让自由、光明、幸福和爱尽情的拥抱我们每一个人。","submitter":"巴克莱.巴拉克里希南.穆黛.卓锦万代兰","date":"Mar 16, 2024","replies":[{"content":"我想你已经知道了一个事实：世界很多时候其实不会主动拥抱你。所以比起空洞的鼓励，我更想说：拥抱世界吧，即便世界不一定在拥抱你；这很不公平，但有时只有从我们开始传播爱，爱才会开始流动。","submitter":"Maintainer"}]},{"id":16041,"content":"hi，\n我是珏，今年 33 岁了。\n深刻体会到跨性别这个家庭在一步步变得越来越好，越来越完善，\n时代赋予了我们做自己的可能，\n我也从中获得完成梦想的信心。\n从 HRT 是什么都不知道，到有信心准备 SRS，真的很感谢姐妹们的帮助，\n我年纪大了，算是高龄跨儿了，与原生家庭的“难舍难分”，与自己“逻辑自洽”对于我来说都是重重考验。\n由于年纪大了，出柜时间也短，HRT 时间也不长，面临的实际社会问题就变得很多，职场歧视啦，社会歧视啦，balabala～\n但我真的没后悔过，我希望都可以越来越好～我希望今年可以距离变成真的女孩子更进一步，做进一步断亲，与自己和解，做好自己做好该做的事。","submitter":"珏","date":"Mar 17, 2024","replies":[{"content":"加油！感谢你保持自我到这个属于你的时代，感谢你还能与更多年轻朋友共同成长。不要在意自己的年龄，未来现在才开始，即使是33岁才会遇到的挫折，也能成为你与后来者人生的宝贵经验。","submitter":"Maintainer"}]},{"id":16044,"content":"少女的末路还不会结束，我将会坚持下去，直到自己筋疲力尽，或许有那么一天我会成为最想成为的样子","submitter":"猫猫（苏小喵）","date":"Mar 17, 2024","replies":[{"content":"在那一天来临之前——和之后——我们会一直陪着你的。","submitter":"Maintainer"}]},{"id":16045,"content":"很遗憾在这个页面上看到很多朋友，但是我不会忘记未曾见面的朋友，一面之缘的朋友，人人皆友，人人亦友祝你们平安，快乐。愿我们终将能去往阳光普照之所。","submitter":"Forget","date":"Mar 17, 2024"},{"id":17004,"content":"杀掉错误扭曲的观点 // 正视真正的我 爱真正的我 // 无论是零分还是一百分 // 我都有无限的可能 // 无论躺平 还是全力奔跑 // 都为我加油 // 我是具体的人 是活在当下的人 // 只用心研究不草率下结论 // 才能了解真正的我","submitter":"Anonymous","date":"Mar 17, 2024","replies":[{"content":"爱你的自信！我也愿意更了解真正的你，愿你未来畅通无阻；也希望你的自信能感染更多朋友。","submitter":"Maintainer"}]},{"id":17007,"content":"相信自己的内心，寻找想要的世界。\n","submitter":"冬日暖阳","date":"Mar 17, 2024"},{"id":17009,"content":"祝大家都能成为自己想要的模样，收获快乐和幸福。","submitter":"水中月","date":"Mar 17, 2024"},{"id":17011,"content":"从窗户纸般薄的丑陋蛹壳中挣脱；\n伤痕累累的躯体里闪烁出蓝粉白的光。","submitter":"Anonymous","date":"Mar 17, 2024"},{"id":17012,"content":"丑陋的蛹下\n不知如何捅破这窗户纸般薄的壳的躯体\n恐怕也会在某一天\n骄傲地在蓝粉白的光芒中\n展现美丽而又伤痕累累的自己吧\n","submitter":"Nonexistent Riricho","date":"Mar 17, 2024","replies":[{"content":"爱妳. ","submitter":"Maintainer"}]},{"id":17013,"content":"你们好，我不确定我作为非跨性别者能否至信，我通过与跨性别者的深入交流以及查阅不少资料，深刻认识到你们的不一致的性别认同是难以扭转的，这并不是对性别基于自主意愿的主观选择，而是一种自小存在的性别不一致。虽然我作为非跨性别者实际上难以对你们的性别焦虑感同身受，但我确实看得出来并体会到你们在现实中面临着不少现实中的困难，这也彰显了跨性别者之间的社群交流的重要性。\n最后祝愿大家能够战胜抑郁和焦虑，努力活下去，找到属于自己的人生路。","submitter":"汉正街地铁站","date":"Mar 18, 2024","replies":[{"content":"谢谢你能够表达自己的理解和支持。实际上，很多时候对于各种少数群体的恐惧和偏见，不一定来自于非当事人的不理解，而只是【当事人以外没有人敢公开支持当事人】，仅此而已。不能感同身受不重要，人各有命，经验本就是不能完全共享的；但是我必须要感谢你站出来为了全体跨性别伙伴们说话。谢谢你，祝你「求则得之，寻则寻见」。","submitter":"Maintainer"}]},{"id":17015,"content":"愿我们都能续写最甜最好的故事，永远不要有不得不结束的终章。","submitter":"502","date":"Mar 18, 2024"},{"id":17016,"content":"如同光可以填满整个屋子，爱也可以使一个缺失的灵魂变得完整。","submitter":"LaN","date":"Mar 18, 2024"},{"id":17017,"content":"我光只是性取向“不正常”就感到极大的压力了，觉得自己不正常、觉得同性恋很恶心、希望自己只是病了、希望所谓的性少数其实是一种能治好的精神疾病。每隔一段时间我就会突然对自己“不正常”的性取向感到羞耻、恶心、希望自己是一个“正常人”。不知道这种情况是不是跟跨性别朋友们说的性别交流类似，只不过我的是对自己的性取向不满意？我的性取向“不正常”，单是因为这个我就被困扰的不得了，很难想象跨性别们的生活有多难。我真心希望有一天性少数可以不被区别对待，不再是“不正常”的人。我觉得很奇怪，为什么明明其他动物都不会对所谓的性少数作出排挤/歧视的行为，而人类却对咱们充满了恶意？为什么？人类真的好难懂…这世上永远没有绝对的公平。","submitter":"莱铭Lemink","date":"Mar 18, 2024","replies":[{"content":"人总说兽性残暴，但有思想的恶才算残暴。他们手捧礼义廉耻，朝我们啐出一口仁义道德。可被排挤的少数有错吗？所谓的「不正常」真的可以被定义吗？我们本身无罪，但被多数人以恶意强加一层罪恶。亲爱的你，不要束缚在被强硬套上的锁链，我们永远是一体的，每个人微小的力量集合成星河，我们也可以逃脱黑暗迎来璀璨。在我们伸展的前方，仿佛洒满了阳光。","submitter":"Maintainer"}]},{"id":17021,"content":"《无题》 // 前方的路 // 布满了脚印 \n偶尔 // 还能看见些许白骨 // 更耀眼的 // 却是道路尽头的光 \n我抬起头 // 向着光跑去 // 不知何时 // 自己的身边布满了荆棘 \n血 // 流了出来 // 泪 // 无法止住 \n乌鸦盘旋 // 将那光芒掩去 // 只剩下 // 几缕细丝 \n闭上眼 // 转过头 // 想要逃避 \n却听见 // 「TA」们的声音 \n“走下去吧 // 向着自己 // 向着火焰 // 向着完美的明天” \n睁开眼 // 发现手中多出一把利剑 // 抬起手 // 向着荆棘 // 向着乌鸦 // 挥出剑刃 \n蓝色的光 // 粉色的光 // 白色的光 // 烧尽了荆棘 // 驱散了阴霾 // 看向路的起点 \n我留下了这把剑 // 留下「TA」们的祝福 // 随后 // 向着光芒跑去 \n最终 // 消失在光芒之中 \n………… // ………… // ………… \n我 // 是「TA」们 // 「TA」们 // 是我 \n我和「我们」 // 不会忘记","submitter":"RainSummer","date":"Mar 19, 2024","replies":[{"content":"踏棘而行，向火而生。好诗，好文笔。拥有生命力也拥有主动性，正是意识到自己所处，才得以迈出作为自己的第一步，你是勇敢的；你诗中「TA」们，那些前人、或许是那些逝者，「TA」们是无处不在的。去年的『银河铁道之夜』朗读会，我特别喜欢的一个概念是：宫泽贤治借那篇童话表达，现世与他界密切联系，哪怕是一梦之间；逝者与生者总有机会共存、共鸣、共斗，逝者虽然离去，留下的东西是无价的。星星引路，航向天明。","submitter":"Maintainer"}]},{"id":17027,"content":"去年的這個時候我被逼上絕路，一度曾想過了結自己，但在那之前怎麼都想要做一回自己，哪怕一次也好。\n我靠著手上唯一的一點存款去做了喜歡的髮型，那段時間的生活沒有受到陌生的攻擊、歧視和騷擾，也有很友善的朋友一直提供幫助，那時候我想，要是現在死了也值了。\n你說後來怎麼樣了？後來我孤注一擲，和死神賭了一局，最後居然還贏了，我猜這是長年的隱忍和創傷下積累的一點點運氣。好運總有用光的時候，至少現在我生活在一個再也不需要隱藏和忍耐那些歧視的地方，全部重新開始，這一次是真正的作為我自己而活著。\n希望我多出來的好運能分享給每一個有需要的跨兒朋友。","submitter":"匿名","date":"Mar 21, 2024","replies":[{"content":"叹服于你的勇气，祝好运时刻伴随你。愿你辟开的道路永远宽阔，不被杂草淹没。","submitter":"Maintainer"}]},{"id":17032,"content":"致勇敢现身的同志们：\n星光与你们同在，大地为你们铺路，大胆走向属于自己的路，无惧眼光，不怕困难，为自己心中的理想奋斗。","submitter":"程天明","date":"Mar 22, 2024","replies":[{"content":"我们今年因为各种制约，总共策划人数是大约二十个人；希望这个数能变成两百个、两千个，社群能从我们开始越来越团结、越来越相连，希望欢乐与庆祝到达每个人的耳畔。","submitter":"Maintainer"}]},{"id":17033,"content":"去年今日此门中，人面桃花相映红。人面不知何处去，桃花依旧笑春风。\n你看你用一种决然终结自己的生命，以期伤害过你的也随你终结。\n可是你的光才照亮了多久呢，又被多少人遗忘呢\n公无渡河，公竟渡河！堕河而死，当奈公何！","submitter":"匿名","date":"Mar 22, 2024","replies":[{"content":"也许ta并没有离开太远，仍在或远或近的某处点亮灯火。愿你能永久守望这微光，最终照亮大地。虽绵力，但也请允许我们同你一起记住。","submitter":"Maintainer"}]},{"id":17037,"content":"阳光总在风雨后，坚持撑过这段最黑暗的时刻，我们终将迎向光明！","submitter":"车风","date":"Mar 23, 2024"},{"id":17038,"content":"我们即是希望本身","submitter":"无常","date":"Mar 23, 2024","replies":[{"content":"我们存在的意义即是爱与革命。","submitter":"Maintainer"}]},{"id":17040,"content":"||这算不上什么故事，因为它是发生过的事实。\n我曾经算是一名天赋党，因为出色的伪音，在出租车上和司机聊了一路都没被看出来，那个时候还在初中，初中女生比较成熟，比起满口黄腔，喜欢扒裤子看我算不算男人的男生来说，简直是天使，她们那时候就算谈了恋爱也不会疏远我，我和别的女孩子好像没有什么区别，很多人到现在上了大学再重逢，本来说可以让我在她那里当女孩子，但是一旦谈了对象，那个男的只要有一点不满意，她就会立马让我避嫌，尽管她认识那个男生的时候，代表他们，告诉我女孩子之间不用避嫌。\n或许我一定要面临这样的情况，就算做了很完整的手术，她或者他，还是把我当成感情的潜在隐患，只会选择伤害我，而不在乎，我是不是怕她被渣男骗，入土可能她都不会再来，那些姐妹之间的诺言，好似不曾有过。现在我也没有很女孩子的外表，都说不歧视，不区别对待，可是谁又知道，社会性别再像，那也不是女孩子，更何况生理上还不是呢。||","submitter":"yunlu","date":"Mar 24, 2024","replies":[{"content":"亲爱的你，「♪ni是你或是妳都行，会有人真心地爱ni♪」——玫瑰少年唱出的是我们。当我们陷落在泥土里，陷落在黑夜里，陷落在无尽海里。可是我们用尽全力抓住的藤蔓，藤蔓缠绕树干抢夺阳光生长，我们终会开出荆棘的玫瑰。美是一种型态，是一个形容，但它绝对无关于性别。我们无法完全去除生理特征，我们无必要回忆过去让自己缠绕苦痛，承诺没有保鲜剂，它不泡在福尔马林里。重要的是，要活出自我，要有爱有希望。请相信自己是美丽的，经历的创伤也会在阳光下展露光芒。","submitter":"Maintainer"}]},{"id":17041,"content":"杂谈\n||好像变得麻木了，身边的人一遍又一遍地死去，最终还是死掉了。你还活着吗？对未来的期待？不是。我想抱紧死去的人并且被没有死掉的大家抱着，，，其它东西会让你死掉吧？我并没有办法，我会在舒适度和目标之间权衡。焦虑是不可避免的，不过就算考虑最糟糕的情况，我也是有获得最后平静的办法 (笑)。在想着“去做些什么吧，可不能靠时间和别人的改变，而且，大姐姐要做好榜样才行。\"\n我的经历没有那么凄惨。开始的时候谢谢大家的关心了，但渐渐想回报别人的温柔了，到现在变成了同辈大姐姐。然后未来的话，应该是前进着最后死掉了。一生的话，和被剪掉花朵的玫瑰差不多吧？大家会是怎么样的呢？蛮期待的。\n在其它方面也没有什么很好的建议。就，别太痛苦了。祝福的话是不切实际的，那就，别死掉了大家。 ||\n燕秋\n2024/3/24","submitter":"燕秋","date":"Mar 25, 2024","replies":[{"content":"||死掉了就太可惜啦。陪你多走一程，好不好？||","submitter":"Maintainer"}]},{"id":17043,"content":"“希望这个世界上的坏事彻底消失”\n“希望这个世界能够变得越来越好”\n“希望所有生命都不再遭受世间的苦难”\n“希望这个世界永远都有希望”","submitter":"雪秋小可爱@XUEQIUxka","date":"Mar 25, 2024"},{"id":17044,"content":">日出从深黑绽放，万物裂痕映透阳光\n>**愿我们都能不负此生**\n\n","submitter":"Catherina","date":"Mar 25, 2024"},{"id":17045,"content":"愿终有一日，跨性别朋友们可以无所顾忌地生活在阳光下，可以再也不用承受本不该承受的苦难。\n愿终有一日，大家可以不再惧怕出柜所带来的风险，大家可以正大光明地现身，去享受这个世界。\n愿终有一日，大家可以在蓝天白云之下，编织出自己粉红色的梦！\n愿终有一日，苦难皆过，世间大好，\n愿终有一日，厄海渡尽，云开月明！\n诸位都是渡厄的朋友，渡厄会一直陪着大家，陪着朋友们，守候着，等到这一天！\n——From 渡厄大君 RulerDue","submitter":"渡厄大君","date":"Mar 25, 2024"},{"id":17046,"content":"终有一日，我们必能夸耀身姿，屹立于众人之中。\n待那时，你我皆将化作苍穹之星，璀璨闪耀。","submitter":"Soran","date":"Mar 25, 2024"},{"id":17047,"content":"加油吧布丁姐姐...咱永远支持你 www","submitter":"铃华酱","date":"Mar 26, 2024"},{"id":17052,"content":"你好啊我是一名福建的信息学竞赛选手 hhoppitree，是一位还没有想明白道路的初三同学，明年就要上高中啦！有成为 mtf 的想法，不过…还很犹豫喵！我现在年龄还很小，有一定天赋，在机房经常被 Rua，家里人也比较开放，心里状态也比较良好。如果真的要走到那一步的话可能还是有一定优势的，日后还请多多关照喵！如果高一高二的国赛发挥好一点的话，可能就能去北京了，那里的氛围会好一点吗？我很迷茫。总之，还是走一步看一步吗？最后，希望大家都能过上自己想要的生活啦！","submitter":"hhoppitree","date":"Mar 26, 2024","replies":[{"content":"祝贺你迈出了认识自己的第一步。可是，傲慢和偏见仍然在社会生活中如影随形，很多事情也不一定像一开始时一样顺利。无他，我唯独希望你清楚思考自己并理解自己，不管做出什么选择，深思熟虑过的、坚定的，总比无知、盲从的好。另外，照顾好自己，也照顾好家人、身边人；过好自己的生活，乐观、积极的生活总是更让人信服的。祝你国赛顺利，也祝你找到自己的生活，和命运共舞！","submitter":"Maintainer"}]},{"id":17053,"content":"既然已经选择了这条杵逆天命的道路，那就应该与命运抗争到底。概许我们奋斗半生所追求的梦想，只是别人与生俱来的罢了。","submitter":"hhoppitree","date":"Mar 26, 2024"},{"id":17054,"content":"所有的跨性别人群大家好啊！你们不是一个人，在这条道路上，一定会有人陪着你走下去的喵！","submitter":"hhoppitree","date":"Mar 26, 2024"},{"id":17058,"content":"蓝色的星球绕着恒星公转了一周，又一年的现身日也悄悄地到来了。记得去年这段时间我还是个普普通通的学生——也不能算普通，那会我双相还没控制好，家里人一合计，于是我三十一号白天被拐进了精卫：所以我或许是最晚看去年晚会录播的人吧（笑）。往后和往前的事情就都平平无奇了，我在全国走了走，也常去医院，花了一点时间和经历探索了自己的认同和生活，也在去年十月做出了那个很重要的决定（当然也少不了来自家里的各种磨难就是了）。希望大家都有坚定的信念来对抗绝望，也祝愿所有人都能靠自己的努力过上想要的生活。喵！","submitter":"大猫猫#南河三","date":"Mar 26, 2024","replies":[{"content":"感谢你在逆境中依然支持我们，也很高兴看到你的生活逐渐回归自己的控制。借你吉言，希望大家都在取回自己生活的旅途上更加顺利，喵！","submitter":"Maintainer"}]},{"id":17059,"content":"这个世界其实挺好的，但是也挺差劲的。\n认识的，或者不认识的。还在的，或者离开的。\n无论如何，请相信奇迹，至少能带来希望\n爱与性别无关\n至少\n我们要留下存在的痕迹\n然后对着这个世界反抗\n对着这个世界 say no\n勇敢的做自己\nI wish I could hug you tillyou're really really being free\n","submitter":"麻烦制造型瓜瓜","date":"Mar 26, 2024"},{"id":17060,"content":"致 看到信的每一个你:\n谢谢你又努力生活了一年。对我来说，这是我吃糖，穿到裙子和参与线下见面的第一年，但是也是被家长发现，被迫断糖和住院的一年。不过至少，我现在和你一样，依旧在努力活下去。很多时候，活着本身，就是一个充分的证明，证明了我们不是什么劣质产品，也能够拥有生活。活着的每一天，或许都是一个挑战，但是挑战不是放弃的理由。生活即使困难也并非不可战胜。最后，希望新的一年能认识更多的你，并且一同努力活下去，给这个讨厌的世界一个属于自己的证明。\nAra","submitter":"Ara海渊瑚","date":"Mar 26, 2024","replies":[{"content":"很抱歉预整理信稿的时候漏掉了你的信，没能读出来。活下去，青山在，人未老；活下去，向世界顽固地证明我们的生命力。","submitter":"Maintainer"}]},{"id":17061,"content":"我是一名来自江苏省苏州市的跨性别女性。我想向大家讲述我自己的故事。我的真实姓名听起来很女性化，从小开始，我就经常被老师、同学认作女孩子。当时的我虽然还未能探测出自己内心的真正性别，但我会有一种奇妙的舒适感。可能这就是我心灵被探动的开始。\n初中的时候，当时正是 JK 制服最火的一年，也是我性别焦虑逐渐加大的开始。那个暑假，我看着网上大家的穿着，自己却无法或是说没有勇气去这样穿出门，也无人可以向其倾诉。那一年我开始有了抑郁症状。中国的学生普遍不允许（身份证性别）男性留长发，更是让我产生厌学、与学校领导教师对干等情形。\n2023 年 2 月 7 日，在当时与父母发生了一次穿搭方面的冲突后，开始了 HRT 和全面出柜。我父母此时也是非常不理解我，我父亲试图用一些手段来镇压住我，随后在 2、3、4、5、6 月的无数次争端后，它们它们发现无法改变我，最终放弃了干涉。\n我也在朋友的指引下预约了 SRS 手术\n2023 年 11 月 8 日凌晨 1 时，泰国曼谷，我从手术中醒来，我终于摆脱过去 18 年的错误身份，将以全新的面貌生活下去。\n2024 年 3 月，我选择再次来到曼谷，我将在泰国学习泰语并争取在泰工作定居，亦可为来泰手术的小伙伴提供引领和向导服务\n谢谢大家！\n","submitter":"Strawberry小草莓","date":"Mar 27, 2024","replies":[{"content":"很高兴你在渡河后，能将扶助他人渡河作为己任！你是真正的活动家！","submitter":"Maintainer"}]},{"id":17068,"content":"活下去吧。","submitter":"Anonymous","date":"Mar 27, 2024"},{"id":17069,"content":"我们即是希望本身","submitter":"无常","date":"Mar 27, 2024"},{"id":17070,"content":"如果你要写 Nix，你就不能只写 Nix。\n\n你要写 NixOS 的非 FHS 环境，环境变量里$PATH 长长，无法运行的虛假 ld 加载器，steam-run 启动万物。\n\n你要写庞大的/nix/store，可复现\n推导的 sha256，read-only 的/etc。\n\n你要写 hydra 昼夜轰鸣，镜像站的网络流量奔涌不息，翻不到尽头的 cachix 订阅和公钥。\n\n你要写无数仓库里的 flake.nix，常年 5k+ open 的 issue，半年无人问津的 PR。\n\n你要写闪烁的电脑屏幕，账户名上的鱼板，堆积成山的药盒，深夜的一声叹息。\n\n——献给所有 TGD 的 NixOS 用户，和所有开源社区贡献者们，感谢并敬佩你们。","submitter":"Cryolitia","date":"Mar 27, 2024","replies":[{"content":"愿代码与数据库构成你们身躯不灭的一半。","submitter":"Maintainer"}]},{"id":17071,"content":"「以卵擊石，在高大堅硬的牆和雞蛋之間，我永遠站在雞蛋那方。無論高牆是多麼正確，雞蛋是多麼地錯誤，我永遠站在雞蛋這邊。」一村上春樹 \n縱使最後可能會徒勞無功，我們卻依然勇往直前，只為那僅存的希望...\n方法或方向縱使不同，但目標永遠是一致的。\n加油。","submitter":"上善若水","date":"Mar 27, 2024","replies":[{"content":"那么我用自己写的一首诗来与你共鸣好了：烧毁草坪落满十字架/太阳干柴烈火地作恶/我们被着耻辱/被驱赶出境外的失乐园。我们曾被驱逐的，被摧毁的，被倾塌的，在某一个时段都会催生出以坚韧与苦痛的种子，我们在风雨中发芽，被践踏中生长成参天大树。我们的森林是独属于我们的乐园，我们在其中赤裸、舞蹈、歌唱。亲爱的你，相信我们一定会变成茂密的丛林，烧不尽，砍不断，作为独特的美向世人展示我们的疮疤，我们的泪痕，和我们永远坚强的内核。我们深深扎根与土地，我们永恒且绮丽。","submitter":"Maintainer"}]},{"id":17072,"content":"我们用鲜血染红太阳，又用孱弱的肩膀将它托上山岗，于是阳光普照大地，百花在大地上绽放，每一朵都有着不同的色彩\n而在光明之下，我们将欢笑，我们将歌唱，我们将沁透了淋漓鲜血的苦难岁月埋葬\n为着这个明天，我们走在骄傲的路上，我们轻轻的掩埋朋友的尸首，将泪水变做蓝粉白的花朵，然后顶着凄冷的北风，又继续上路了\n而这个夜晚，这个向着阳光前进的夜晚，我们将花朵都插在篝火的边上，于是花朵变成了挡风的高墙\n你看，篝火必必剥剥地响着，它更旺了\n于是，朋友般的篝火，和篝火般的朋友，温暖着我们彼此\n于是，即便是再凄冷的北风，也变成了羸弱的孬种，再不能夺走大家心中的暖意了","submitter":"L.F.Reisen","date":"Mar 27, 2024","replies":[{"content":"这首诗歌情绪激昂，以至于让处在社群中的我感到爱与勇气。那我也回赠一首小诗吧：天空什么时候是蓝色/我只见过/灰色 黑色/和被血色染红的/等待一场无妄的等待/迷茫着没有方向/我们由着蝴蝶引路/走入山林/在路途中寻找同类/那些苦难岁月里/伤疤是一个个难以跨过的丘壑/我们牵着手/迈着步子/伤疤也会被抚平/牵着手的我们/走到没有尽头的地方/看一片无尽的蔷薇花丛/我们生如夏花/理应绚烂绽放/淡蓝色的天空/火红的蔷薇/在无限的天边交接/此后朝暮与岁月并往/我们一同行至天光。","submitter":"Maintainer"}]},{"id":17073,"content":"在阴霾缭绕之中 欲拨去重重迷雾 // 我在窥见那灵魂 躁动不安。\n在绳线缠绕之间 欲挣开命运枷锁 // 我在打破那镜像 非我而生。\n裹挟——在世俗洪流之中。 // 唯有百分的顺从最不费力气 // 而试问那洪流 // 究竟要流向何方呢？\n痴狂——在装腔作态之下。 // 唯有万般的点头最赢得赞誉 // 而试问那姿态 // 究竟是心之所向吗？\n二极管的聚合 自诩正义的「多数」的狂欢 // 人们歌颂着 那多样的灵魂 // 却又对 ##%% 闭口不言\n三磷酸的传递 恒久不变的「主流」的呓语 // 人们赞扬着 那先驱的精神 // 却又对 %%## 嗤之以鼻 \n「或许，投降的不应当是我们。」\n所以 // 我欲现身于「跨越」之中\n以一缕耀眼的阳光 // 击碎那亘古的屏障\n所以 // 我欲现身于「跨越」之中 // 在螺旋的时空中 // 越向上越要努力张开翅膀\n所以 // 我欲现身于「跨越」之中 // 跨越每一双有色眼镜的束缚 // 在真正的彩虹中舞蹈\n所以 // 「如果你们都能记住我的名字」—— // 为无限的时间和空间—— // 共同现身于「跨越」之中吧——\n脱去枷锁的命运 // 终末于湛蓝的深海 // 自由的灵魂 // 去仰望粉白的星云\n\n—— 神楽坂 零音，2024/3/27","submitter":"神楽坂 零音","date":"Mar 27, 2024","replies":[{"content":"先驱的中心在于实践者，正义的中心在于当事者。我把这篇来信放在今晚的前半，因为我觉得这首诗恰好是做了「现身日晚会为什么要办」的最好注解。只需一缕阳光、一些短暂的「现身」，人们便能踏出世俗的洪流，舍弃偏见，记住活生生的「名字」和存在本身。这难道不是最简单的吗。","submitter":"Maintainer"}]},{"id":17074,"content":"If the bleak-eyed rosy mind again hears the relentless daily sound of tidal blood\nShe will unbraid the double strand of Demiurge's hair into strings of Dagda's harp\nand wait for the return of wild geese to the grassy heart of northern shores.","submitter":"黄心","date":"Mar 27, 2024","replies":[{"content":"一首浸淫在古代意境中的自由诗。试译：凄凉的玫瑰色心儿哟，若她再次听到无情的、潮水般的鲜血的声音/她将解开德谬哥那双股儿头发，再编成达格达那竖琴的琴弦/等待大雁回到北方海岸的覆草的心脏。——翻得不好，还请见谅。（大概要用北方方言读。）哎呀，浓重的凯尔特神话意境。我听说达格达的竖琴使任何听到它的人或欢笑，或悲伤哭泣；使夏天或冬天按时到来，使浴血返家的战士忘记疲倦。或许这就是思念与魂魄的力量；或许这就是我们应有的力量。待朝雾散去，心上人会回到青绿的大地上。祝你幸福。","submitter":"Maintainer"}]},{"id":-3,"content":"    呐，不会写诗也不会鼓励别人，讲述一下自己的故事/发表一些评论好了。也许啰嗦了一点，写的也挺乱的，对不起了。我也没希望真的能上晚会，知道在某个时候，某个地方，有也许能理解我的人看到了这些文字对我而言就足够了。还有我可能太只顾着叙述真实感受了，在写的过程中自己精神崩溃了好几次，断断续续写了好几天，别人看了可能也会被触发吧。对不起了。\n    说到“现身”，其实我最初的经历并不是跟性别有关的吧。没办法，到青春期开始发育了之后我的性别认同跟我的指派性别并不一样这个 issue 才变得突出了起来吧。而我自幼就是明显的神经多样性。管他呢（恼），反正神经多样性和跨性别也有很多交集的地方，要是嫌跑题了把这段编辑掉好了，我觉得可以作为一个铺垫。\n    我从幼儿时期就「不一样」。最开始似乎一切都好，比如我不像 autism spectrum 容易语言迟缓之类的，反而学会说话比平均要早的多。然后大家对我的认识就打下了一个「神童」的基调。我很沉迷看书，小学就学了中学的东西，初中就学完了大学高数入门线性代数微积分一条龙（不过等到真上了大学差不多又全都忘了就是了（恼））。然后成绩严重偏科，比如说语文阅读这种我就是拼了老命也理解不了里面的人物都在干什么。我一直都是上课不听课，作业不认真写。如果一个普通的学生这样子 ta 早就被老师家长整死了，但是不管是老师，家长还是同学甚至其他人，评价都是一致的：“他聪明，不一样，反正他都会，管他干什么呢，你们不要跟他学就行了”。我被放到了一个 pedestal 上变成了一个“展示品？”了。我从来，到现在都不是某个集体的一员，最多只是一个“出于某种原因跟大家在一起混的人”而已。\n    而我即使得到了“这个人确实跟大家不一样”的承认，即使大家都承认我的才华，也一直没有人去 celebrate 我的独特作用。我一直都背负着去“融入社会”的负担。比如我小学的时候经常在椅子上来回晃，或者无意义地重复一些随机的词句，然后老师就去找我母亲，认为我是“多动症”。她还带我去医院看过，当然什么结果都没有。然后就是我一生的噩梦的一大开始。当时我还小，当时我母亲就咬定这些特征都只是注意一下就可以改掉的坏习惯，到现在也没有表示过歉意。我不记得我因为这种原因被各种暴力过多少次。也许这样也好，certain things are probably best left forgotten. \n    然后就这样子，我上了一个普通的大学。我也许本可以考的更好的，但是这个问题现在已经是应该 moot point 了不是吗。而且如果我去了另外一个地方我也不会遇到她。当时我抱着我网购的打印版《The art of computer programming》往宿舍走，然后在蜜雪冰城停了一下。她刚好路过，看到我抱着四大本出奇的厚的英文原版书就上来搭话了，然后我们就留了联系方式。我一直好奇我为什么没有在之前注意到我们班里面有一个这样一个人？是我的潜意识敏锐的看到了它知道我还没有准备好接受的东西吗？我为什么没有对一个留着长头发的“男生”感到一点“不自然感”？\n    我们第一次聊天她就很直白的告诉了我她是跨性别，“mtf”。我没有思考，本能的就向一个我刚认识的人袒露了我到当时内心最大的秘密:\n    “我觉得我也有这种倾向”\n    我是如此的渴望一个吐露自己的心声的机会。\n    然后我快速补了一句：\n    “但是我觉得我不是真的跨性别”\n    Not so fast.\n    I wasn’t ready to admit it, not yet.\n    但是虽然这么说，我在坐立不安了几天之后还是做出我这辈子最 bold 的 move。当时我还没有推特，我把我的 GitHub 头像加上了蓝粉白旗。\n    然后我的人生就天翻地覆了，但是这也是一个大家都听过了的故事吧。我学会上推特了，我学会买糖了，我学会 od 自残了，我学会了一个刻板印象小药娘的所有技能。我开心过，我绝望过，我魔怔过，我现在也许清醒了。Truth be told，万恶的 MECT 让我忘掉了这段时间发生过的很多事情。也许这样也好。Anyway，以此作为一个背景，我来叙述一些印象深刻的事情吧。\n    当时我认识她了之后，我跟我母亲闲聊的时候跟她介绍了一下。我母亲并没有多大的反应，她只觉得这是一个与自己无关的猎奇现象吧。就像我一直能体会到我被隔离与 community 之外一样，我能体会到我的这位朋友的存在也被我母亲安全的隔离在她对这个世界的认知之外。只是一个极端个例而已，在太阳底下除了这种奇葩每个人都是一样的，顺性别，神经典型，热爱正能量，天天积极向上，是这个社会的 productive member。“社会，本分，稳定。”七十二个一模一样的人操作着七十二台一模一样的机器。这就是现在这个 monolithic 的社会的真实写照不是吗。\n    But I digress。然后过了几天我的本能驱使我直接把柜门砸碎了，没办法，我只能压抑自己到那个程度。For a while，我的父母并没有多大反应，我甚至还以为我抽到了罕见的家长党。然后这个事实算是 sunk in 了吧。\n    然后 as they say: “solve lora infernis!”\n    当然，我是在这一切的 receiving end 上。\n    我并不记得这一切的具体经过发展之类的了。也许这样也好。我也没有把自己的这种遭遇叙述一遍的必要，被家长迫害的例子大家都司空见惯了。然后在这段历史的结尾和高潮，我被送进了精神病院，并在那里呆了差不多两个半月。（对，我估计就凭这个经历你也许就能猜到我其实是谁了）\n    我不想回忆我在精神病院的遭遇。这个对我有点太 traumatic 了。我只能说他们对于一个其实根本就没有精神病的人的对待就是 appalling 吧，特别是老是拖着不让我出院。我有的时候还能 crack a joke about it，但是其实我做噩梦都不敢再回去了。\n    然后怎么说呢，住院的时候远离了家庭我的精神状态算是稍微恢复了一点吧。然后我回家就得到了一个开幕雷击：趁我不在的时候我母亲把我的房间全部扫荡了一遍，所有能与我的性别认同扯上一点关系的东西都被仔细清除了，除了她没有密码不能把我的笔记本桌面换掉之外，连笔记本上面的贴纸都没能幸免。“要有一个新的开始”她自豪的告诉我，就像 2BR02B 里的 Dr.Hitz 一样。“我觉得没用”是我质问她的时候得到的唯一一个 nonchalant 的回复。“没用”。七十二个一模一样的人有着七十二个一模一样的需求。这就是现在这个社会的假设，不是吗？对于我没有用的东西对于你也没有用，我们都长着一样的脸，一样的心，按照一样的感官和价值观去选择对错。\n    当然之后我精神状态又撑不住了，当然之后我又自杀了，还不止一次。当然这些都是我自找的，我只是一个和“普通人”一样千人一面的机器，不是吗？既然一个大街上的“普通人”没有被“性别焦虑”“阿斯伯格”这种东西困扰，我又怎么会呢？何况我还是一台聪明的高质量机器，我的命运已经被 preordinate 了不是吗？像一台机器一样去学习，像一台机器一样去工作，结婚生子，光宗耀祖。这也是我父亲到现在最不能释怀的地方吧。我是他的“儿子”，我应该继承他的意志，我本可以成为一个根植农村的宗族的骄傲。然后我变成一个“人妖”了，一个耻辱。我跟他最后一次见面的时候他还在劝我“你真的应该悬崖勒马”。我听不下去起身走开了，然后就没有然后了。我的父母成长于那样的环境之中，他们除了 conformity 之外什么也不知道不是吗。他们只会用他们认知范围中的“交了恶友受了不良影响”来解释这一切。我的情感希望他们下地狱，我的理性希望他们一生平安。\n    “The road to Hell is paved with good intentions.”，不是吗？\n    “Jesus said, ‘Father, forgive them, for they do not know what they are doing.’And they divided up his clothes by casting lots.”\n    怎么说呢，这也就是存在 TDoV 这样的 celebration 的意义吧。如果我们可以勇敢的站出来，展现出自己真实的样子，展现出这个世界除了 normativity 和 conformity 之外还有我们这些虽然少数，但是确实存在，也确实不一样，也应该被承认被平等对待的少数群体的真实的样子。我们不能永远在阴影里指望运气和有人发善心生存。也许有一天，我应该看不到的一天，会有一个跟我一样独特的人得到她应有的人生。\n    “alteri vivas oportet, si vis tibi vivere.”\n    “deus est mortali iuvare mortalem, et haec ad aeternam gloriam via.”\n    就写到这里吧。\n    2024 年 3 月 27 日，Ellie。","submitter":"Ellie","date":"Mar 31, 2024"}]}