"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({blockquote:\"blockquote\",p:\"p\",h2:\"h2\",em:\"em\",h3:\"h3\",ul:\"ul\",li:\"li\",strong:\"strong\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"i hope youll understand my descision if it comes to it\"),\"\\n\",Vue.h(_components.p,null,\"i really am suffering\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",Vue.h(_components.p,null,\"Ara was a Franco-Italian trans girl who graduated from Georgia Tech in physics, enjoyed playing games like CSGO(Counter-Strike: Global Offensive), NSO(Needy Streamer Overload), GGS(Guilty Gear Strive), and Minecraft and loved cooking Italian food. She was a bit crazy around the edges. She massively suffered from borderline personality disorder (BPD), but still was one of the sweetest people we've met, genuinely caring and loving. Unfortunately, her conditions were what led to her departure.\"),\"\\n\",Vue.h(_components.h2,null,\"Her beautiful mind\"),\"\\n\",Vue.h(_components.p,null,\"Ara’s love for physics came early, and though her degree at Georgia Tech often brought intense pressure, it remained one of the few things that gave her life structure and meaning.\"),\"\\n\",Vue.h(_components.p,null,\"She loved to tinker around with computers, specifically with the Gentoo Linux operating system. She had joined the RISC-V Devboards Program and was planning to port Gentoo to a Lichee Pi 4A. Just a week before her death, she was writing a devblog about tinkering with her board. Her website looked like a terminal emulator, complete with commands and text art of the Gentoo Linux logo. It was minimal and perfectly fit her interests.\"),\"\\n\",Vue.h(_components.p,null,\"Her comfort character KAngel from the game \",Vue.h(_components.em,null,\"Needy Streamer Overload\"),\", she saw herself in her a lot to the point it kind of stopped being a joke. She also liked games like \",Vue.h(_components.em,null,\"Rain World\"),\" and \",Vue.h(_components.em,null,\"Cyberpunk 2077\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"Beneath the fire, Ara loved aquariums and had a particular obsession with hammerhead sharks. She and her husband would visit aquarium exhibits together and even had relationship rings styled after a manta ray. She adores bees. She loved drawing, sometimes on paper, sometimes impulsively on mirrors or glass, even in states of psychosis. Her world was chaotic but never void of creativity.\"),\"\\n\",Vue.h(_components.p,null,\"She was also a fan of Italian cuisine and made pasta a lot.\"),\"\\n\",Vue.h(_components.p,null,\"Despite all the things she loved, her passions, her curiosity, and her obsessions, Ara's battle with BPD was a storm she could never quite outrun. The same intensity that fueled her love also amplified her pain. She wanted to be close to people, to be understood, but the weight of her emotions often made that closeness feel impossible to sustain. Her relationships were full of deep love, but also self-doubt and an overwhelming fear of abandonment.\"),\"\\n\",Vue.h(_components.p,null,\"What ultimately took Ara from us wasn't a lack of effort or will. She fought every day. But BPD is relentless, and in the end, she made a choice not out of weakness, but out of exhaustion.\"),\"\\n\",Vue.h(_components.h2,null,\"A memory\"),\"\\n\",Vue.h(_components.p,null,\"One of our memories with Ara was when we all played Minecraft together on a server she hosted herself on her laptop. Instead of exploring the whole map, we found a floating island and made our home there, and we jokingly said we have a whole world to our own yet we are playing Skyblock. During our time on the server we talked a lot about random things like shows we were watching and just banter. She also had another server where she used to build random buildings like towers.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Mikka (MtF) on the left, Crystal (crystaltrd) in the middle, Ara (aragqt) on the right.\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\",\"${path}/photos/photo4.webp\",\"${path}/photos/photo5.webp\",\"${path}/photos/photo6.webp\",\"${path}/photos/photo7.webp\"]}),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Screenshots of buildings Ara made on her other server.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Her sense of humor\"),\"\\n\",Vue.h(_components.p,null,\"Ara had a way of saying the most unhinged things. This one was iconic:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“my blunt rotation is Osama Bin Laden - Kim Jong Un - Hatsune Miku - Crystal - Trump - Biden (in a hospital bed bc ass cancer) - Hatsune Miku again”\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.h3,null,\"Timeline\"),\"\\n\",Vue.h(_components.ul,null,\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"21 June 2025, 22:55\"),\": Ara sent several WhatsApp messages, which were deleted before they could be read.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"22 June 2025, 00:16\"),\": When asked about them, she said she had removed them to avoid causing potential legal complications. During the exchange, she revealed she was in significant distress and mentioned thoughts of ending her life.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"04:13\"),\": Ara shared that she had scheduled an appointment the next day (Monday) at 15:00 to begin dialectical behavior therapy (DBT), a treatment known to help with borderline personality disorder. She said her father had encouraged her to give this a chance, and she expressed deep love and hope.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"14:17\"),\": She reflected on her attempts to make new friends and her ongoing struggle to find connection.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"14:53\"),\": Ara wrote that she felt overwhelmed and that placing her hopes entirely in others was unfair to them. She said she wanted the racing thoughts to stop and reiterated her love.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"15:32\"),\": She sent a message with a timestamp, conveying that she had made a final decision. She asked not to contact a specific loved one and indicated she needed peace.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"15:51\"),\": Ara sent a short message saying goodnight and expressing her love.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"15:58\"),\": In a message filled with emotion, she encouraged her loved ones to live fully and succeed where she could not. She mentioned her daughter-in-spirit and said she would always be watching over her if there was an afterlife.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"16:06\"),\": Her final message was brief. She expressed love again and noted disbelief at her actions.\"),\"\\n\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"No more messages were received. While her messages stopped being read, it appears she had one last contact with her mother. It is believed that emergency services were contacted shortly after this time.\")),\"\\n\",Vue.h(_components.ul,null,\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"20:05\"),\": A family friend visited her home in person to check on her well-being.\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.strong,null,\"21:10\"),\": Her passing was confirmed by the visitor.\"),\"\\n\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"At 2025-06-22 a final note was received\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\"]}),\"\\n\",Vue.h(\"details\",null,Vue.h(\"summary\",null,Vue.h(_components.strong,null,\"Note (English)\")),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I don't give a fuck what you label me as\"),\"\\n\",Vue.h(_components.p,null,\"I just can't keep living like this\"),\"\\n\",Vue.h(_components.p,null,\"Literally can't. Thoughts racing through my head all the time, tried every med, no therapy has helped nor will help.\"),\"\\n\",Vue.h(_components.p,null,\"Hope you respect my decision. I've gotten my degree. It's all I ever wanted and I finally have it.\"),\"\\n\",Vue.h(_components.p,null,\"My brain is too fucking rotten to do anything further than that. I have peaked in a world that is very clearly going to shit.\"),\"\\n\",Vue.h(_components.p,null,\"Friends understandably distance themselves from me (and admit it), because it's just too much negativity and heavy shit all the time.\"),\"\\n\",Vue.h(_components.p,null,\"But that's besides the point.\"),\"\\n\",Vue.h(_components.p,null,\"It is nice for everything to finally be over, not stressing about anything, no more paranoia, no more stalking pieces of shit to worry about, no more needing to put effort into anything, no more need to feel like the fucking parasitic scum of the earth. Either that or I become a corporate wageslave.\"),\"\\n\",Vue.h(_components.p,null,\"It's clearer and clearer that humanity is evil by nature. Fuck, I could write entire books about it. But my star has faded and I just can't think clearly anymore. Yes, I've tried all possible meds over the years, and no, none of them helped. I'm just finishing something I started back in 2019.\"),\"\\n\",Vue.h(_components.p,null,\"Could spend the rest of my days making schizo art, or cutting myself just to feel real (BUT N0000000 YOU DON'T KNOW WHAT IT MEANS TO EXPERIENCE DEREALIZATION - fucking psychologist ive been seeing). At least my insides look real. Strange to try to get rid of my only coping mechanism just to replace it with nothing that just quite works.\"),\"\\n\",Vue.h(_components.p,null,\"This is becoming a schizobabble but goodbye to everyone I love. To my mom for supporting me all this way, to my dad for doing whatever he could to fight my literal mental demons (yes I literally hallucinated them), to my doctors trying to find any appropriate treatment for me, to all my friends at Georgia Tech for being there for me, to the professors who believed in me and gave me all the chances in the world, and most of all Jordan, my loving husband, and Crystal, my beautiful daughter-in-spirit, for having always been there for me.\"),\"\\n\",Vue.h(_components.p,null,\"Always. I'm sorry to disappoint all of you. But there really was no other way. Didn't wanna wait for some voodoo therapy to work or to be involuntarily committed again and lose control. So while I am still in control, I love you all. Thank you for everything.\"),\"\\n\",Vue.h(_components.p,null,\"Ara\"),\"\\n\")),\"\\n\",Vue.h(_components.p,null,\"May her pain finally be at rest, and her memory live on in those who loved her.\"),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: \",Vue.h(_components.a,{href:\"https://github.com/Crystaltrd\"},\"Crystal\"),\", \",Vue.h(_components.a,{href:\"https://github.com/cvyl\"},\"Mikka\")))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"