"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",br:\"br\",hr:\"hr\",blockquote:\"blockquote\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Lighting the Lamp\"),\"\\n\",Vue.h(_components.p,null,\"If the night is too dark to see the road ahead, then I will be your lamp.\",Vue.h(_components.br),\"\\n\",\"In May 2023, a friend and I started working on a psychological counseling project on an online platform. Perhaps my initial intention was not to help others, but to save myself. At that time, I was suffering from severe mental illness, living in confusion and despair every day—it was the darkest period of my life. Yet, I didn’t want to sink into the abyss, and I was desperate to find a way to redeem myself.\",Vue.h(_components.br),\"\\n\",\"Then she appeared.\",Vue.h(_components.br),\"\\n\",\"She came, gently and quietly, carrying the warm glow of orange light.\",Vue.h(_components.br),\"\\n\",\"On that romantic day, May 20th.\"),\"\\n\",Vue.h(_components.h2,null,\"The Lonely Star\"),\"\\n\",Vue.h(_components.p,null,\"She too was a child abandoned by the world.\",Vue.h(_components.br),\"\\n\",\"She grew up in a deeply conservative family in Tongnan, Chongqing. Her father was a gambling addict, and her mother, a teacher. The parents’ preference for sons over daughters, along with the gloom of her family’s atmosphere, made her experience the bitterness of life at an age that should have been carefree. She never had a happy life: her parents’ scolding and beatings, her classmates’ ridicule, and the bullying from school thugs... Struggling to survive in the cracks of life, she had fallen into despair countless times and even attempted suicide. But she never allowed herself to be consumed by the darkness of human nature. She always shone with pure light, like a lonely star in the night sky.\",Vue.h(_components.br),\"\\n\",\"Severe depression, acute anxiety, schizophrenia, ADHD… When my friend handed her over to me, I was completely shocked.\",Vue.h(_components.br),\"\\n\",\"Could someone with such severe mental issues really be saved?\"),\"\\n\",Vue.h(_components.h2,null,\"A Warm Current\"),\"\\n\",Vue.h(_components.p,null,\"I always felt that a sweet and kind child like Chinatsu deserved to be treated gently by the world. Even if everyone else abandoned her, I had to offer her that kindness.\",Vue.h(_components.br),\"\\n\",\"I began talking to her every day, patiently comforting and guiding her, and gradually, I entered her world. She was an exceptionally talented person—fluent in English and Japanese, skilled in programming, and adept at AI illustration. She even had a keen financial mind and made significant money from cryptocurrency trading. Her network was extensive—she had even taken a photo with Satoshi Nakamoto. Our conversations were always filled with laughter. Two lonely souls, no longer isolated after meeting, found warmth in each other’s company. Her love, like a gentle current, nourished my heart, melting the long-frozen ice within.\"),\"\\n\",Vue.h(_components.h2,null,\"Heaven’s Favor\"),\"\\n\",Vue.h(_components.p,null,\"“I’m a child blessed by heaven!” One day, Chinatsu told me excitedly, “I went to the hospital for a blood test, and the doctor said I have XX chromosomes, so I’m truly a girl!”\",Vue.h(_components.br),\"\\n\",\"I was genuinely happy for her. It seemed as though fate had destined it—while one door had closed, another had opened for her. Perhaps the misfortune of her childhood had paved the way for a lifetime of happiness.\",Vue.h(_components.br),\"\\n\",\"That day, she was overjoyed. She said, “One day, I hope to have my own children and live a happy life.”\"),\"\\n\",Vue.h(_components.h2,null,\"Smile\"),\"\\n\",Vue.h(_components.p,null,\"After that, every time Chinatsu had suicidal thoughts, I would talk to her about the little joys of life, about our future. Over time, I stopped her from attempting suicide seven times.\",Vue.h(_components.br),\"\\n\",\"With the combined efforts of Miss EnderCat and me, her condition miraculously improved. She became sunny and cheerful, and her face often showed a smile. At that moment, I had a premonition: maybe, just maybe, she would one day break free from the illness and be reborn.\"),\"\\n\",Vue.h(_components.h2,null,\"The Fallen Flower Vanishes Without a Trace\"),\"\\n\",Vue.h(_components.p,null,\"In September, a very close friend of Chinatsu’s committed suicide, and Chinatsu, in her devastation, took pills to end her own life. This time, I couldn’t stop her. Although she was rescued, the damage from her previous suicide attempts had left severe aftereffects. Unfortunately, this time, it triggered the malignant growth of a benign brain tumor.\",Vue.h(_components.br),\"\\n\",\"On the phone, Chinatsu cried to me, telling me how much pain she was in. My heart tightened hearing those words, but I couldn’t show my despair in front of her. Holding back my tears, I comforted her, “It will be alright… everything will be fine…”\",Vue.h(_components.br),\"\\n\",\"After the call ended, I cried uncontrollably. It was at that moment I realized how important Chinatsu was to me. I couldn’t understand—how could such a wonderful child suffer this way? I simply couldn’t comprehend.\",Vue.h(_components.br),\"\\n\",\"In her final days, she spoke to me about her childhood: “I remember when I was very young, I saw a handkerchief with cute designs on the table. I liked it so much that I reached for it, but my mother pulled my hand away and said, ‘Why would a boy like something so girly?’”\",Vue.h(_components.br),\"\\n\",\"Her voice was weak, as though she was sobbing and reminiscing at the same time.\",Vue.h(_components.br),\"\\n\",\"I cried my heart out, barely hearing her say, “In our next life, we must be together. I will wait for you.”\",Vue.h(_components.br),\"\\n\",\"“Don’t be afraid,” I told her, “You’ll go to a beautiful place, warm and free of pain.”\",Vue.h(_components.br),\"\\n\",\"On the other end of the line, there was only silence. Outside, the autumn wind blew, scattering the fallen flowers across the ground.\"),\"\\n\",Vue.h(_components.h2,null,\"Reunion\"),\"\\n\",Vue.h(_components.p,null,\"It felt like someone had forcibly torn something out of me, leaving me numb and dejected. I still don’t understand why she left me behind, leaving me to wander this lonely world alone.\",Vue.h(_components.br),\"\\n\",\"But it’s alright—she will wait for me. In the next life, we will be reunited.\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Written by: A Ray of Sunshine for Chinatsu, Her Main Supporter\",Vue.h(_components.br),\"\\n\",\"With the assistance of Miss EnderCat\"),\"\\n\"),\"\\n\",Vue.h(\"details\",null,Vue.h(\"summary\",null,\"Original\"),Vue.h(PhotoScroll,{photos:[\"${path}/photos/image1.webp\",\"${path}/photos/image2.webp\"]}),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"她寫給 lib 一抹陽光的遺書\"),\"\\n\"),Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo2.webp\",\"${path}/photos/photo3.webp\"]}),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"她對 lib 一抹陽光說：『和你在一起的時光，是我 14 年以來最幸福的時候了』\"),\"\\n\"),Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo4.webp\"]}),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"『感謝末影貓小姐協助我幫助千夏』—lib 一抹陽光\"),\"\\n\"),Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo5.webp\"]}),Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"『如果能有下輩子，我們一定要在一起』—鈴木千夏、lib 一抹陽光\"),\"\\n\"),Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo6.webp\",\"${path}/photos/photo7.webp\",\"${path}/photos/image3.webp\",\"${path}/photos/image4.webp\"]})))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"