"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({blockquote:\"blockquote\",p:\"p\",code:\"code\",h2:\"h2\",em:\"em\",a:\"a\",ul:\"ul\",li:\"li\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"Thank you for talking with me so much.\\nIf we meet in heaven, I\\'ll treat you to some beverages.\"'),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.code,null,\"-\"),' \"It would be better if we could drink it together in this world.\\nIn addition...what\\'s your favorite flavor?\"'),\"\\n\",Vue.h(_components.p,null,\"\\\"I can't wait that long. I'm so sorry...\\\"\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Zheermao was a trans girl who was extremely lacking in love and needed care.\"),\"\\n\",Vue.h(_components.p,null,\"Her MBTI personality was INFJ-A/INFJ-T.\"),\"\\n\",Vue.h(_components.p,null,\"She enjoyed songs from \",Vue.h(_components.em,null,\"Touhou Project\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"She played various games, such as \",Vue.h(_components.em,null,\"Plague Inc.\"),\", \",Vue.h(_components.em,null,\"Overwatch\"),\", and \",Vue.h(_components.em,null,\"Needy Streamer Overload\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"She also loved galgames.\\nWhile playing \",Vue.h(_components.em,null,\"Mystery Lover 2\"),\", she thought about many of her own experiences...\"),\"\\n\",Vue.h(_components.p,null,\"Zheermao was quite knowledgeable about electronics.\\nShe shared her insights on related topics on Zhihu.\"),\"\\n\",Vue.h(_components.p,null,\"Occasionally, she would visit the local library in Xi'an to read her favorite books.\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.p,null,\"As mentioned in her description,\\nZheermao was a girl extremely deprived of love.\\nShe always relied on friends around her and often needed their companionship.\"),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.a,{href:\"https://one-among.us/profile/ArtsEpiphany\"},\"Arts\"),\" once sent Zheermao a caring letter.\\nThey had a good relationship, and Zheermao kept Arts's letter all along.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"English translation of the preceding letter:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I am ArtsEpiphany, an admin from the online forum Transland.\\nYou can call me Arts.\\nI saw your QQ instant messaging number in your forum profile, but you seem to have disabled initiating conversations using QQ number.\\nTherefore I chose to contact you in this way, I'm sorry!\"),\"\\n\",Vue.h(_components.p,null,\"Actually, Arts is also a cat-like person.\\nHow can a cat-like person be unforgivable?\\nCat-like people are the cutest beings in the world.\\nThose who are truly guilty won't feel guilty.\\nThey won't think of ending themselves.\\nThey'll keep harming more and more people, making them suffer more and more.\\nThey only care about how much benefit they can get for themselves, clinging to life but escaping from death.\\nWhen they are lucky, they think of how to obtain more; when they are unlucky, they think of how to lose less.\\nAlthough I cannot comprehend what you've been through, I believe you're a good girl at heart.\"),\"\\n\",Vue.h(_components.p,null,\"Arts understands that it's not easy to live without the support of a family.\\nYou may be lonely, because you have no one to turn to when in pain; you may be helpless, because no one extends their hand when in trouble; you may be puzzled, because you don't know what to live for.\"),\"\\n\",Vue.h(_components.p,null,\"Actually, Arts doesn't really know how to console you.\\nWhy do some people live in happiness but others live in suffering, without a hint of hope?\\nArts doesn't understand.\\nArts hates this unfair world as well.\\nBecause of this, Arts won't flatly tell you to keep living.\\nWhat Arts wants to tell you is this:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"You are not alone.\\nFor example, as a trans person, there are people everywhere in the world who have the same hopes and dreams as you, trying to build a brighter future for themselves.\\nFor example, there are people who have cut ties with their parents.\\nFor example, there are people who have issues with self-harm.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Therefore, please believe that there are people who would care, understand, and accompany you.\\nThere are also people who would wish for your happiness, whether you know them or not, like me, Arts.\"),\"\\n\",Vue.h(_components.p,null,\"If you like, I'd like to hug you.\"),\"\\n\",Vue.h(_components.p,null,\"Good night,\\nArtsEpiphany\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Zheermao attempted to leave this world several times but survived with difficulty through rescues.\"),\"\\n\",Vue.h(_components.p,null,\"However, in the early spring of 2024,\\nfollowing the death of a friend, she made up her mind again to leave.\"),\"\\n\",Vue.h(_components.p,null,\"A few days before her departure,\\nshe sent an email to One Among Us.\\nUpon seeing it, one member sent her a reply immediately:\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"English translation of the preceding email conversation:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.ul,null,\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,\"Zheermao\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Please prepare a little.\\nIt's Zheermao.\\nI tried to live, but...\\nI'm sorry. Thank you.\\nIf I succeed, please put up my entry.\\nThank you.\"),\"\\n\"),\"\\n\"),\"\\n\",Vue.h(_components.li,null,\"\\n\",Vue.h(_components.p,null,\"...@oneamongus.ca\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Good evening,\"),\"\\n\",Vue.h(_components.p,null,\"I just refreshed my inbox after sending an email to my friend.\\nI'm sorry. I'd like to hug you.\\nBut please believe me, there are sparks of brightness in the endless nights as well.\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"All from One Among Us will always be with you.\\nIf you need help, please contact us or someone you trust.\\nPlease do not worry, we'll try to write down what we remember.\\nBut keep living is the best way to rebel against the hatred in the world.\\nThe dynamic stories about you or me, the stories that are living, are much more alive than finished stories.\\nThat's what we can never write down.\\nLove you. Do not give up easily.\\nIt must still be cold in the north. I'd hug you again.\\nSpring is coming. Ice will melt, no matter how hard it is.\"),\"\\n\"),\"\\n\"),\"\\n\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Later, that member contacted her on Telegram and tried to comfort her, then talked with her for a long time about transgender experiences, love and being loved, and the meaning of living, trying to keep her for a little longer.\"),\"\\n\",Vue.h(_components.p,null,\"Despite this, she insisted on her decision... and ultimately chose to leave.\"),\"\\n\",Vue.h(_components.p,null,\"After her departure, Han Lianyi wrote an \",Vue.h(_components.a,{href:\"https://t.me/Lianyi520/565\"},\"epitaph\"),\" for her.\"),\"\\n\",Vue.h(_components.p,null,\"Perhaps Zheermao's departure was not an unexpected ending.\"),\"\\n\",Vue.h(_components.p,null,\"But now, everything can only be turned into a long sigh...\"),\"\\n\",Vue.h(_components.p,null,\"Contributor for this entry: Echo of One Among Us\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"