"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Yuki is a soft and lovely trans woman with a gentle personality, a slim figure, and smooth, fair skin with no visible pores on her face.\"),\"\\n\",Vue.h(_components.p,null,\"She is very skilled at music games, especially maimaiDX, and loves music, Bocchi the Rock!, Chōten-chan, and メンヘラスタイル。She owns a pink guitar. She is not very interested in people, but many people like her. She often says she wants to become an adult soon and be independent so she can earn money for surgery.\"),\"\\n\",Vue.h(_components.p,null,\"Her dreams seemed very real, sometimes more real than reality, but she always had nightmares and strange dreams.\"),\"\\n\",Vue.h(_components.p,null,\"She didn't want to cause trouble for others, so she kept many things to herself.\"),\"\\n\",Vue.h(_components.h2,null,\"Her Life\"),\"\\n\",Vue.h(_components.p,null,\"In her childhood, she suffered domestic violence and school bullying, which laid the foundation for her depression. Early on, her parents could not understand her gender identity and tricked her into being confined in a conversion institution for half a year. During this period, she suffered inhumane abuse, such as being forced to drink Shaoxing wine, corporal punishment, and bloodshed, which led to a mental breakdown where she hammered her own hand, causing a comminuted fracture of her little finger. During this time, she developed schizophrenia, which worsened her depression and bipolar disorder. After this, her family gradually began to understand her. After she attempted suicide, her family's attitude improved significantly, and they supported her surgery, with her mother visiting her in Chengdu twice and taking her out for meals. However, her family did not take her bipolar disorder and schizophrenia seriously, and there was no continuous treatment, causing Yuki to be in a state of medication withdrawal.\"),\"\\n\",Vue.h(_components.p,null,\"To make money and become self-reliant, Yuki tried working as a game proxy player and food delivery worker. However, playing Genshin Impact as a proxy player only earned her 50 yuan despite the high workload, and the food delivery work might have been hindered by her being underage, as she was not directly employed by Meituan Takeout and Cake Shop but by Yicheng Feike. She also worked part-time for Meituan and Ele.me. Yuki wanted to start working quickly to earn money, so she signed a car rental contract with a streetlight company. If she didn't rent for three months, she would have to pay liquidated damages, but her wages were still in arrears, and reporting to the police was to no avail. On Children's Day, Yuki's mobile phone and keys were stolen while she was out relaxing at work. Therefore, she did not return to her boyfriend's house, fearing he would inform her family and make them worry, so she spent the night outside. That night, she was hungry and cold. After her phone was stolen and she called the police, the thief was not caught. Later, her tablet disappeared, and again the police did not help. She loved that phone and tablet very much. Yuki became extremely disappointed with the world. She had attempted suicide many times before, and in the past year, the frequency increased, sometimes even three or four times a month. Her sisters often called the police and organized offline rescue operations.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/image0.jpeg\",\"${path}/photos/image1.jpeg\",\"${path}/photos/image2.jpeg\",\"${path}/photos/image3.jpeg\",\"${path}/photos/image4.jpeg\",\"${path}/photos/image5.jpeg\",\"${path}/photos/image6.jpeg\"]}),\"\\n\",Vue.h(_components.p,null,'Yuki wanted to live in Chengdu. She initially came to Chengdu to meet her ex \"Xixi,\" who often changed names and now has tens of thousands of followers, but he abandoned her. After being taken in by Zhouzhou, she lived with her. Zhouzhou treated her as a daughter. Later, Zhouzhou returned to her hometown to live with her family, and her boyfriend rented the original house to live with Yuki. Eventually, there were some conflicts between the two, so Yuki went to stay with Zhenli to relax. After Zhenli went abroad, Yuki moved in with Xixi Biscuit. As a result, her boyfriend and sisters could not always stay with her and rescue her in time. Already deeply disappointed with the world, Yuki experienced a series of hardships and finally ended her life by throwing herself into a river on the night of June 27, 2024.'))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"