"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({p:\"p\",h2:\"h2\",blockquote:\"blockquote\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.p,null,\"She was born on March 4th, 2009, in Jining, Shandong.\\nShe longed to be a girl, to wear beautiful dresses, to have long hair, and to have a gentle voice.\"),\"\\n\",Vue.h(_components.h2,null,\"Her hobbies\"),\"\\n\",Vue.h(_components.p,null,\"She had many hobbies.\\nShe loved rhythm games and played Arcaea.\\nThe last song she played was “False Embellishment”.\\nShe also liked to listen to music, create music, make videos, write code and so on.\\nSome of her videos were very funny, and her music had tons of personality.\\nShe was a talented and versatile person, always full of curiosity and creativity.\"),\"\\n\",Vue.h(_components.h2,null,\"Her dreams\"),\"\\n\",Vue.h(_components.p,null,\"She had many dreams.\\nShe wanted to become a real girl.\\nShe said she wanted to be a forensic doctor in the future.\\nShe wanted to help those who suffered from depression and anxiety.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"She once said she wanted to meet EnderCat\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Signs of leaving\"),\"\\n\",Vue.h(_components.p,null,\"On May 11th, 2023, MoeCat gave Cencen a hair clip and hoped that Cencen would think of her after she left.\"),\"\\n\",Vue.h(_components.p,null,\"On May 12th, 2023, MoeCat started asking Cencen for blessings and hoped that Cencen would wish her “to be a girl in the next life”.\"),\"\\n\",Vue.h(_components.p,null,\"On May 13th, 2023, Cencen sensed that she might commit suicide the next day and informed EnderCat at 11:45 pm that night.\\nEnderCat tried to inform her parents but failed.\"),\"\\n\",Vue.h(_components.p,null,\"On May 14th, 2023, EnderCat received a forwarded chat record from “Fixing Broken Hearts” at 1:11 am and tried to contact MoeCat and her parents to confirm her status.\\nAt 1:17 am, MoeCat sent EnderCat an apology message and said, “I’m really happy that I met EnderCat in this life”.\"),\"\\n\",Vue.h(_components.h2,null,\"Her departure\"),\"\\n\",Vue.h(_components.p,null,\"But she did not realize her dreams or meet EnderCat.\\nOn May 13th, 2023, she was really happy, as if she had returned to normal.\\nIn the early morning of the next day, she chose to commit suicide.\"),\"\\n\",Vue.h(_components.p,null,\"That was a decision that was hard to accept and understand.\\nI know she endured a lot of pain and pressure.\\nShe was forced to stop HRT and was given GnRH analogs.\\nHer parents did not understand her needs, which made her feel hopeless and helpless.\"),\"\\n\",Vue.h(_components.p,null,\"Plus, she initially had no confidence or sense of worth in herself.\\nShe felt useless and unworthy of being loved.\\nBut these were not true.\\nWe always loved her.\"),\"\\n\",Vue.h(_components.p,null,\"Her friend EnderCat called 120 at 1:23 am.\\nHer parents also called 120 almost at the same time...\\nUnfortunately, she lost consciousness at 1:25 am on May 14th, 2023 and was taken to the hospital... I don’t know what happened next, but she eventually did not make it.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“I could have called 120 ten minutes earlier, but I chose to confirm her status first. I blame myself. I will never forget what she said to me at the end: ‘I’m in so much pain, EnderCat, please help me!’” - EnderCat\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/Photo1.webp\"]}),\"\\n\",Vue.h(_components.h2,null,\"Her gallery\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Selected from MoeCat’s Qzone, all are architectural photos\"),\"\\n\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/Photo4.webp\",\"${path}/photos/Photo3.webp\",\"${path}/photos/Photo2.webp\"]}),\"\\n\",Vue.h(_components.h2,null,\"Other people who appear on this page\"),\"\\n\",Vue.h(_components.p,null,\"EnderCat: MoeCat’s friend and one of the main interveners. According to EnderCat, she was the most capable of saving MoeCat. However, because of an obvious mistake, it led to irreversible consequences.\"),\"\\n\",Vue.h(_components.p,null,\"“Fixing Broken Hearts”: MoeCat’s friend and the one who invited MoeCat to join “a group chat”. Because of her, MoeCat could buy HRT medication and meet everyone. According to her, if she did not pull MoeCat into the circle, MoeCat might not have committed suicide.\"),\"\\n\",Vue.h(_components.p,null,\"Cencen: MoeCat’s boyfriend, the first one to sense that MoeCat would commit suicide. According to him, “We may have indeed prolonged her life. Without us, she might have left in March...”\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"