"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",blockquote:\"blockquote\",hr:\"hr\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Memories\"),\"\\n\",Vue.h(_components.p,null,\"Susie was a sweet and cheerful trans girl with a love for \",Vue.h(_components.em,null,\"Arknights\"),\",\\nparticularly for the character Goldenglow (operator's real name: Susie Glitter).\\nShe had a passion for video games. These inspired her username - \",Vue.h(_components.em,null,\"Susiethegamer\"),\".\"),\"\\n\",Vue.h(_components.p,null,\"Susie and her best friend Nekomaki, who was like a sister to her, often played games together.\\nAmong her favourites was \",Vue.h(_components.em,null,\"The Finals\"),\", although she would occasionally grow dizzy in the 3D environment.\\nThen she would switched to play \",Vue.h(_components.em,null,\"Rainbow Six Siege\"),\", a favourite of her sister.\\nIn R6s, Susie had a charming clumsiness that made her all the more endearing.\"),\"\\n\",Vue.h(_components.p,null,\"After their gaming sessions, the two sisters would often sing \",Vue.h(_components.em,null,\"Yorushika\"),\" songs together on Discord, Susie adored their music very much.\\nNekomaki had a habit of waking up late, and when she got up, she always found Susie already waiting for her on Discord.\"),\"\\n\",Vue.h(_components.p,null,\"Susie had a knack for fashion and a soft spot for Uniqlo clothes.\\nShe loved sharing her outfits with her sister.\\nAlthough she looks a bit chubby, she was very lovely — the kind of adorable person you just want to pinch her cheeks.\\nShe dreamed of cosplaying Goldenglow once she slimmed down.\"),\"\\n\",Vue.h(_components.p,null,\"When asked if she’d prefer studying in the UK or Singapore, she chose Singapore, where her sister was residing.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“I’ll be waiting for you in May. Come live with me, and we’ll work on making you feel better.”\"),\"\\n\",Vue.h(_components.p,null,\"– Nekomaki\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"In 2023, Susie received an offer from a university in the US. but couldn’t attend due to her mental health struggles.\\nShe later expressed a stronger desire to go to Japan instead.\"),\"\\n\",Vue.h(_components.p,null,\"Susie had long wrestled with severe suicidal thoughts.\\nThough her friends rarely mentioned it openly, they kept a close eye on her carefully.\"),\"\\n\",Vue.h(_components.p,null,\"In April 2024, Susie and some friends visited Snowfairy, who was studying at a language school in Japan.\\nTheir days together were joyful, filled with laughter.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.PNG\",\"${path}/photos/photo2.PNG\",\"${path}/photos/photo3.PNG\",\"${path}/photos/photo4.PNG\",\"${path}/photos/photo5.PNG\",\"${path}/photos/photo6.PNG\",\"${path}/photos/photo7.PNG\",\"${path}/photos/photo8.PNG\",\"${path}/photos/photo9.PNG\"]}),\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"(Photos from Susie’s trip to Shibuya, Shinjuku, and Ikebukuro)\")),\"\\n\",Vue.h(_components.p,null,\"Susie attempted suicide by lying on the tracks during her time in Japan.\\nAt that moment, Snowfairy was frantic and wanted to rush to Kawagoe in the middle of the night.\\nHowever, due to her own fragile state of mind, Snowfairy had to rely on other friends in Japan for help.\\nFortunately, nothing serious happened in the end.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“When it was time to say goodbye, she clung to me tightly. I hugged her back, thinking, next time, I’ll take her to more wonderful places and introduce her to my favourite restaurants.”\"),\"\\n\",Vue.h(_components.p,null,\"– Snowfairy\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Back in China, Susie frequently spoke of her longing to live and study in Japan.\\nSnowfairy even recommended scenic spots for her to visit.\"),\"\\n\",Vue.h(_components.p,null,\"Later, Susie's mental state visibly began to deteriorate visibly.\\nDuring this time, she had several suicidal attempts,\\nbut Snowfairy was always quick to notice and reach out to many people for help,\\nwhich helped prevent any tragedies from occurring.\"),\"\\n\",Vue.h(_components.p,null,\"In her final days, Susie stopped playing games, gave away many of her belongings, even including her computer.\\nNekomaki did not foresee the outcome at that moment,\\nas Susie had been persuaded out of previous suicide attempts,\\nsuch as overdosing and jumping off a building.\\nShe thought this time would be no different.\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"In her previous tweet,\\nshe was sharing photos of her treasured collections (looking back now, it seems to have been a final display, perhaps a way of reminiscing about the past),\\nbut her next tweet was a message about taking the drugs and leaving us.\"),\"\\n\",Vue.h(_components.p,null,\"For various reasons, the local police were unable to find her in time, and by then, it was already too late.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"The last time I saw Susie, she was a lively and energetic trans girl as ever, but at the funeral, all I could do was watch as her cold, small casket.\"),\"\\n\"),\"\\n\",Vue.h(_components.h2,null,\"Farewell\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Until we meet again, Susie.\"),\"\\n\",Vue.h(_components.p,null,\"一緒に遊ぼう、いつまでも。\"),\"\\n\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Drunk on sorrow, tears clouding her fevered sleep,\\nOld memories stir in dreams, fleeting and brief.\\nWaking in tears, still yearning for the past.\\nWe met in haste, never to meet again.\"),\"\\n\",Vue.h(_components.p,null,\"Upon waking, Susie's wallpaper still blinks,\\nand memories flood in with the tears,\\nThe gamer Susie who loved video games will never return.\"),\"\\n\",Vue.h(_components.p,null,\"No more chats on Discord.\"),\"\\n\",Vue.h(_components.p,null,\"No more games of \",Vue.h(_components.em,null,\"Rainbow Six Siege\"),\" or \",Vue.h(_components.em,null,\"The Finals\"),\".\"),\"\\n\",Vue.h(_components.hr),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"The moon lingered on the wayfarer's hall,\"),\"\\n\",Vue.h(_components.p,null,\"Sea wind nested in the strand’s fiery pall.\"),\"\\n\",Vue.h(_components.p,null,\"Once we, under southern sky’s glorious pane\"),\"\\n\",Vue.h(_components.p,null,\"weaved words of joy that never shall wane.\"),\"\\n\",Vue.h(_components.p,null,\"So bright now, another moon, mirror of a stranger\"),\"\\n\",Vue.h(_components.p,null,\"who can’t rhyme more, but hears the murmur\"),\"\\n\",Vue.h(_components.p,null,\"of fearsome cloud and rapids.\"),\"\\n\",Vue.h(_components.p,null,\"White lilac of barren string\"),\"\\n\",Vue.h(_components.p,null,\"Guard her from snow 'round the unforgiving stars.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"The meeting and embrace at Shinagawa Station feel as if it were yesterday,\\nAnd the izakaya we visited that night often flickers in my mind.\"),\"\\n\",Vue.h(_components.p,null,\"The heavens are cold, may fairies clear the snow and ice from Susie's path,\\nso she may travel warmly to the heaven.\"),\"\\n\",Vue.h(_components.p,null,\"Susie, may you be free from all burdens in your next life.\\nMay your wishes come true in a kinder world.\"),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: \",Vue.h(_components.a,{href:\"https://twitter.com/nekomakiQAQ\"},\"Nekomaki\"),\", \",Vue.h(_components.a,{href:\"https://twitter.com/snowfairy011026\"},\"Snowfairy\"),\", One-Among-Us, Rinko (translator for poem)\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"