"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Qianyuan was a lovely and pretty girl, whose pronouns are She/They.\"),\"\\n\",Vue.h(_components.p,null,\"She was an art student, and some of the avatars she used were drawn by herself.\"),\"\\n\",Vue.h(_components.p,null,\"She liked to keep long hair and wear lovely clothes.\"),\"\\n\",Vue.h(_components.p,null,\"Besides, she always shared her daily life. Whether she saw cute cats and beautiful flowers, or she had a bad day, she would share them to us.\"),\"\\n\",Vue.h(_components.p,null,\"Interestingly, she has a lovely sister who bites others sometimes.\"),\"\\n\",Vue.h(_components.h2,null,\"Some Memories of Her Friend\"),\"\\n\",Vue.h(_components.p,null,\"I met Qianyuan in November 2022. In my impression, she was an active high-school student.\"),\"\\n\",Vue.h(_components.p,null,\"She had a dishevelled hair of medium length, which grew her ears and nearly covered her eyes. She was an adorable child, who was always in a scarf of light gray and a coat of light green.\"),\"\\n\",Vue.h(_components.p,null,\"Since our first encounter online, she'd said that she wanted to played with me. It was a pity that we cannot meet each other during the time from November to February of following year. We didn't meet offline until her departure.\"),\"\\n\",Vue.h(_components.p,null,\"Although she would feel embarrassed in the public, but she still hoped to make friends. She met some trans girls several times, but few people greeted her. So she was on her phone alongside, then escaped to find me.\"),\"\\n\",Vue.h(_components.p,null,\"She once shared a link of ACG exhibitions excitedly. It was a pity that we were unable to attend because of the costly tickets at last.\"),\"\\n\",Vue.h(_components.p,null,'She was a very gentle girl. She would listen and respond carefully when you unburden yourself to her, and she had a great sense of consoling people. In addition, she always persuaded us not to overdose, and half jokingly told us not to be \"bad children\".'),\"\\n\",Vue.h(_components.p,null,\"Her departure was the most regretful and sad thing I met in transgender community. I might have chance to persuade her and play with her...\"),\"\\n\",Vue.h(_components.h2,null,\"Departure\"),\"\\n\",Vue.h(_components.p,null,\"Qianyuan was insulted by her family, not allowed to love several things, forced to take part in useless family dinner party. Owing to her bad relationship with her family, her mental health worsened soon.\"),\"\\n\",Vue.h(_components.p,null,\"During the time from December 2022 to January 2023, there was indication of her plan to leave. But that received scant attention.\"),\"\\n\",Vue.h(_components.p,null,\"Two days before her departure, she asked her friend if she wanted to come out and play for the last time. On 20th February, she chose to leave the world.\"),\"\\n\",Vue.h(_components.p,null,\"In her last moment, she still thought of everyone in her will:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Thanks to your company all along, and I wish you live well in your following life.\"),\"\\n\",Vue.h(_components.p,null,\"Your attitudes towards me are not important. Because I had loved you. I love you all very much.\"),\"\\n\",Vue.h(_components.p,null,\"I put my last words in my heart, because I am afraid others hear that. I want to tell those who had accompanied with me and assist me, I am so sorry...\"),\"\\n\",Vue.h(_components.p,null,\"Extracted from Qianyuan's will\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Contributors for this entry: One-Among-Us, \",Vue.h(_components.a,{href:\"https://twitter.com/chengyiga\"},\"Shen Naixi\")))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"