"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",em:\"em\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Introduction\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Lyna is a girl who loves hugging her IKEA shark, enjoys rock music, and immerses herself in her own little world.\"),\"\\n\",Vue.h(_components.p,null,\"She fantasizes about being a rock star and releasing an album that moves all of humanity (just a fantasy, but it's such a lovely one!).\"),\"\\n\",Vue.h(_components.p,null,\"\\\"I think Radiohead is a great band, but they're definitely not for everyone. There's a certain quality about them that somehow captivated me.\\\"\"),\"\\n\",Vue.h(_components.p,null,\"So, would Bocchi-chan enjoy Radiohead too?\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Maybe it's ADHD? When doing something challenging, her mind always drifts. Is that it?\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"Ah, this style is so similar to that band\\'s song.\" \"So that\\'s why certain things are the way they are.\" \"Dreaming of some unrealistic goals...\"'),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Light as a feather, yet just like Kanade, she's reluctant to admit she's an angel.\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Lonely like a ripple, yet still searching for the meaning of life.\"),\"\\n\",Vue.h(_components.p,null,\"It's just that, unlike Misaka's little sister, she hasn't returned to the world of the living.\"),\"\\n\",\"\\n\",Vue.h(_components.h2,null,\"Shackles\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"When I was a child, I was too scared to approach girls, wishing I could understand them.\"),\"\\n\",Vue.h(_components.p,null,\"Then my parents and everyone around me snuffed out that part of me, forcing me to play with boys.\"),\"\\n\",Vue.h(_components.p,null,\"Ah, walking around like a freak every day... by the time I graduated, I'd probably been assimilated.\"),\"\\n\",Vue.h(_components.p,null,\"Every year, a part of me dies, and I can't even remember who I was the year before.\"),\"\\n\",Vue.h(_components.p,null,\"Gender identity? A boy? A girl? I can't recall at all...\"),\"\\n\",Vue.h(_components.p,null,\"I think I might have been a girl before third grade? But now, no matter how hard I try, I can't remember anymore.\"),\"\\n\",Vue.h(_components.p,null,\"I always fantasized about being a bride, getting married.\"),\"\\n\",Vue.h(_components.p,null,\"Did I secretly like a boy in middle school?\"),\"\\n\",Vue.h(_components.p,null,\"Well, all those details are entirely lost to me now.\"),\"\\n\",Vue.h(_components.p,null,\"As for hate? I hated them so much. That was all I thought about in middle school.\"),\"\\n\",Vue.h(_components.p,null,\"When I was shut off, they just stood there watching.\"),\"\\n\",Vue.h(_components.p,null,\"I was trained, forced to obey, and eventually became like a dog.\"),\"\\n\",Vue.h(_components.p,null,\"And so I forgot anything about gender, becoming a tortured slave all the way until high school.\"),\"\\n\",Vue.h(_components.p,null,\"What about stress? I closed myself off in my own world.\"),\"\\n\",Vue.h(_components.p,null,\"Then I tormented myself, turning into a walking corpse.\"),\"\\n\",Vue.h(_components.h2,null,\"Dysphoria\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Adam's apple, broad shoulders? And my voice.\"),\"\\n\",Vue.h(_components.p,null,\"What a nuisance... Every month, I find myself hating these things multiple times.\"),\"\\n\",Vue.h(_components.p,null,\"But I had no awareness of the reason for it at the time.\"),\"\\n\",Vue.h(_components.p,null,\"Later, I fell for someone for the first time and learned what it meant to get close to someone online.\"),\"\\n\",Vue.h(_components.p,null,\"I was willing to give him everything.\"),\"\\n\",Vue.h(_components.p,null,\"Maybe it’s because I wasn’t cute enough that I was rejected.\"),\"\\n\",Vue.h(_components.p,null,\"I cried so many times... I no longer knew what I was thinking...\"),\"\\n\",Vue.h(_components.p,null,\"The girl in me was killed off again.\"),\"\\n\",Vue.h(_components.p,null,\"Perhaps I don’t want to be 100% female — I just want a body that’s feminine.\"),\"\\n\",Vue.h(_components.p,null,\"Although, internally, one could count me as being on the female side too.\"),\"\\n\",Vue.h(_components.p,null,\"When feeling lonely, I fantasize about being held by someone.\"),\"\\n\",Vue.h(_components.p,null,\"But relying purely on emotions won’t do anymore; I can only think rationally now.\"),\"\\n\",Vue.h(_components.p,null,\"So frustrating...\"),\"\\n\",Vue.h(_components.h2,null,\"Wishes\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Why did the gods take away her wishes?\"),\"\\n\",Vue.h(_components.p,null,\"She also has dreams in her heart, like forming a band that lasts a lifetime.\"),\"\\n\",Vue.h(_components.p,null,\"But music is just an escape from pain.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"I wish I could have the youth and love of a girl, but it seems like there’s no chance anymore...\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"That’s what she says.\"),\"\\n\",Vue.h(_components.p,null,\"A tragic life, fleeting youth. Choices like those in a galgame, nothing but the gods' mockery.\"),\"\\n\",Vue.h(_components.p,null,\"It’s just like what Kessoku Band sings...\"),\"\\n\",\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"なにかになりたい なりたい 何者かでいい\"),\"\\n\",Vue.h(_components.p,null,\"I want, I want to be something, just be someone\"),\"\\n\",Vue.h(_components.p,null,\"馬鹿なわたしは歌うだけ\"),\"\\n\",Vue.h(_components.p,null,\"The idiot that I am, I just sing\"),\"\\n\",Vue.h(_components.p,null,\"ぶちまけちゃおうか 星に\"),\"\\n\",Vue.h(_components.p,null,\"Why don’t I just lay it all out to the stars\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"But can we ever find that star?\"),\"\\n\",Vue.h(_components.h2,null,\"Final Chapter\"),\"\\n\",\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"This world is fake, just one of my self-pleasing fantasies.\"),\"\\n\",Vue.h(_components.p,null,\"What's the meaning of living? Working until death — what kind of happiness can be bought with that?\"),\"\\n\",Vue.h(_components.p,null,\"Happiness was all used up by the time I hit my twenties. By thirty, wouldn’t I just be a walking corpse?\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Let’s go to the beach together, watch the seagulls, and listen to music by The Strokes.\"),\"\\n\",Vue.h(_components.p,null,\"If only we could grab surfboards and go surfing, that’d be great.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\",\"${path}/photos/photo2.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"The piano upstairs sounds so beautiful — usually, I’d find it annoying.\"),\"\\n\",Vue.h(_components.p,null,\"But with a different mood, it feels different, doesn’t it?\"),\"\\n\",Vue.h(_components.p,null,\"I got emotionally wrecked while playing \",Vue.h(_components.em,null,\"ATRI\"),\", but at least Atri was there.\"),\"\\n\",\"\\n\",\"\\n\",Vue.h(_components.p,null,\"She was the one who stayed with me till my last moments...\"),\"\\n\",Vue.h(_components.p,null,\"Maybe all this is real, after all?\"),\"\\n\",Vue.h(_components.p,null,\"Many transgender people live difficult lives, right?\"),\"\\n\",Vue.h(_components.p,null,\"Everyone fights hard to live; that’s how so many memories are etched into existence.\"),\"\\n\",Vue.h(_components.p,null,\"No matter what kind of life it is, it’s the culmination of everything we go through.\"),\"\\n\",Vue.h(_components.p,null,\"If that’s the case...\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Take up arms if you have them.\"),\"\\n\",Vue.h(_components.p,null,\"Just like \",Vue.h(_components.em,null,\"Angel Beats\"),\", let’s rally together and resist this unjust world after death.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo3.webp\"]}),\"\\n\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"In the end, we heard her voice.\"),\"\\n\",Vue.h(_components.p,null,\"Her name is Lyna.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"