"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",em:\"em\",a:\"a\"},props.components),PhotoScroll=_components.PhotoScroll;if(!PhotoScroll)_missingMdxReference(\"PhotoScroll\",true);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"In Fall 2023, Sugar went to Hangzhou, Zhejiang, to attend university.\"),\"\\n\",Vue.h(_components.p,null,\"She was an introverted girl who cared too much about others' feelings, so she wasn't able to express herself when she needed it.\\nShe was too shy to express her confusion and anxiety.\\nMoreover, she had no friend to confide in her thoughts; she could only hide them in her heart.\\nThat made her look a bit intimidated.\"),\"\\n\",Vue.h(_components.p,null,\"She always prepared a lot before meeting friends in real life.\\nShe was always worried about leaving a bad impression, so she asked them tons of questions in advance (such as which kinds of gifts they would like) and warned them she might exhibit regressive behaviours.\"),\"\\n\",Vue.h(_components.p,null,\"Her family is conservative.\\nHer father worked for China Railways Group, and her mother was a teacher.\\nShe didn't receive enough love from them.\\nThey once threw away the gender-affirming clothing she hid while she was in high school.\\nTherefore, she was sure her parents were too conservative to communicate with.\"),\"\\n\",Vue.h(_components.h2,null,\"The dissipated haze in Hangzhou\"),\"\\n\",Vue.h(_components.p,null,\"On January 6th, 2024, Sugar met friend A in Hangzhou.\"),\"\\n\",Vue.h(_components.p,null,\"Just before meeting A, she hid in the restroom and kept checking the mirror.\\nShe was ashamed to meet A because she didn't do her hair or wear cute clothes.\\nActually, she was still pretty despite that.\"),\"\\n\",Vue.h(_components.p,null,\"The two girls visited many places of interest in Hangzhou……\"),\"\\n\",Vue.h(_components.p,null,\"West Lake Culture Square, Wulin Suqare, Wuliu Lane, and Fengshan Gate.\"),\"\\n\",Vue.h(_components.p,null,'When parting, She asked A about her thoughts on her plan to \"threaten\" her parents (to gain acceptance of being trans).'),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,Vue.h(_components.em,null,\"Here is what A remembered:\")),\"\\n\",Vue.h(_components.p,null,'Sugar: Perhaps I need to \"threaten\" them since they are too conservative to communicate with.'),\"\\n\",Vue.h(_components.p,null,\"Sugar: I'm afraid of pain, but I could hurt myself a bit.\"),\"\\n\",Vue.h(_components.p,null,\"Sugar: Thereby, they might make a compromise eventually, and I might get more freedom in return.\"),\"\\n\",Vue.h(_components.p,null,\"Sugar: According to the plan, I will delete you from my friend list after this parting.\"),\"\\n\",Vue.h(_components.p,null,\"Sugar: You shouldn't be worried about me. Please forget me as soon as possible.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,'When A left for home, she left Sugar half a bag of oranges and messaged her \"Adios.\" (Goodbye) on QQ.\\nA didn\\'t get any reply.\\nThat night, Sugar actually deleted her contact.'),\"\\n\",Vue.h(_components.p,null,\"On the second day, a Twitter user who claimed to be Sugar's high school classmate sent her some random thoughts on behalf of Sugar.\\nThen A requested them to look after her.\"),\"\\n\",Vue.h(_components.p,null,\"Later, Sugar began her winter vacation and got her diagnosis certificate of gender dysphoria in Shenzhen Kangning Hospital —— This was only known by A after her death.\"),\"\\n\",Vue.h(_components.h2,null,\"Thick fog over Jialing River (Her departure)\"),\"\\n\",Vue.h(_components.p,null,\"On January 22nd, 2024, she went back to her hometown, Chongqing, and regained contact with A.\"),\"\\n\",Vue.h(_components.p,null,\"(According to her mother who worked away from Chongqing, when she just returned home, she seemed happy in WeChat.)\"),\"\\n\",Vue.h(_components.p,null,\"But the reality is the opposite.\"),\"\\n\",Vue.h(_components.p,null,\"She contacted A before she began to execute her plan.\\nShe told A again and again that her purpose was not to die.\\nThe point is to make her parents realize the necessity of accepting her being trans by showing she's willing to die.\"),\"\\n\",Vue.h(_components.p,null,\"But the dosage she was about to take was fatal.\"),\"\\n\",Vue.h(_components.p,null,\"A and her other online friends couldn't persuade her, so they called for first aid as a last resort.\\nBecause they didn't know her exact location, the ambulance left after more than half an hour had passed.\"),\"\\n\",Vue.h(_components.p,null,\"Unfortunately, Sugar was in critical condition when the ambulance arrived at the Second People's Hospital of Yubei District of Chongqing.\\nAnd she passed away in the early morning of the next day due to chemical poisoning.\"),\"\\n\",Vue.h(_components.h2,null,\"After her departure\"),\"\\n\",Vue.h(_components.p,null,\"Later, through a variety of ways, Sugar's mother contacted A on the morning of January 23rd.\"),\"\\n\",Vue.h(_components.p,null,\"After A told her about Sugar's gender dysphoria and the fact of suicide, she was astonished and said:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,'\"He(sic. The same below) had never told us about this! Why he abruptly did……\"'),\"\\n\",Vue.h(_components.p,null,\"(It seemed that Sugar didn't directly and openly communicate with her parents about this.)\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"The loss of her child overwhelmed her.\\nShe said words like Sugar was too selfish and didn't care about them.\\nThen she tried to unlock Sugar's phone.\"),\"\\n\",Vue.h(_components.p,null,\"A asked her mother to bury Sugar as a daughter, but her mother replied like \",Vue.h(_components.a,{href:\"https://twitter.com/KiraRettosei/status/1749728762261012752?s=19\"},\"this\"),\".\\n(The link may be triggering.)\"),\"\\n\",Vue.h(_components.p,null,\"However, her mother's attitude was changing gradually.\"),\"\\n\",Vue.h(_components.p,null,\"Her parents started to tidy up her belongings.\"),\"\\n\",Vue.h(_components.p,null,\"Her mother asked A if she wanted to keep Sugar's IKEA Bl\\xe5haj Shark, which she loved to hug.\"),\"\\n\",Vue.h(_components.p,null,\"Her mother said he was their angel, but unfortunately, God made him leave early, and he had to leave.\"),\"\\n\",Vue.h(_components.p,null,\"Her mother had always been grateful to A.\"),\"\\n\",Vue.h(_components.h2,null,\"The new spring\"),\"\\n\",Vue.h(_components.p,null,\"It's February 12th, 2024—the third day of Spring Festival.\"),\"\\n\",Vue.h(_components.p,null,\"That night, A set off on a trip to Guiyang and Chongqing.\"),\"\\n\",Vue.h(_components.p,null,\"At Ningbo Lishe International Airport,\"),\"\\n\",Vue.h(_components.p,null,\"A sat on a seat near the windows, waiting for the launch of the plane.\"),\"\\n\",Vue.h(_components.p,null,\"In a daze, a phone call from Chongqing came, and she was familiar with the number.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"（\",Vue.h(_components.em,null,\"The words in brackets represent A.\"),\"）\"),\"\\n\",Vue.h(_components.p,null,\"Girl, how are you now? (I am fine, what happened?)\"),\"\\n\",Vue.h(_components.p,null,\"It's nothing, but…… I've always worried that you might……as well. So I'm calling to ask if you're okay or not.\"),\"\\n\",Vue.h(_components.p,null,\"Girl, if anything happens in the future, please tell your parents and not hold back and say nothing. Your parents will always love you.\"),\"\\n\",Vue.h(_components.p,null,\"After our generation became parents, we no longer keep the authority and stubbornness of our elders.\"),\"\\n\",Vue.h(_components.p,null,\"So do I…… The path I am currently taking in life is not what my parents hoped, but I think it's no problem.\"),\"\\n\",Vue.h(_components.p,null,\"We may not fully understand the decisions made by children, but we will support her if she carefully considers them.\"),\"\\n\",Vue.h(_components.p,null,\"Girl, I am glad you're okay. I wish you a happy life.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Sugar had a cute face and figure.\\nIf we change a character of her name to another homophonic one, it would become a girl's name that perfectly matches her gentle and soft temperament.\"),\"\\n\",Vue.h(_components.p,null,'But she just departed with a mentality of \"take a gamble\".\\nHer life was frozen at the age of 19.'),\"\\n\",Vue.h(_components.p,null,\"When Sugar just passed away, her mother couldn't accept her decisions. But what did her mother say in the end?\"),\"\\n\",Vue.h(_components.p,null,\"Anyway, she had passed away.\"),\"\\n\",Vue.h(_components.h2,null,\"Qingming\"),\"\\n\",\"\\n\",Vue.h(_components.p,null,\"Just before Qingming, her mother suddenly sent messages to A.\\nHer mother told A how diligent and excellent she was and how much they loved her.\"),\"\\n\",Vue.h(_components.p,null,\"Sugar's father said that Sugar was the brightest star in the sky.\"),\"\\n\",Vue.h(PhotoScroll,{photos:[\"${path}/photos/photo1.webp\"]}),\"\\n\",Vue.h(_components.p,null,\"However, everything went wrong.\"),\"\\n\",Vue.h(_components.p,null,\"If Sugar was still alive, what would happen now...?\"),\"\\n\",Vue.h(_components.p,null,\"It was a pity that she departed abruptly, without waiting for a turn for the better.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Hope you'll all remember Sugar.\"),\"\\n\",Vue.h(_components.p,null,\"I hope you can share important information, such as your address, with trustworthy friends to avoid any unexpected situations.\"),\"\\n\",Vue.h(_components.p,null,\"I hope that if you see a help request message, you don't just swipe.\"),\"\\n\",Vue.h(_components.p,null,\"I hope that if you can call the police, you can dial decisively. You are a lifesaver, not a murderer. Don't be afraid.\"),\"\\n\",Vue.h(_components.p,null,\"I hope you cherish life. Hope still exists; you will only miss the opportunity if you leave too early.\"),\"\\n\",Vue.h(_components.p,null,\"Hope you'll all remember Sugar.\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Take care.\"),\"\\n\",\"\\n\")}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;function _missingMdxReference(id,component){throw new Error(\"Expected \"+(component?\"component\":\"object\")+\" `\"+id+\"` to be defined: you likely forgot to import, pass, or provide it.\")}"