"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"AmbeR_the_anpa, born on September 1, 2004, from Yichun, Jiangxi Province. Anpa likes to drink at the bar and can also mix some wine himself. He has made a wish to become the strongest bartender. Anpa likes sports and has tried table tennis, skiing and other sports. She is also a badminton player in the city team. She plays badminton very well and it is like a shell when she fights. In my spare time, Anpa has also visited many cities across the country.\"),\"\\n\",Vue.h(_components.p,null,\"Anpa was not a transgirl at first, and after two months of dating with a transgirl, Anpa decided to become a transgirl. Anpa began receiving hormone therapy in 2019. In 2022, she went to Huilongguan Hospital in Beijing to continue treatment. However, when Anpa was in high school, her high school teacher bullied her, which made Anpa suffer from depression and still felt uncomfortable in her daily life. The two of them chose to work in the country after graduating from high school. Then he went to Weifang to work and adopted a little orange cat. After a while, the domestic environment changed a little. I felt that the domestic environment was not good and Anpa discussed with his lover. I decided to discuss with my family and ask them to support them in studying in Japan.\"),\"\\n\",Vue.h(_components.p,null,\"On October 3, 2023, Anpa went to Tokyo, Japan to study while working. During this period, she came to Waseda Street Psychia Clinic to seek a second medical advice, and local doctors supported Anpa’s desire to receive SRS based on the diagnostic and treatment guidelines of Japan’s GID, who was also satisfied with the medical environment in Japan.\"),\"\\n\",Vue.h(_components.p,null,\"Anpa was gentle and considerate throughout his life, rescued stray animals, and participated in voluntary blood donation. He has always been patient and generous with help and support for the vulnerable groups.\"),\"\\n\",Vue.h(_components.p,null,\"On July 14, 2024, Anpa attempted suicide and was rescued in the hospital ICU. At 6:12, Japan time on September 17, 2024, Anpa passed away in front of his lover due to life pressure and cyber violence. He was confirmed to die at 11:23 on the same day. After Anpa passed away, her family rushed to Japan and cremated Anpa with Anpa's lover at the funeral home in Nymph Sakuratai, Tokyo. Since the elderly in Anpa's family are still alive, they took a cold approach to what Anpa encountered during his lifetime, and everything ended.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"