"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",a:\"a\",blockquote:\"blockquote\",strong:\"strong\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Yantian was our friend, they did suicide intervention and other social work in transgender community and was a great company to many.\"),\"\\n\",Vue.h(_components.p,null,\"Everyone liked them very much, so they got an intimate name “Sister Yantian”.\"),\"\\n\",Vue.h(_components.p,null,\"They were also a \",Vue.h(_components.a,{href:\"https://en.wikipedia.org/wiki/Railfan\"},\"railfan\"),\", and their nickname originated from Shenzhen Metro Line 8 (also known as the Yantian Line).\"),\"\\n\",Vue.h(_components.p,null,\"By coincidence, before they celebrated their 23rd birthday, Line 8 Phase 2 opened on 27 December 2023, which extended the line from Yantian Road to Xiaomeisha.\"),\"\\n\",Vue.h(_components.h2,null,\"Their Departure and Our Memorial\"),\"\\n\",Vue.h(_components.p,null,\"At the end of 2023, Yantian was dealing with some troublesome things in Guangdong.\\nDuring this period, they overdrawn their energy, but they still worked tirelessly for everyone.\"),\"\\n\",Vue.h(_components.p,null,\"Owing to the need to maintain better sleep, Yantian had been using sedatives for a long time, and their medication gradually exceeded the safe dose.\\nPlus, they had overdrawn their energy a lot.\\nThese factors put their physical and mental health in danger.\"),\"\\n\",Vue.h(_components.p,null,\"Yantian unfortunately left us due to cardiac arrest on 12th January 2024.\\nOne Among Us members were extremely shocked and sad, too.\\nThis is a temporary entry for now. We'll finish this when people recover from sadness.\"),\"\\n\",Vue.h(_components.p,null,\"Based on this, We temporarily set up a small space online for them, to make their memorial warmer in this severe winter.\"),\"\\n\",Vue.h(_components.p,null,\"If you wish, you can share your memory of Yantian by comment.\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"Tips: Your comments and memories on this memorial page will be considered to be \",Vue.h(_components.strong,null,\"referenced\"),\" by default. One Among Us editors will complete their formal entry with your help. We will retain all approved comments in their formal entry.\"),\"\\n\",Vue.h(_components.p,null,\"If you don't hope your comment to be referenced, please mark it out.\"),\"\\n\",Vue.h(_components.p,null,\"You can send email to \",Vue.h(_components.a,{href:\"mailto:info@one-among.us\"},\"info@one-among.us\"),\" to contribute photos or other rich text or submit issue to our \",Vue.h(_components.a,{href:\"https://github.com/one-among-us/data\"},\"Github repository\"),\".\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Yantian, have a good rest and have a good sleep. Thank you for your efforts all this time.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"