"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function _createMdxContent(props){var _components=Object.assign({h2:\"h2\",p:\"p\",a:\"a\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"Yantian was our friend, they contributed to suicide intervention and other supports in transgender community, and accompanied others warmly and friendly.\"),\"\\n\",Vue.h(_components.p,null,\"Everyone liked them very much, and they got a intimate name “Sister Yantian”.\"),\"\\n\",Vue.h(_components.p,null,\"They were also a \",Vue.h(_components.a,{href:\"https://en.wikipedia.org/wiki/Railfan\"},\"railfan\"),\", and their nickname originated from Shenzhen Metro Line 8 (also known as the Yantian Line).\"),\"\\n\",Vue.h(_components.p,null,\"By coincidence, before they celebrated their 23rd birthday, Line 8 Phase 2 opened on 27 December 2023, which extended the line from Yantian Road to Xiaomeisha.\"),\"\\n\",Vue.h(_components.h2,null,\"Their Departure and Our Memorial\"),\"\\n\",Vue.h(_components.p,null,\"At the end of 2023, Yantian was dealing with some trouble things happend in Guangdong. During this period, they overdrawn their energy, but they still overclocked (worked tirelessly) for everyone.\"),\"\\n\",Vue.h(_components.p,null,\"Owing to the need of maintaining better sleep, Yantian had been using sedatives for a long time, and their medication gradually exceeded the safe dose.\\nPlus, they had overdrawn their energy a lot.\\nThese factors put their physical and mental health in danger.\"),\"\\n\",Vue.h(_components.p,null,\"Yantian unfortunately left us due to cardiac arrest on 12th January 2024.\\nOne Among Us members were extremely shock and sad, too.\\nBut we cannot push formal entry for them until people recovered from sadness.\"),\"\\n\",Vue.h(_components.p,null,\"Based on this, We temporarily set up a small room for them, to make their memorial warmer in this severe winter.\"),\"\\n\",Vue.h(_components.p,null,\"If you wish, you can share your memory with Yantian by comment.\"),\"\\n\",Vue.h(_components.p,null,\"Yantian, have a good rest...have a good sleep. Thank you for your efforts all this time.\"))}function MDXContent(props){if(props===void 0)props={};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent,props)):_createMdxContent(props)}var _default=MDXContent;"