"\"use strict\";Object.defineProperty(exports,\"__esModule\",{value:true});Object.defineProperty(exports,\"default\",{enumerable:true,get:function(){return _default}});function MDXContent(props){if(props===void 0)props={};var _createMdxContent=function _createMdxContent(){var _components=Object.assign({h2:\"h2\",p:\"p\",em:\"em\",a:\"a\",blockquote:\"blockquote\"},props.components);return Vue.h(Vue.Fragment,null,Vue.h(_components.h2,null,\"Description\"),\"\\n\",Vue.h(_components.p,null,\"As her bio says, Jing Ye is “a cute girl researching lingustics”.\"),\"\\n\",Vue.h(_components.p,null,\"Jing Ye is talented in linguistics and passionate about it.\\nShe researched many languages, including both languages originated from China and foreign languages.\\nShe often switch languages while chatting online, so she always seemed lively, cheerful, and even humorous in group chats.\\nNot only was she proficient in communicating with many languages,\\nbut she also was quick to come up with examples of how pronounciation and grammar are used in everyday conversations for those languages.\"),\"\\n\",Vue.h(_components.p,null,\"Jing Ye's work is not limited to linguistics.\\nShe had contributed to the community of the \",Vue.h(_components.em,null,\"Half-Life\"),' series.\\nShe designed some \"GMod\" plugins and maps; and she was the director of a fanmade work called ',Vue.h(_components.em,null,\"Prequel of the United Army\"),\" for \",Vue.h(_components.em,null,\"Half-Life 2\"),\".\\nThe fact that worth mentioning the most is, she started doing constructed language research,\\nconstructed \",Vue.h(_components.a,{href:\"https://yuyan.fandom.com/zh/wiki/%E8%81%94%E5%90%88%E5%86%9B%E8%AF%AD\"},\"联合军语\"),\", \",Vue.h(_components.a,{href:\"https://yuyan.fandom.com/zh/wiki/%E5%B0%A4%E6%B3%A2%E4%BC%8A%E8%AF%AD\"},\"尤波伊语\"),\" and \",Vue.h(_components.a,{href:\"https://yuyan.fandom.com/zh/wiki/%E5%85%8B%E9%87%8C%E5%8A%A0%E8%AF%AD\"},\"克里加语\"),\" for the project mentioned above, \",Vue.h(_components.em,null,\"Prequel of the United Army\"),\".\\nBecause of her work on this project, she was famous both in the \",Vue.h(_components.em,null,\"Half-Life\"),\" community and in the contructed language community.\"),\"\\n\",Vue.h(_components.p,null,\"Jing Ye's favorite anime is \",Vue.h(_components.em,null,\"YuruYuri\"),\".\\nShe used the main character, Akari Akaza, as her profile photo.\"),\"\\n\",Vue.h(_components.p,null,\"Jing Ye is persistent and brave, both for creative work and for life, sometimes even stubborn.\\nBecause of that, she had some verbal conflicts with her friends.\\nThese incidents were however resolved quickly because of her friends' understanding towards her character.\"),\"\\n\",Vue.h(_components.p,null,\"Jing Ye asked for company very often from friends she found in the linguistics community because she didn't feel safe enough.\\nWhether online or in real life, she was always gave and seeked warmth from other trans women and girls.\"),\"\\n\",Vue.h(_components.p,null,\"Since Spring 2019, Jing Ye was finally able to pass and live as a woman.\\nBecause of that, she was much more confident and more open to showing her cuteness by sharing photos on social media.\\nHowever, her life quality went down as both her financial situation and her depression got worse, even went to the edge of suicide sometimes.\\nEven then, she did not stop her efforts to help other trans people.\\nIn \",Vue.h(_components.a,{href:\"https://www.zhihu.com/pin/1091048372731047936\"},\"one of her posts on ZhiHu\"),\", she wrote:\"),\"\\n\",Vue.h(_components.blockquote,null,\"\\n\",Vue.h(_components.p,null,\"“Although living is painful for me and I do not know the meaning behind life, I know that I would never regret helping others.”\"),\"\\n\"),\"\\n\",Vue.h(_components.p,null,\"Even now, this sentence still give strength to many suicide prevention social workers.\\nUnfortunately, Jing Ye eventually left us, leaving behind many unfinished works.\"),\"\\n\",Vue.h(_components.p,null,\"After Jing Ye's death, many people in the linguistics community, the constructed language community, and the trans community changed their profile photo to black and white to morun her.\"),\"\\n\",Vue.h(_components.p,null,\"Under the ZhiHu question of \",Vue.h(_components.a,{href:\"https://www.zhihu.com/question/307482232\"},\"What are your thoughts about ZhiHu user @Cang_Shan_Jing_Ye ?\"),\",\\nnot only were there goodbyes from the friends she made,\\nbut also messages from the linguistics community, to achieve more in this field;\\nand messages from the trans community, to encourage each other to keep going.\"),\"\\n\",Vue.h(_components.p,null,\"Contributor for this entry: unt\"))};var _ref=props.components||{},MDXLayout=_ref.wrapper;return MDXLayout?Vue.h(MDXLayout,props,Vue.h(_createMdxContent)):_createMdxContent()}var _default=MDXContent;"